[{"startTime": "0.65", "endTime": "24.72", "role": "C", "text": "Yeah , it says Is it sliding past?"}, {"startTime": "1.13", "endTime": "19.62", "role": "B", "text": "I mean if you're ever , you know , late 'cause of that , it's not we'll find a way around it. And I've put you guys on Mondays at this time for my convenience , but it's not like it's important that Really?"}, {"startTime": "4.4", "endTime": "4.84", "role": "A", "text": "Yeah."}, {"startTime": "11.12", "endTime": "48.31", "role": "A", "text": "Yeah. Well uh I was expecting to get , yeah , though and I did did make it in time. But it just just 'cause all the leaves and things. Um the stra the trains weren't stopping at the stations. So they decided to put speed restrictions on Yep. Yeah. 'Cause apar apar apparently p uh I'm not sure. Um the and they're bussing people into station have particular problems on it 'cause it's on a 'cause it's on a hill or something. Um so I had so I had to bus people in from like stations either side. Yes , yes. But yeah , at l at least it was speed restrictions instead of like trains flying past into barriers and things. So Oh , f yeah."}, {"startTime": "20.88", "endTime": "25.74", "role": "B", "text": "I really? Great. I was th so what'd they have to do , back up?"}, {"startTime": "32.03", "endTime": "32.69", "role": "B", "text": "Ah."}, {"startTime": "37.54", "endTime": "38.13", "role": "B", "text": "Nasty."}, {"startTime": "44.13", "endTime": "46.24", "role": "B", "text": "Yeah , yeah. Go i we're glad they'll look after that bit."}, {"startTime": "44.16", "endTime": "45.64", "role": "C", "text": "Yes."}, {"startTime": "58.79", "endTime": "58.94", "role": "A", "text": "Okay."}, {"startTime": "60.58", "endTime": "62.9", "role": "B", "text": "Uh I don't know. Do we wanna look at anything? It's not up yet."}, {"startTime": "62.88", "endTime": "70.97", "role": "C", "text": "Still fifty six percent completed. Skip it. 'Cause I'm just doing a b yeah , disk check or something."}, {"startTime": "66.29", "endTime": "72.34", "role": "B", "text": "I can Oh I don't know what it's doing."}, {"startTime": "75.69", "endTime": "76.57", "role": "B", "text": "Oops , that fell off."}, {"startTime": "77.78", "endTime": "78.66", "role": "B", "text": "Doesn't like silk."}, {"startTime": "83.26", "endTime": "85.2", "role": "B", "text": "Stay."}, {"startTime": "89.86", "endTime": "94.17", "role": "B", "text": "And now we're gonna discover we've got no reason to meet , right. 'Cause everything's going swimmingly."}, {"startTime": "91.9", "endTime": "92.08", "role": "C", "text": "Yep."}, {"startTime": "95.45", "endTime": "96.42", "role": "C", "text": "Is everything going smooth?"}, {"startTime": "97.39", "endTime": "99.25", "role": "B", "text": "Oh."}, {"startTime": "97.81", "endTime": "102.3", "role": "A", "text": "Well , you know , apa pa apart from apart all apart from waiting for the get get Camtasia sorted out."}, {"startTime": "104.1", "endTime": "123.69", "role": "B", "text": "'Cause uh I haven't been I haven't read the Wikis in my email since I left. So um Oh yeah. Uh-huh."}, {"startTime": "109.55", "endTime": "208.78", "role": "A", "text": "Yeah , I haven't I haven't added anything to the Wiki recently. So uh 'Cause I've we've been been working on trying to get the X_M_L_ stuff working. So some the ba basically they only had to how the DOM works , um so I can do the next so I can ge generate D_D_F_ files. Huh? Um so so th yeah , so just just been reading through documentation , that's what I was doing the end of last week um just so I know how it all works and figuring out the best way to do things. Um but I'm at the moment I've I've been playing with the DOM stuff in Mozilla. Uh 'cause I 'cause uh ju just so at least I can see how it works with the H_T_M_L_ pages so I can generate um the X_ so I can generate X_H_T_M_L_ stuff and see how it all works there. Just 'cause to just see how things work in that um and It well , thing is that the A_ the A_ well the A_P_I_ is standardized by the W_ three C_. So the A_P_I_ is stan is standard between everything. Um Uh or Yeah , yeah , yeah. It is. It it just has a couple of yeah , yeah. Um well yeah but if they will b but it doe does look like it does does that this is and things like that. So I was doing the is anyway. Um it's ju it's just that that's that's quite a quick way to just to get into how how works. Because I can just quickly generate quickly generate a web page and then just add and take yeah , add things to and take things away and don't see exactly what's going on at the time. So Oh well just 'cause X_H_T_M_L_ has a nice you know , you got browsers there , so you can actually see you can actually see directly what's what's going on."}, {"startTime": "132.01", "endTime": "132.23", "role": "B", "text": "Uh-huh."}, {"startTime": "149.08", "endTime": "177.95", "role": "B", "text": "Um the oh , well um I don't know the Mozilla stuff. So if it turns out that it's idiosyncratic in some way that teaches you funny habits , then it won't have been a good idea. So Yeah , yeah. Uh well y th there are certain companies um that I don't wanna name who don't always get it right. I c but m yeah , Mozilla. Yeah , it'll be alright. So okay. I believe you now , it's a good strategy."}, {"startTime": "186.37", "endTime": "186.7", "role": "B", "text": "Mm-hmm."}, {"startTime": "197.76", "endTime": "202.28", "role": "B", "text": "Uh wh why does it help that it's X_T_ H_T_M_L_ instead of just X_M_L_?"}, {"startTime": "207.64", "endTime": "226.14", "role": "B", "text": "Yeah , but most m most browsers , when when you uh put an X_M_L_ file up in it , it'll just apply some default style sheet to it anyway that shows you Okay , yeah."}, {"startTime": "216.39", "endTime": "224.09", "role": "A", "text": "Yeah , well I'll I'm using X_H_T_M_L_ uh to deter that's uh all all the web pages are X_H_T_M_L_. So it's X_M_L_ just with the H_T_M_L_ D_T_D_."}, {"startTime": "225.87", "endTime": "238.91", "role": "A", "text": "Yeah. Ju ju ju just ba just 'cause we haven't uh we haven't f haven't quite finalised the um the G_D_F_ format. So just just well just Yeah , yeah. So all have to do is just change it change that sort of thing so it's uh yeah. Yeah."}, {"startTime": "231.42", "endTime": "234.91", "role": "B", "text": "Okay , so all you're gonna have to do is swap in tag names later. Okay."}, {"startTime": "237.19", "endTime": "279.99", "role": "B", "text": "Ev everybody's got their different ways of doing these things. I'm sure that's fine. Like having to uh g it's Yeah. No , I'm just try I'm trying to l think of the things that could go wrong. Um but since I haven't tried it this particular way , you know , um but yeah , that sounds good. So um i so you say we haven't finalised what the G_D_F_ looks like. Is that an implicit request for me to do something? Or Uh-huh."}, {"startTime": "240.89", "endTime": "241.07", "role": "C", "text": "Hmm."}, {"startTime": "241.75", "endTime": "248.39", "role": "C", "text": "Mm. As long as it comes out in the end. That's Mm."}, {"startTime": "244.73", "endTime": "245.34", "role": "A", "text": "Yeah , yeah."}, {"startTime": "251.65", "endTime": "300.9", "role": "A", "text": "Yeah. Yeah , but Um that what what what what I'm doing the moment I'm looking through the s the uh stuff that Robin put on the Wiki to say what's , you know , what what we need in the in the t um in the output format for the for the task , you know. So what what you're what you're gonna do the analysis on. Um so I'm making sure that I can take get that information out of the G_D_F_ as it st state of the moment. And if I find something that you can't get out of it then I can add that to the add that to the G_D_F_ format. So Yeah , yeah."}, {"startTime": "283.99", "endTime": "336.06", "role": "B", "text": "Yeah. As a well , I mean there's two two cases in here , right. There's things you can get straight off the original format , and then there's things you have to do some kind of post-processing of the original format. But it's not just a data format change , it's actually some kind of computational process to get the thing out of it as well , right? And it wasn't uh y I think it was a little bit um confused uh last time we spoke about um whether U whether you consider G_D_F_ format to be um the thing that's just the straight-forward translations of what's in the original eye-tracking output , or whether like whether the post-processing utilities are a separate step. 'Cause I think you and I had separate different views on this , but I can't remember w who had which view at this point. So y are you working uh actively on this anal these analysis things or you just working on the translation? Uh so the data format translation."}, {"startTime": "328.93", "endTime": "360.96", "role": "A", "text": "Yeah , well the Well I'm I'm I'm ju try I'm making sure that the G_D_F_ format we've got at the moment will d will output say well I've output old analysis that that Robin's looking for. Um so so I'm using that as a way to to get into ha ha using the DOM things as well. Um so yeah. So at the moment I'm looking at act actually the G_D_F_ format itself um and then to generate the G_D_F_ format I'm gonna be taking stuff out of the gest analyser um and then using a DOM parser to generate uh X_M_L_ output from the gest analyser."}, {"startTime": "359.26", "endTime": "367.29", "role": "B", "text": "Oh okay. So you haven't looked at what's in there and what isn't in there that you need to do some really intensive transform to do. Not yet , oh okay."}, {"startTime": "365.64", "endTime": "388.92", "role": "A", "text": "Uh no. No. But uh I'll when and out of the output of the gest analyser does does do some of the processing already , which is what I'll m plan to use that as the basis for it. 'Cause that already that already picks up like target regions , things like that. So you get so so it knows whether you're looking at a part or whether you're looking at target area or what or whatever. Um so yes , as long as it got that in it somewhere. So it's just a matter of pulling that out and put that into the um into the G_D_F_ stuff."}, {"startTime": "373.35", "endTime": "373.79", "role": "B", "text": "Yeah."}, {"startTime": "381.56", "endTime": "381.78", "role": "B", "text": "Uh-huh."}, {"startTime": "388.37", "endTime": "419.83", "role": "B", "text": "Okay. So this sounds like it's under control and you're happy and you guys are telling each other what you guys need to know. So I don't need to do anything , right. You're all fine. But there was a number of things that came before this , right , that it sounds like they're not under control yet. So so you know , the G_D_F_ stuff with so i Ellen's view on this is we go through everything in order. Like the priority is exactly the pipe-line order , right? So um Camtasia you mentioned. And I'm not sure what else , but we should check what other things were before this on the list of things to do."}, {"startTime": "396.4", "endTime": "426.94", "role": "C", "text": "Uh nope , don't think so. Um Mm-hmm."}, {"startTime": "411.47", "endTime": "411.69", "role": "A", "text": "Yep."}, {"startTime": "414.75", "endTime": "434.98", "role": "A", "text": "Yeah , um bu Yeah , yeah. I um I think the o the only thing I've got left to do before the experiments can be run is get s is get the check Camtasia works. Um now I've got Camtasia running on machines and I think they're set up correctly. But I can't test it until we get the microphones working. Microphones."}, {"startTime": "433.58", "endTime": "436.09", "role": "B", "text": "Until you get the oh , microphones."}, {"startTime": "436.13", "endTime": "547.99", "role": "A", "text": "'Cause Ah. Well he must some these days anyway , isn't it. So so Yeah. So we all got off easy."}, {"startTime": "436.37", "endTime": "441.78", "role": "C", "text": "Uh it's batteries we're waiting for. The they're they're due uh i I was told the beginning of this week."}, {"startTime": "438.54", "endTime": "439.17", "role": "B", "text": "Batteries."}, {"startTime": "442.57", "endTime": "445.36", "role": "B", "text": "Okay , uh are they really really strange batteries?"}, {"startTime": "445.57", "endTime": "459.14", "role": "C", "text": "Um th they are quite strange. Mm uh uh it's w uh r um a Avril has ordered them from somewhere possibly. N no. They're probably one fifty each or something like that."}, {"startTime": "448.39", "endTime": "449.27", "role": "B", "text": "Have you tried Maplin?"}, {"startTime": "454.26", "endTime": "454.93", "role": "B", "text": "Are they expensive?"}, {"startTime": "459.08", "endTime": "464.61", "role": "B", "text": "'Cause you know , like a wee bus journey over to Maplin might solve the problem if it's getting in the way."}, {"startTime": "465.12", "endTime": "474.19", "role": "C", "text": "Uh well hopefully. The they should've been here last week. But uh Caroline then phoned up to chase them and they they were s they were told to be here. Should be today."}, {"startTime": "474.44", "endTime": "479.24", "role": "B", "text": "So this isn't actually um ruining your schedule for anything , and that's why you're waiting."}, {"startTime": "479.88", "endTime": "489.23", "role": "C", "text": "Uh r b well we can still test whether Camtasia runs anyway. It's just the uh whether it's the microphones are picking up things correctly that we need to check."}, {"startTime": "488.48", "endTime": "514.99", "role": "B", "text": "Right , okay. It is i so it sounds like you're not actually worried about the fact that this is the m yeah. When you get worried , go to Maplin , okay. Phone them first to make sure that they're in there. Somebody around must have a uh probably Steve. Somebody in the techie group will have a Maplin catalogue. Fact , I'll see if I can um yeah , it's useful to know who's got a current one anyway. I don't seem to get them anymore. I guess I don't buy enough equipment."}, {"startTime": "493.43", "endTime": "498.48", "role": "C", "text": "Not yet , no. Right."}, {"startTime": "506.39", "endTime": "506.76", "role": "C", "text": "Mm right-o."}, {"startTime": "521.1", "endTime": "523.37", "role": "B", "text": "Oh yeah. Of course. Duh."}, {"startTime": "525.05", "endTime": "551.88", "role": "B", "text": "So you can find out whether they have it. But you'd have to phone over to find out if they have it in stock down there. I actually live not that far from there. Um so it would be a half hour um diversion from my morning routine to pick up stuff. Uh w but then again , it's also very close to Haymarket , so it's even less of a diversion for you , probably. Except you don't know your way around."}, {"startTime": "525.7", "endTime": "526.17", "role": "C", "text": "Virtual."}, {"startTime": "529.3", "endTime": "529.82", "role": "C", "text": "Yep."}, {"startTime": "542.57", "endTime": "572.13", "role": "C", "text": "Uh right. But what we're I I Mm-hmm. It no , it's two batteries we need."}, {"startTime": "551.12", "endTime": "563.24", "role": "A", "text": "Yeah. Ah well ca I can easy I can easy get to mapl uh to Maplin I know where it is off I used to live there. So I know I know where I used to live here. I'm a geek. I know where I know where Maplin is."}, {"startTime": "556.19", "endTime": "559.41", "role": "B", "text": "Ah yeah. Oh yeah , c yeah."}, {"startTime": "562.73", "endTime": "570.5", "role": "B", "text": "Yeah. I just think well , you know , for the sake of three quid or however many quid it how many batteries does this thing take? Doesn't take a hundred."}, {"startTime": "572.35", "endTime": "574.95", "role": "B", "text": "Yeah , then , you know , put your mind at rest."}, {"startTime": "576.97", "endTime": "582.39", "role": "B", "text": "'Cause , you know , you wouldn't want it to be the morning you were supposed to be recording and then suddenly discover yeah. You know this."}, {"startTime": "579.97", "endTime": "582.92", "role": "C", "text": "Uh no no. No. Yes."}, {"startTime": "580.85", "endTime": "581.02", "role": "A", "text": "Yeah."}, {"startTime": "583.3", "endTime": "591.5", "role": "A", "text": "Well I suppose I could gi I could give you a call on the way in tomorrow and if th not bi it's not been in your in your f um pigeon hole , I can easy go off the train and early and just pick 'em up from there."}, {"startTime": "592.05", "endTime": "594.48", "role": "C", "text": "Fair fair enough if you want. Mm-hmm."}, {"startTime": "592.56", "endTime": "595.21", "role": "B", "text": "Uh check they got 'em first though. Their stocks are a bit funny down there."}, {"startTime": "595.88", "endTime": "600.72", "role": "A", "text": "Right , yeah. Well I'll make sure I make a I'll make sure of I got the f the phone number in my phone so I can call them."}, {"startTime": "600.9", "endTime": "607.04", "role": "B", "text": "'Cause you know , it's not that attractive an area to walk through if you're not gonna get anything out of it."}, {"startTime": "605.9", "endTime": "740.67", "role": "A", "text": "All true. True. Um uh it's Dalry road , isn't it. Um Yep."}, {"startTime": "612.55", "endTime": "617.76", "role": "B", "text": "So of all the things that were on the Wiki do I need to pull up the Wiki? Ah , it is gonna let me log in."}, {"startTime": "624.69", "endTime": "628.02", "role": "C", "text": "It's still probably even that angle."}, {"startTime": "629.2", "endTime": "630.87", "role": "B", "text": "No , I do not wanna change my password."}, {"startTime": "636.94", "endTime": "644.62", "role": "B", "text": "Um But you guys probably know off the top of your head , is there anything else that we we we were waiting on before you could run?"}, {"startTime": "644.55", "endTime": "677.81", "role": "C", "text": "Can't remember the Wiki. D um The only thing that well the thing that's holding s me slightly up is um checking whether Joe's f finished that there i there is a working um model builder. But I'm not sure if it's the finished finished version yet. And the the ninth Yeah , he still had n hours left. I wasn't sure uh if it was down to the number of hours or whether thirty first of October f uh certainly uh uh he right."}, {"startTime": "648.76", "endTime": "650.46", "role": "B", "text": "So all those tasks Craig had when it started."}, {"startTime": "664.46", "endTime": "667.19", "role": "B", "text": "Uh his last day was the thirty first of October."}, {"startTime": "675.99", "endTime": "697.29", "role": "B", "text": "Uh yeah , no no. It's ours. Yeah , it's ours. Oh , so he's got ours left.He's behind-hand. But no , he was billing for he was billing by the hour. So I thought well , I mean obviously if he wants to finish off then you know. I b Oh well they're probably away then."}, {"startTime": "680.82", "endTime": "682.66", "role": "C", "text": "I think he's had something like seven."}, {"startTime": "691.08", "endTime": "695.65", "role": "C", "text": "But uh n I've n ni Nijmegen has gone dead for all those last two weeks."}, {"startTime": "698.71", "endTime": "704.65", "role": "C", "text": "Well uh it w e e Ellen's away. N no , um but I think what they had was some big review."}, {"startTime": "698.81", "endTime": "701.06", "role": "B", "text": "Wasn't Ellen away? They're really at the same place."}, {"startTime": "706.36", "endTime": "707.53", "role": "B", "text": "Oh , yeah it could be it."}, {"startTime": "706.42", "endTime": "739.55", "role": "C", "text": "Uh a and so I haven't heard anything back from them. So uh the models for Yes , uh-huh. Well no. Well we don't need to um make the the parts are all the standard tangram ones I had before anyway. The X_ fig thing's only when we come to building airplanes and new peculiar shapes. Uh but for this experiment it's just the tangram type uh task."}, {"startTime": "712.48", "endTime": "715.48", "role": "B", "text": "Oh , you have no models at all. Oh , that's a pity."}, {"startTime": "717.38", "endTime": "725.01", "role": "B", "text": "Model buil builder , that's what I was calling the graphical model editor , right? So you use X_ fig to make the parts and then you this thing."}, {"startTime": "729.39", "endTime": "729.82", "role": "B", "text": "Oh okay."}, {"startTime": "738.37", "endTime": "738.53", "role": "B", "text": "Yep."}, {"startTime": "739.91", "endTime": "751.94", "role": "B", "text": "Okay. Um I have something in my email about from Joe. Uh he wouldn't have sent it just to me , would he? Do you want me to check that? I'm not gonna project my email."}, {"startTime": "750.0", "endTime": "752.68", "role": "C", "text": "Um yeah , if you got right."}, {"startTime": "754.9", "endTime": "804.16", "role": "C", "text": "How r f how recently that nothing I haven't i heard anything from Joe for a a week or so anyway. So Yeah. That's that's newer than the It's the last thing was in sp response to the thing I was saying last week about the parallelogram being the wrong way around and uh w from the model builder to the actual yeah. Um that nothing has I haven't heard anything since from either sort of the Netherlands or from you."}, {"startTime": "754.92", "endTime": "756.28", "role": "A", "text": "I t I'd say you don't be."}, {"startTime": "760.58", "endTime": "765.48", "role": "B", "text": "Okay , I think I mighta heard Thursday or something. I can't remember exactly when it was."}, {"startTime": "779.92", "endTime": "819.22", "role": "B", "text": "Uh Okay , so I've got something on the twenty eighth. That's Friday I think. Oh , he just wants to know how to get paid. Right. That suggests he's done done done. Anyway , he's in Edinburgh. So well I suppose he won't come by 'cause Craig's on his desk."}, {"startTime": "781.88", "endTime": "782.73", "role": "A", "text": "Mm."}, {"startTime": "794.66", "endTime": "796.71", "role": "A", "text": "Yeah , yeah. screen shots. Yeah , yeah."}, {"startTime": "804.83", "endTime": "805.02", "role": "A", "text": "Oh."}, {"startTime": "806.09", "endTime": "806.35", "role": "A", "text": "Hmm."}, {"startTime": "814.87", "endTime": "815.15", "role": "C", "text": "Yep."}, {"startTime": "819.95", "endTime": "823.62", "role": "C", "text": "Oh , is he back? Oh is he? Oh no , right okay."}, {"startTime": "821.03", "endTime": "833.05", "role": "B", "text": "Yeah. So Well , he's just not gonna try to le squat there , that's all."}, {"startTime": "824.4", "endTime": "831.15", "role": "A", "text": "Well I'm I'm using DICE machines. If he wants to pop in for five minutes , the the Windows machine is free for him at the moment."}, {"startTime": "835.32", "endTime": "855.17", "role": "B", "text": "Uh well I so the last thing I've got from him about work work was the nineteenth of October that said he uploaded some changes that you wanted. That's Oh , so you didn't get that. It was me and him. But presumably the he put it on the Wiki. So So he's just telling us 'cause he things we probably don't read Wikis."}, {"startTime": "857.97", "endTime": "859.18", "role": "B", "text": "And I'll just check."}, {"startTime": "859.92", "endTime": "868.95", "role": "C", "text": "Yeah , it was after it was after that that uh there was the thing about um w w why the parallelogram was the was a mirror image."}, {"startTime": "860.34", "endTime": "861.03", "role": "A", "text": "Yeah."}, {"startTime": "869.82", "endTime": "911.23", "role": "A", "text": "Yeah I mean I considering we get an email from uh the I think it got sent through saying that he'd updated the the whatever it was on the Wiki. So you do he'd he'd uploaded a ne a new zip file and overwritten the old one. So Yep."}, {"startTime": "879.23", "endTime": "879.77", "role": "C", "text": "Mm-hmm."}, {"startTime": "880.21", "endTime": "922.38", "role": "B", "text": "Yeah. Well I I haven't replied to him about yeah , I really don't have anything more more recent from him. S I haven't replied to him about um you know , how to submit costs and stuff like that. So um but that suggests he's at at the end of things , but w we could just ask him. I mean maybe you guys would just wanna ask him directly you're done done , right? 'Cause um it's worth you guys knowing. And then of course any problems that remain you inherit. Uh right , you know , it's worth taking a look at what it does and making sure it does what you want , I guess. So th the problem is you want you wanted to construct some models in it for your experiment but you were hoping to get some from Marloes."}, {"startTime": "914.585", "endTime": "920.62", "role": "C", "text": ". Yes."}, {"startTime": "922.52", "endTime": "937.18", "role": "C", "text": "Yes , or at l least um she was meant to have have some idea of the level of complexity. 'Cause they d they d have actually run things and to uh get an idea of the sort of style and to check that they'd be alright. But all very quiet."}, {"startTime": "929.64", "endTime": "930.69", "role": "B", "text": "Ah yeah , yeah."}, {"startTime": "937.49", "endTime": "951.3", "role": "B", "text": "Right , have you you tried cold-calling her? That's what I do when I need things that Ach , try phone."}, {"startTime": "940.53", "endTime": "940.64", "role": "C", "text": "Yeah."}, {"startTime": "943.44", "endTime": "966.12", "role": "C", "text": "Uh no , it has just been email rather than uh f f the telephone type of uh request. But I'm down for a week. What's the seventh is a w a week today , I think. Next week."}, {"startTime": "953.84", "endTime": "956.29", "role": "B", "text": "When i if you get 'em today , when are you gonna start running?"}, {"startTime": "965.62", "endTime": "968.07", "role": "B", "text": "Oh right. So you have to be you have to be ready by then."}, {"startTime": "968.33", "endTime": "979.81", "role": "C", "text": "Um well uh I haven't booked anybody in or anything. But uh that's when I'm hoping. We have been of course put back a bit by the eye tracker going down."}, {"startTime": "970.2", "endTime": "971.97", "role": "B", "text": "Yeah , or re change the schedule."}, {"startTime": "974.49", "endTime": "975.2", "role": "B", "text": "Right , okay."}, {"startTime": "980.44", "endTime": "982.49", "role": "B", "text": "Uh-huh , yeah. Makes sense."}, {"startTime": "983.99", "endTime": "996.19", "role": "B", "text": "Um subjects , you're gonna have d Yeah. So s y y you don't have subjects lined up , but you don't expect any trouble getting them."}, {"startTime": "984.65", "endTime": "984.91", "role": "A", "text": "Yep."}, {"startTime": "985.61", "endTime": "994.91", "role": "C", "text": "But uh we're we're needing we're certainly needing some data in the bag by the first of December , I think No."}, {"startTime": "996.74", "endTime": "999.26", "role": "C", "text": "Um hopefully not."}, {"startTime": "999.02", "endTime": "999.44", "role": "B", "text": "Mm-hmm."}, {"startTime": "1000.82", "endTime": "1015.99", "role": "C", "text": "The only other slight complication is um which will be b I think brought up at the meeting on Thursday for all the eye tracking users. Um uh the lab has been block-booked again."}, {"startTime": "1011.35", "endTime": "1011.81", "role": "B", "text": "Yeah."}, {"startTime": "1016.71", "endTime": "1017.29", "role": "B", "text": "By?"}, {"startTime": "1017.65", "endTime": "1021.26", "role": "C", "text": "Jules from um Psychology."}, {"startTime": "1021.99", "endTime": "1057.8", "role": "B", "text": "Um I don't know this person. So they well , they need to be serious about it. Who who's their is that a staff member or a student? Okay. Um well , we kinda paid for the lab. So it depends , but I suppose talking to them sometimes solves these problems. Um you might it depends on what sort of staff member is it? Is it a Right. Um I mean presumably he or she is not running subjects the entire Block book for how long?"}, {"startTime": "1028.04", "endTime": "1031.82", "role": "C", "text": "Have di Yep."}, {"startTime": "1047.45", "endTime": "1048.04", "role": "C", "text": "Lecturer."}, {"startTime": "1054.0", "endTime": "1068.05", "role": "C", "text": "Well presumably not. But uh it's sort of quite solidly booked uh for f certainly w what six days from ten till five for two or three of those days."}, {"startTime": "1064.77", "endTime": "1065.07", "role": "B", "text": "Uh-huh."}, {"startTime": "1068.6", "endTime": "1091.97", "role": "B", "text": "Uh-huh. Um so uh um Ellen's still out of town , right? It's just uh y you could try calling this person and see how this works. Ellen might be more persuasive. Um it's just sometimes uh academic staff have a bit of a chip about um research staff. And since I don't know the person , I can't tell whether it's one of those or not."}, {"startTime": "1091.81", "endTime": "1098.88", "role": "C", "text": "Um I wouldn't I no I can probably at least email her and ask her uh if she's really needing it all that time."}, {"startTime": "1099.65", "endTime": "1116.62", "role": "B", "text": "Mm-hmm. Yeah , and then escalate , I guess. But uh , you know , or whether they can be put off for a little bit or something. So I have no idea how the booking system works. Well , you're discussing it on Thursday , right? At the moment , there's just a booking system. Yeah."}, {"startTime": "1112.69", "endTime": "1119.6", "role": "C", "text": "I i well yeah , at the m yep. When people just uh if they can log on to it can book it."}, {"startTime": "1120.53", "endTime": "1131.61", "role": "B", "text": "Yep. Well that's that's one to raise at the meeting. Um I v might talk to Ellen about that ahead of time 'cause uh they may have she and Martin may have had discussions about appropriate use of the lab."}, {"startTime": "1122.72", "endTime": "1123.16", "role": "C", "text": "Mm-hmm."}, {"startTime": "1130.21", "endTime": "1134.32", "role": "C", "text": "Uh i th in theory JAST is meant to have it every morning."}, {"startTime": "1135.4", "endTime": "1146.58", "role": "B", "text": "Oh really? Yeah , but I g don't you guys set up for isn't block-booking more appropriate? Because I i isn't there set-up involved in changing around for somebody else?"}, {"startTime": "1148.02", "endTime": "1157.67", "role": "C", "text": "Um but it uh there shouldn't be any changes in the physical connections or or anything. No."}, {"startTime": "1155.46", "endTime": "1158.5", "role": "B", "text": "No? Or in the software or anything? Okay."}, {"startTime": "1160.08", "endTime": "1163.53", "role": "B", "text": "So there's no cost associated with it being mornings or afternoons."}, {"startTime": "1164.17", "endTime": "1201.52", "role": "C", "text": "Uh no. that as long as p other people don't for some reason , I don't know , disconnect some bits of the equipment , there's no reason why they should. It's just the Uh yes , it's um it's on the p uh it's not on the booking system. It's on a web page that Frank created about the lab. Which I don't know if anybody actually knows is there. Mm-hmm."}, {"startTime": "1173.57", "endTime": "1184.3", "role": "B", "text": "Yeah. S so in the worst case um you may be able to make an argument if you actually need that week that you can collect in the mornings that week. Is this something that's known outside Ellen's head?"}, {"startTime": "1186.76", "endTime": "1188.15", "role": "B", "text": "It's on the w booking system."}, {"startTime": "1193.5", "endTime": "1194.4", "role": "B", "text": "Oh well. That's something."}, {"startTime": "1197.78", "endTime": "1222.64", "role": "B", "text": "Uh-huh. Well , most the time to to p yeah. So it sounds like you've got a lot of possible ways of getting what time you need. Of course try to be kind to other people. But you would anyway. So So those are the only things that are worrying you , Camtasia and lab access. And otherwise no sweat , you're happy."}, {"startTime": "1199.41", "endTime": "1199.61", "role": "A", "text": "Yeah."}, {"startTime": "1208.9", "endTime": "1209.19", "role": "C", "text": "Yep."}, {"startTime": "1223.75", "endTime": "1238.42", "role": "C", "text": "Should should be. I've also got to get Camtasia we well , yes the m the model builder. I've got to get Camtasia working um as a sort of little multi-media thing to generate a video of how to mi sort of a an instructional video."}, {"startTime": "1226.18", "endTime": "1227.58", "role": "B", "text": "Oh and the model builders , yeah."}, {"startTime": "1238.39", "endTime": "1239.6", "role": "B", "text": "Oh yeah. H uh-huh."}, {"startTime": "1241.21", "endTime": "1241.48", "role": "A", "text": "Yeah."}, {"startTime": "1241.28", "endTime": "1242.92", "role": "B", "text": "These this is gonna take a little while."}, {"startTime": "1244.33", "endTime": "1247.04", "role": "C", "text": "It's what I'll have to do this week."}, {"startTime": "1246.23", "endTime": "1246.51", "role": "B", "text": "Mm-hmm."}, {"startTime": "1246.34", "endTime": "1290.65", "role": "A", "text": "Yeah. Well when the whole thing was if it was gonna run a trial that'll give you some some screen shots to work with. And then it'll just be a matter of adding new video f mouse movements or whatever. So Uh have a look. If you th anything prob any problems with it um think there's a Wiki page up for that f for that piece of uh for yeah , for that thing. So if if you just put just put whatever recommendations , bugs on that page and I'll work through them read 'em as and when I can."}, {"startTime": "1251.03", "endTime": "1251.43", "role": "C", "text": "Hmm."}, {"startTime": "1255.84", "endTime": "1266.1", "role": "B", "text": "Yeah , but you were gonna try and figure out how to overlay something on top of the video that or no , you were just g really gonna run a video of the sep of the trial. Yeah , okay. That's that's much easier."}, {"startTime": "1261.1", "endTime": "1264.9", "role": "C", "text": "U Yep , yeah."}, {"startTime": "1268.88", "endTime": "1278.48", "role": "B", "text": "So um with the model-builder , what do you need to do with it? Th the um which one you is gonna look at what it does so far and you'll just t try out do that. Yeah."}, {"startTime": "1276.32", "endTime": "1280.59", "role": "C", "text": "Uh I'll I'll do that. Yeah , and just yeah. Mm-hmm."}, {"startTime": "1282.42", "endTime": "57.771", "role": "A", "text": ".."}, {"startTime": "1285.31", "endTime": "1286.28", "role": "C", "text": "Mm."}, {"startTime": "1289.19", "endTime": "1300.96", "role": "C", "text": "Have a look at uh um hopef hopefully there's not a p a problem. But uh they said Marloes was uh also meant to be checking it and doing things and quiet."}, {"startTime": "1291.29", "endTime": "1291.6", "role": "B", "text": "Yeah."}, {"startTime": "1293.87", "endTime": "1294.08", "role": "A", "text": "Yeah."}, {"startTime": "1300.2", "endTime": "1314.91", "role": "B", "text": "Uh-huh. Um how many models were you relying on her for? So are you suddenly gonna be Well , what I'm trying to get at is is your start time gonna be delayed 'cause you don't have the models ready if she doesn't come through?"}, {"startTime": "1300.53", "endTime": "1327.2", "role": "A", "text": "Yeah , yeah. Um Yeah."}, {"startTime": "1305.76", "endTime": "1323.97", "role": "C", "text": "Um I've I uh it hasn't been divided up in that sort of way. But Um depends how quickly I manage to get a grip of it , how long it takes me to generate them or how I get on with the Camtasia."}, {"startTime": "1324.88", "endTime": "1332.96", "role": "B", "text": "Uh-huh. Yeah. Well Um can you draft Craig in to build some if necessary?"}, {"startTime": "1326.82", "endTime": "1329.07", "role": "C", "text": "Mm-hmm. Un unsure of yet."}, {"startTime": "1333.83", "endTime": "1347.72", "role": "A", "text": "And like these yeah , I mean I've used the software and there's not that hard I mean. Uh Yeah."}, {"startTime": "1338.28", "endTime": "1355.53", "role": "C", "text": "It it shouldn't the there shouldn't be any great uh problems. Just checking that the they're of a suitable level of complexity or or of whatever. Yeah. Yeah. No quite quite right. Yeah. So yeah."}, {"startTime": "1346.7", "endTime": "1354.73", "role": "B", "text": "Yeah. Well you know me contingency planning and all this. I always worry about the worst."}, {"startTime": "1353.05", "endTime": "1382.81", "role": "A", "text": "If Yeah. So well I can't imagine the building the building the mold is gonna be that hard. I mean I can easily just well however many thousands are on that uh Dutch web site you found. Just , you know , pick pick some of them , redo them in in the Ja in the J_C_D_ format. That's yeah. It's pretty mechanical. I can easily d easily do that. So but it's a matter of choosing which ones you need to do. Which I guess you have to do. Well yeah. Yeah well you need to you you and Marloes need to sort out , yeah."}, {"startTime": "1376.56", "endTime": "1383.69", "role": "C", "text": "Um yeah. well I was hoping for some feedback from yeah. Yeah , exactly."}, {"startTime": "1384.13", "endTime": "1413.85", "role": "B", "text": "You can um call a JAST telcon between you and Marloes. You know , i if it's not that see , you know , with the cold calling you can usually at least find out whether they're alive and get an an offer to to get something. But , you know , the next the next escalation is saying no we really need to talk about this. We're gonna talk about it , you know , Tuesday , at such such a time unless you um But presumably whatever it is they've been going through is now over."}, {"startTime": "1390.371", "endTime": "1397.5", "role": "C", "text": ". Yes."}, {"startTime": "1405.91", "endTime": "1424.59", "role": "C", "text": "Yep , mm book a time and I think so. Right. Well , I'll try and get ahold of her again today and see what I think it it was up till the end of October. So presumably today they're now free again. Or taking a week off to recover. Yes."}, {"startTime": "1417.86", "endTime": "1427.94", "role": "B", "text": "Mm-hmm. Yeah. I d I'd just hate for that to c um to slow you up in collecting stuff , that's all."}, {"startTime": "1428.17", "endTime": "1443.14", "role": "C", "text": "Um well hopefully it it won't anyway. It's just if I then do it I hopefully will get the right models. That's that's the pro so uh uh it will be generated. It's whether the models are optimal or not that I think that's right."}, {"startTime": "1435.14", "endTime": "1454.32", "role": "B", "text": "Obvious yeah , uh okay , that's true. Well that sounds That's quite a small thing she can do for you , I guess. You know. It's not like , you know , w sitting there brain deadly constructing , you know , some models that she needs to do. It's just to provide advice about this , which must take take less time."}, {"startTime": "1447.55", "endTime": "1448.08", "role": "C", "text": "Mm-hmm."}, {"startTime": "1452.12", "endTime": "1452.42", "role": "C", "text": "Yep."}, {"startTime": "1457.17", "endTime": "1463.15", "role": "B", "text": "Well , that all sounds fine. You guys worried about it? You worried about anything? We've mostly been talking about the experiment schedule. So."}, {"startTime": "1463.11", "endTime": "1535.44", "role": "A", "text": "Um I don't think don't think so. I mean uh so the the major thing I've gotta d got to do is get this Camtasia sorted out. So just waiting for the batteries for that. Um if Robin's not worried I'm not worried. Um Um p Yeah , yeah , 'cause I'll go gotta finalise that format and then once that's done , I've gotta start looking at the analysis side of it. And that's Yeah. Um Yeah , yeah. I think yeah. No , the the analysis I think the analysis will take a little while. I don't think it's gonna take that long to get its stuff sorted out. It's gonna be how to display it and all that sort of stuff. Uh whatever makes it easiest for you to do. Um but once w Hmm."}, {"startTime": "1470.57", "endTime": "1470.87", "role": "B", "text": "Mm."}, {"startTime": "1475.36", "endTime": "1475.71", "role": "C", "text": "Mm-hmm."}, {"startTime": "1475.73", "endTime": "1482.17", "role": "B", "text": "You're gonna run out of things to um f do that we haven't set you up for any time soon. The G_D_F_ sounds like it might take a wee while."}, {"startTime": "1486.46", "endTime": "1505.51", "role": "C", "text": "Mm-hmm. Well so it was the whole all the dynamic region part of it that's uh Mm-hmm."}, {"startTime": "1491.82", "endTime": "1496.12", "role": "B", "text": "Yeah , but you don't need anything from me for that , 'cause that's already sorta speced. I mean again that's the pair of you."}, {"startTime": "1506.29", "endTime": "1520.49", "role": "B", "text": "Yeah. It's just what I'm worrying it w worried about is him being in the lab all day long and you not being sure like what to do for the analysis on or something. 'Cause you're gonna be completely unavailable when you're recording? Or will there be times when you don't record all day."}, {"startTime": "1519.45", "endTime": "1561.4", "role": "C", "text": "Uh n um no. Uh well it depends how how many I can book in and get get running. Yeah. And before my brain melts it But w when when the experiment's running , yeah , it's I'll be in the lab. Uh I can't just go in , let them get start and then come back. It's uh so some people can , but Uh th they'll certainly be time because I'm right next to the lab anyway , I'll come back just to check my email and things anyway , so uh yeah."}, {"startTime": "1525.28", "endTime": "1525.52", "role": "B", "text": "Uh-huh."}, {"startTime": "1533.24", "endTime": "1553.48", "role": "B", "text": "Yeah. 'Cause he might oh yeah , no no no , I understand that. It was it was more like oh , it was more like , you know , you so this week he's got , you know , the G_D_F_ stuff to do. Then next week you're planning on recording. And what happens if suddenly you're unavailable all of next week just when he runs out of work?"}, {"startTime": "1558.39", "endTime": "1561.38", "role": "B", "text": "Yeah. So so we'll worry about it then."}, {"startTime": "1560.03", "endTime": "1589.13", "role": "A", "text": "Yeah , yeah. Um yeah , so I still gotta work on the gest analyzer and turn that into the t into a G_D_F_ outputter. Um and uh oh yeah , and I'll I can have a look at the model builder as well. Um 'cause one thing I'm thinking about is w we're looking at the the part building pa type stuff. Uh and it might worth seeing if we can add a little part builder thing into the um model builder. Um just just the ju I just gotta tidy tidy up some the code for generating the parts anyway , the J_C_T_ um parts from from S_V_G_s. Yeah."}, {"startTime": "1566.91", "endTime": "1567.67", "role": "B", "text": "Mm-hmm , yeah."}, {"startTime": "1570.63", "endTime": "1570.99", "role": "B", "text": "Yeah."}, {"startTime": "1586.33", "endTime": "1591.51", "role": "B", "text": "What I do don't know is we wanna bother with a part builder. I mean the idea was it wasn't worth the investment , right?"}, {"startTime": "1591.25", "endTime": "1647.78", "role": "A", "text": "Yeah , yeah. But I'll wanna have a qui have a quick look and see see how easy it is to add this things to it. 'Cause um if if I can use it to generate um um the rotsym angle for example and the rotation symmetry stuff for it , which is what was causing the bugs uh before. Um so if I if I can use the model builder to automatically do that then that would sa that would save quite a bit of work and it'll d save a few bugs. So No. It's uh it's just something you gotta remember once the part's been built. So um Yeah , yeah. Well I'm not not not pl not planning do much on that. It's just Yeah. I mean I've I've already I've already got this yeah."}, {"startTime": "1591.8", "endTime": "1592.19", "role": "C", "text": "Mm-hmm."}, {"startTime": "1602.08", "endTime": "1654.97", "role": "B", "text": "Yeah yeah yeah. Or Do y M yeah , but now now that the guy building these models know that they need to do the rotsym some stuff , do they have do you have trouble doing it? No , so Yeah. Well g I mean um we might want to um severely cash limit the investment that you put into making a part builder , right? So how how many person days would it be worth , like if Craig discovered it could be done in X_ days Right , so there's your limit. Don't spend more than a day or two on it. Yeah uh 'cause it really isn't worth it. You you have to understand there's things about this project we've hidden from you so far that you'll have to learn about. So it's it's not like you're out of work."}, {"startTime": "1604.49", "endTime": "1604.84", "role": "C", "text": "Mm-hmm."}, {"startTime": "1616.25", "endTime": "1616.53", "role": "C", "text": "No."}, {"startTime": "1619.25", "endTime": "1619.68", "role": "C", "text": "Mm-hmm."}, {"startTime": "1631.3", "endTime": "1631.59", "role": "C", "text": "Mm-hmm."}, {"startTime": "1639.72", "endTime": "1642.45", "role": "C", "text": "Uh I wouldn't bother more than one or two certainly."}, {"startTime": "1653.45", "endTime": "1658.13", "role": "A", "text": "Yeah , other I saw saw saw saw something about map task like little further down my task list."}, {"startTime": "1658.69", "endTime": "1707.26", "role": "B", "text": "Oh really? Oh , that one'll just be a little add-on. That'll whatever it is , it'll be the same skills as you've learned for something else. Um and it'll just be I'm not even sure that's you 'cause I think somebody else is doing that actually. But um I'm thinking more of the fact that um at some point we should probably tell you about this N_X_T_ stuff. So Oh , yeah yeah yeah. But you know , there's X_M_L_ and X_M_L_ and , you know. It takes stand-off links and stuff and it's um some some people if they're not used to linguistic annotation c um uh it c take a little time to get their head around the way the do data data model works. And um , you know , there's stuff to learn there. So Yeah , yeah. Yep."}, {"startTime": "1664.19", "endTime": "1664.51", "role": "A", "text": "Right."}, {"startTime": "1674.14", "endTime": "1721.16", "role": "C", "text": "Mm-hmm. W Mm-hmm."}, {"startTime": "1674.17", "endTime": "1680.98", "role": "A", "text": "Right. Yeah , well that that's that's just X_M_L_ to X_M_L_ to X_M_L_ , isn't it. Turning G_D_F_ and what other bits into N_X_T_."}, {"startTime": "1683.16", "endTime": "1684.0", "role": "A", "text": "Yeah , yeah."}, {"startTime": "1694.95", "endTime": "1714.14", "role": "A", "text": "Right , right. Um yeah 'cause that's the yeah , o other than you have from what I've heard about it is both X_M_L_. So the the programming side of it doesn't sound too hard. It's gonna be making sure that it fits what you expect out of the format. So um but no that's that's fine , I'll d I'll have try to find I'll I'll have plen plenty of uh plenty of questions for you once I once I get to the last stage , I'm sure."}, {"startTime": "1708.73", "endTime": "1746.71", "role": "B", "text": "So Yeah. So just don't witter away , you know , weeks on fripperies when we've got the real me meat of this yet to come. We'll find we'll find plenty of really really crucial s things for you to do. So Okay. So uh I'll uh remind myself to look at what's next before the next time we get together."}, {"startTime": "1721.89", "endTime": "1722.47", "role": "A", "text": "Yeah. Yeah."}, {"startTime": "1725.29", "endTime": "1742.38", "role": "A", "text": "Yeah , we'll Yeah. Well the we're gonna get Camtasia sorted out this week and then it's concentrate on the on the gest analyzer , the G_D_F_ stuff. Um and then yeah , once once we've done that it's whatever whatever you whate whatever you whatever you want me do once I done the once I've done the G_D_F_ , I guess."}, {"startTime": "1726.44", "endTime": "1729.19", "role": "C", "text": "I don't think you'll be twiddling your thumbs , no."}, {"startTime": "1747.22", "endTime": "1760.33", "role": "A", "text": "Yep. Yeah , so I think the G_D_F_ will keep me busy for a little while yet. So um yeah , well that's yeah , certainly keep me busy until this time next week when we can start suggesting things that might might need to look at for the next stage , I guess."}, {"startTime": "1759.92", "endTime": "1764.28", "role": "B", "text": "Yeah. So you collect on Monday? That means you don't wanna meet , right?"}, {"startTime": "1766.82", "endTime": "1776.61", "role": "C", "text": "Um well at twelve o'clock next Monday the lab is technically booked by Jules."}, {"startTime": "1777.27", "endTime": "1781.53", "role": "B", "text": "Oh , r right , it's actually next week. It's actually the week that you were planning on."}, {"startTime": "1779.89", "endTime": "1787.38", "role": "C", "text": "It Uh it starts the uh on we this Wednesday and goes through to next Wednesday."}, {"startTime": "1787.67", "endTime": "1788.24", "role": "B", "text": "Oh okay."}, {"startTime": "1791.79", "endTime": "1800.83", "role": "B", "text": "Well , I don't know. Anyway um you'll tell me whether it we cancel this. Or whether I just talk to Craig. In which case we won't be up here 'cause we don't record twos."}, {"startTime": "1793.12", "endTime": "1793.66", "role": "C", "text": "Mm-hmm."}, {"startTime": "1801.43", "endTime": "1802.39", "role": "A", "text": "Yep. Okay."}, {"startTime": "1803.76", "endTime": "1817.33", "role": "C", "text": "Um what else? Uh Yeah. My then other complication is two weeks tomorrow I start my teaching Mm-hmm. For I've got two weeks of that , fo four lectures and four labs."}, {"startTime": "1811.25", "endTime": "1812.62", "role": "B", "text": "Oh yeah. That should be fun."}, {"startTime": "1814.08", "endTime": "1820.23", "role": "B", "text": "Let's see , that's like the That comes at an ideal time for you then."}, {"startTime": "1818.27", "endTime": "1818.43", "role": "A", "text": "Yeah."}, {"startTime": "1821.3", "endTime": "1823.35", "role": "C", "text": "Yes."}, {"startTime": "1822.89", "endTime": "1824.19", "role": "B", "text": "That's like the twentieth or something."}, {"startTime": "1825.9", "endTime": "1835.08", "role": "B", "text": "Uh I can't add. Monday is the Yeah."}, {"startTime": "1828.11", "endTime": "1835.69", "role": "C", "text": "Uh what's tomorrow , is the f tomorrow the f first? So it will be the fifteenth for two weeks."}, {"startTime": "1832.19", "endTime": "1833.31", "role": "A", "text": "For the first , yeah. Yeah."}, {"startTime": "1835.97", "endTime": "1874.86", "role": "A", "text": "Hmm. Actually yeah , that reminds me , I wo wo I wo I won't be uh on Thursday I'm gonna be over in my induction day. So so Fair enough , fair enough. I mean uh I don't it's meant to be that in depth. It's Yes , yes. I mean I d I don't expect to be that in depth. I mean it's fifteen minutes on a variety of different topics. So it's just it's uh it is. Uh yes it is. I'm sure most of it I already know. It's like fire safety. Yeah. Health , safety , data protection. Usual sort of stuff you get everywhere. So Yeah. Yeah."}, {"startTime": "1841.38", "endTime": "1843.56", "role": "C", "text": "Oh you've got your uh induction , that's right."}, {"startTime": "1844.47", "endTime": "1847.63", "role": "B", "text": "Oh yeah , you have to promise to tell us how that is. 'Cause people do ask me."}, {"startTime": "1849.81", "endTime": "1854.94", "role": "C", "text": "Uh yes. From a total waste of time to , you know."}, {"startTime": "1852.85", "endTime": "1855.61", "role": "B", "text": "Yeah , on a scale of one to seven."}, {"startTime": "1861.06", "endTime": "1861.47", "role": "B", "text": "Yeah."}, {"startTime": "1868.37", "endTime": "1873.89", "role": "C", "text": "Mm-hmm. It's probably the university'll cover itself legally , I think , by doing this. Uh mm-hmm."}, {"startTime": "1869.78", "endTime": "1893.07", "role": "B", "text": "Yeah , you'd be surpri these things do Well , if they were gonna do that then they'd force you to go to it. I would and I would know somebody who'd gone to know. You know. I'm pretty sure they didn't have induction in my day. So Really? But you only started here They were supposed to , I'm sure."}, {"startTime": "1877.44", "endTime": "1889.82", "role": "C", "text": "Uh no I suppose rather than being Nobody's bothered so far , is it. Uh well I don't remember being asked for an induction. So In April."}, {"startTime": "1882.03", "endTime": "1882.36", "role": "A", "text": "Yeah."}, {"startTime": "1890.52", "endTime": "1890.75", "role": "A", "text": "Mm."}, {"startTime": "1893.95", "endTime": "1933.37", "role": "A", "text": "Yeah , I mean I can remo Yeah , I can remember when I start being a st when I was sta starting being a student. I mean ha we had the inductions were compulsory because um a lot of students were doing te were doing teaching. And you couldn't do the teaching unless you done the induction because you had to know about health and safety and fire safety before you could take a charge of yeah. 'Cause you were the responsible person in the in the class room. So So But uh yeah , I'm not sure I'm not sure why the why why I'm doing it now. But okay. . so see how it go. I'll I'll uh give you my report on Friday or something."}, {"startTime": "1894.45", "endTime": "1903.15", "role": "C", "text": "I got invited to a um a a a summer garden party for new staff members. But that was but that's all."}, {"startTime": "1903.69", "endTime": "1904.03", "role": "B", "text": "Oh well."}, {"startTime": "1917.1", "endTime": "1917.37", "role": "C", "text": "Hmm."}, {"startTime": "1919.07", "endTime": "1926.23", "role": "B", "text": "Oh yeah. Uh Yep."}, {"startTime": "1930.16", "endTime": "1930.46", "role": "C", "text": "Uh-uh."}, {"startTime": "1933.55", "endTime": "1933.84", "role": "B", "text": "Mm-hmm."}, {"startTime": "1935.84", "endTime": "1961.49", "role": "C", "text": "I have one N_X_T_ question which hopefully won't be well , it's not one. Just hopefully as part of the output it will be something like that. Is that correct? So you've got the gaze position of the first person , gaze position of the second , mouse position of the first , mouse position of the second and , I don't know , a common mouse action there or something. Does that t just in in sort of layers like that."}, {"startTime": "1938.03", "endTime": "1938.39", "role": "B", "text": "Okay."}, {"startTime": "1957.35", "endTime": "1957.68", "role": "B", "text": "Yeah."}, {"startTime": "1960.5", "endTime": "1961.21", "role": "B", "text": "Seems reasonable."}, {"startTime": "1962.94", "endTime": "1973.49", "role": "B", "text": "So um it'll be like in uh monitor. But yeah , they'll all be different tiers like that. And then there's the language stuff as well presumably."}, {"startTime": "1968.56", "endTime": "1968.72", "role": "C", "text": "Yeah."}, {"startTime": "1970.19", "endTime": "1970.34", "role": "C", "text": "Yep."}, {"startTime": "1972.72", "endTime": "1976.42", "role": "C", "text": "Yes , uh-huh. M that's that's just the the eye movement uh other sort of stuff , yeah."}, {"startTime": "1975.04", "endTime": "1979.96", "role": "B", "text": "Yeah , this is the easy stuff. Yeah. Well , eyes and mouse. Eyes and mice."}, {"startTime": "1981.7", "endTime": "1981.99", "role": "B", "text": "Uh-huh."}, {"startTime": "1983.96", "endTime": "1993.07", "role": "B", "text": "And that's enough for you , right? I mean that's just the way you want it. Course there are lot lots of things that can do that. But it's the language part that's the hard part. Yeah."}, {"startTime": "1985.61", "endTime": "2000.59", "role": "C", "text": "It ho hopefu uh hopefully that's yeah , I guess it's that's why I dre As well. Yeah , mm-hmm. Yeah. So I was just yeah , I was just checking that uh I know the language part because they say L_P_ here but uh this would be the the the new part. New stuff."}, {"startTime": "1998.1", "endTime": "2016.8", "role": "B", "text": "Yeah , that's That seems fine , yeah. Do you know what the um the sets of codes are? Well the whatev whatever whatever you're getting out of the JAST analyser. So I mean blinks as well , right?"}, {"startTime": "2001.65", "endTime": "2001.78", "role": "A", "text": "Yeah."}, {"startTime": "2011.8", "endTime": "2013.14", "role": "C", "text": "Uh yeah , whatever that is."}, {"startTime": "2017.31", "endTime": "2031.75", "role": "C", "text": "Um yes , I'm not sure whether we need to know exactly where they are , just how many there are in each tra um uh p I don't know. I suppose it could go in. Uh I mean I suppose it we're as well to have it if we can."}, {"startTime": "2022.25", "endTime": "2024.18", "role": "B", "text": "Oh so you don't want a pa uh part of this data?"}, {"startTime": "2027.0", "endTime": "2062.0", "role": "B", "text": "Aye. But I think you I think you should well , there's two views on this. Um if you do then the people formulating research questions will ask about them. But if you don't they'll probably ask about them anyway and then you'll have to add 'em after the fact. Uh so it's probably easier just to s shove 'em in. You can stick 'em in a different um track and uh and then load 'em or not load 'em as you please. 'Cause it's not well , I don't know. With is it is it part of so th these are mutually exclusive and exhaustive sets of codes against time , right? Isn't blink a part of this?"}, {"startTime": "2038.28", "endTime": "2039.06", "role": "C", "text": "Right."}, {"startTime": "2042.67", "endTime": "2047.6", "role": "C", "text": "Well uh just say stick 'em in anyway. Yeah. Mm-hmm."}, {"startTime": "2060.15", "endTime": "2069.62", "role": "C", "text": "Mm-hmm. Um blink would uh uh at the moment just get lumped in with the sort of previous gaze."}, {"startTime": "2070.96", "endTime": "2092.64", "role": "B", "text": "Yeah. But but isn't that important? Because when they're blinking , basically it's like an a nil code. You c can't find out what they're doing otherwise. So it may actually be important to have the blinks registered in there because you may discover you need to take them into account to smooth some kind of analysis that you're doing. So it could be that if they only they hadn't had a blink just then , they would've been I don't know what."}, {"startTime": "2071.58", "endTime": "2071.99", "role": "C", "text": "Mm-hmm."}, {"startTime": "2077.97", "endTime": "2079.24", "role": "C", "text": "The way they're looking , mm-hmm."}, {"startTime": "2084.73", "endTime": "2085.48", "role": "C", "text": "Mm-hmm."}, {"startTime": "2094.53", "endTime": "2109.91", "role": "C", "text": "M uh yes , mm-hmm. Moving somewhere else , or is more likely to be uh blinking at the same time as the other person was doing something , I think to mm-hmm. Yeah."}, {"startTime": "2102.68", "endTime": "2128.25", "role": "B", "text": "I'm thinking more That you wanna know about. Oh , I hope n not to much relies on missing stuff 'cause people blink. I was thinking more like um , you know , the person looks a p a part and they've got a uh fixation before and after and there's blink in the middle. And , you know , there may be times when you wanna treat that as one thing , right."}, {"startTime": "2126.86", "endTime": "2135.93", "role": "C", "text": "Yes. Norman normally uh would be just , as I say , like add the blink time and duration to the previous fixation."}, {"startTime": "2136.93", "endTime": "2158.52", "role": "B", "text": "Oh right. Okay. So but in that case Right , uh-huh. In that case then um these tiers are already like blink corrected. And then you wouldn't have blinks as part of this. You'd want blinks as a separate tier if you're gonna have it in."}, {"startTime": "2140.16", "endTime": "2146.35", "role": "C", "text": "'Cause you're not absorbing any new information and that's what the critical sort of deciding factor is."}, {"startTime": "2153.97", "endTime": "2165.33", "role": "C", "text": "Yes , so that they'll include the So i i yeah , would ha it would be as a separate tier where just to mark the actual position."}, {"startTime": "2163.62", "endTime": "2207.24", "role": "B", "text": "Yeah. Yeah , so the key thing is he here is mutually exclusive and exhaustive. And um the second key thing is um it better be really clear to the people who are dealing with these codes um uh w yeah , whether any monkey business has been done around the blinks to correct for that. Um 'cause , you know , it wouldn't necessarily be obvious looking at that set of codes that Uh yeah , I suppose if you know about eye trackers then you'll just know. But It I think you're just saying it comes out of the eye tracker already , right? They're already blink-corrected."}, {"startTime": "2168.72", "endTime": "2169.05", "role": "C", "text": "Mm-hmm."}, {"startTime": "2176.92", "endTime": "2179.45", "role": "C", "text": "What's included and what's n yeah. Mm-hmm."}, {"startTime": "2188.92", "endTime": "2191.8", "role": "C", "text": "Hmm. No , not certainly l not looking at codes , no."}, {"startTime": "2195.62", "endTime": "2195.69", "role": "A", "text": "Huh."}, {"startTime": "2195.86", "endTime": "2199.09", "role": "C", "text": "Mm-hmm. Know what to look for and what not to , yeah."}, {"startTime": "2197.05", "endTime": "2197.35", "role": "A", "text": "Okay."}, {"startTime": "2199.56", "endTime": "2229.03", "role": "A", "text": "So so that mean you need the blink corrections part of the analysis then. Um Right. So tha tha that's uh that's for the rest of the stuff that comes the eye tracker , isn't the analyzer software that comes the eye tracker."}, {"startTime": "2206.08", "endTime": "2248.43", "role": "C", "text": "Uh i there are well they're already identified as blinks. Then it's uh i it is at th hmm at what stage. The software that I've used uh p pools uh the blinks , so will add it on. I'm not sure what the default Yes. Yeah , so I'm not su i certainly it's listed as a separate event in the stream. Blinks are a tag uh from the E_D_F_ and and that sort of thing. It's registered as a a detection. But Mm. Mm-hmm."}, {"startTime": "2233.49", "endTime": "2233.83", "role": "A", "text": "Right."}, {"startTime": "2240.4", "endTime": "2255.3", "role": "A", "text": "Right , okay. Well i i if if you want if you want the blinks mer merged into a fixation , it might worth making making a cr part of the requirement for the G_D_F_ stuff. So to remind me so to to just add that analysis to , yeah , to to it. So it's I mean it's easy enough to do , just che just checking the times th times of the events."}, {"startTime": "2252.07", "endTime": "2252.48", "role": "B", "text": "Yeah."}, {"startTime": "2252.69", "endTime": "2272.43", "role": "C", "text": "Uh i y yeah. Uh I mean it it it won't because of the fixation it will be down to what we define as uh a gaze. So basically the time from when somebody starts looking at an object until they leave it. And so if they blinked a lot within that they're still looking at that object. So it's just the time in to the time out."}, {"startTime": "2272.89", "endTime": "2273.89", "role": "A", "text": "Right. Okay , okay."}, {"startTime": "2273.05", "endTime": "2295.24", "role": "B", "text": "Yeah. But what we need to know is like at what stage in the eye tracking stuff where it does that and whether that gets through so that um Craig gets it automatically in what he's translating or to G_D_F_. Whether he needs to redo the same analysis because something about the data path cuts off that analysis for the eye tracker. Or whether we even like it , right , and wanna do it some different way."}, {"startTime": "2278.19", "endTime": "2278.56", "role": "C", "text": "Mm-hmm."}, {"startTime": "2282.24", "endTime": "2282.46", "role": "C", "text": "Yep."}, {"startTime": "2290.07", "endTime": "2290.54", "role": "C", "text": "Mm-hmm."}, {"startTime": "2293.79", "endTime": "2295.42", "role": "C", "text": "Hmm. Some other way."}, {"startTime": "2295.79", "endTime": "2304.2", "role": "A", "text": "Yeah. Yeah 'cause I think the ASCII format as it stands does contain blink information um 'cause uh d d I'm sure I'm sure that's appeared in the in the documentation I've read through."}, {"startTime": "2300.17", "endTime": "2300.67", "role": "C", "text": "Yes."}, {"startTime": "2302.73", "endTime": "2306.28", "role": "C", "text": "Mm-hmm. Yep , there's a blink sort of event."}, {"startTime": "2304.89", "endTime": "2361.47", "role": "B", "text": "Yeah. But it could be these things are corrected for blinks in this way plus there's blink information. So , you know , it it treats it as a fixation around blinks and it also just happens to tell you where the blinks are. 'Cause as they were saying , they like to use blink rate as measures of cognitive difficulty or something. So If they're not still fixating on it when they come back out of the blink , then why is that is that the right thing to do analytically?"}, {"startTime": "2312.58", "endTime": "2313.69", "role": "A", "text": "Possibly. Possibly , yeah."}, {"startTime": "2321.79", "endTime": "2322.27", "role": "C", "text": "Mm-hmm."}, {"startTime": "2323.07", "endTime": "2343.68", "role": "A", "text": "Right. Okay , okay. Um yeah , so might might worth us us having a look at that and just just seeing what dat is what data is already in the ASCII format and whether you want me to do any correction as part of the analysis. Um 'cause I've gotta do the analysis for the fixations on parts and things anyway. So yeah , I d I I I didn't think check for blinks during that. Isn't gonna be a shouldn't be a big problem."}, {"startTime": "2331.21", "endTime": "2331.42", "role": "C", "text": "Yep."}, {"startTime": "2343.74", "endTime": "2349.05", "role": "C", "text": "It should just be a matter of treating a b adding on the blink to the last fixation or something anyway."}, {"startTime": "2348.83", "endTime": "2422.96", "role": "A", "text": "Yeah. Yep. Um so we'll be Right , mm-hmm."}, {"startTime": "2362.09", "endTime": "2372.09", "role": "C", "text": "Uh well uh the the real reason is um as long as they've been blinking , even if they then open their eyes somewhere else , that's when they start absorbing the new information."}, {"startTime": "2371.46", "endTime": "2372.64", "role": "B", "text": "Oh right. Yeah , you said that."}, {"startTime": "2375.38", "endTime": "2421.49", "role": "C", "text": "It's basically like a just a long saccade. Mm it you kind of have visual suppression when you move and it's the same when you're blinking. You're not taking anything in. So Uh it it's yeah , that yes , um that's for the sort of gaze time measure. Uh it's not actually the fixations are still um independent. So the they w fixation duration isn't doesn't include the blink in the ASCII a output. It's only when we start looking at sort of the total gaze that um the total amount of time spent looking at one particular object , which includes all these sort of multiple fixations and any blinks and that sort of thing. Is it it's a a sort of composite uh viewing time."}, {"startTime": "2384.15", "endTime": "2390.69", "role": "B", "text": "Well , but does um the duration of fixations count for anything? 'Cause it if you're just adding the length of the blink to the fixation , you're not treating it as a saccade."}, {"startTime": "2401.53", "endTime": "2402.0", "role": "B", "text": "Okay."}, {"startTime": "2406.21", "endTime": "2406.52", "role": "B", "text": "Wait."}, {"startTime": "2417.07", "endTime": "2420.77", "role": "B", "text": "Okay. I kinda get this. Yeah , yeah. Mm-hmm."}, {"startTime": "2424.9", "endTime": "2431.43", "role": "B", "text": "So more complicated than I thought. I'd forgotten about the multiple fixations on an object. Yeah. Okay."}, {"startTime": "2426.75", "endTime": "2429.8", "role": "C", "text": "Uh yeah , I'm afraid uh mm-hmm."}, {"startTime": "2431.84", "endTime": "2529.43", "role": "A", "text": "And so are you looking for a final thing that just sort says between this time and this time you're looking at this object. Between this time this time you're not looking anything. And Yeah , yeah. 'Cause I think I think at the moment the G_D_F_ format has fixations in it. Um so so I gue I guess that'd be part of the G_D_F_ to transformation would be turning fixations into gazes and whatever else. Okay , okay. Well tha tha don't don't uh worry about that just the moment. But Right."}, {"startTime": "2437.23", "endTime": "2438.17", "role": "C", "text": "Yep , yep."}, {"startTime": "2438.4", "endTime": "2456.83", "role": "C", "text": "Although we'll also still need a count of the fixations just so we can have you you've got measure fixation duration again just to s see if those they spend longer just f amount of more stable move uh eye fixation or not. Uh Mm-hmm."}, {"startTime": "2460.1", "endTime": "2466.23", "role": "C", "text": "Yep. To ye yeah , mm-hmm. Viewing times."}, {"startTime": "2466.26", "endTime": "2518.99", "role": "B", "text": "Well , it's not okay , I mean this is kinda what we were talking about before , this confusion about what's in the G_D_F_. I mean you might see it as the initial G_D_F_ is just whatever straight-forwardly translates without , you know , without transforms , with just the data format changing from the ASCII. And then there's a bunch of other things that get added that you might still want to be in um augmented G_D_F_ format , you know , like this blink and the gaze and whatever else. And then you translate to N_X_T_. So you might still wanna have everything in this one G_D_F_ file format that represents everything. And then the N_X_T_ thing is just a splitter. It's not doing any fancy analysis. So I see this as , you know , a bunch of little routines that take the the G_D_F_ without this information in it and add new information into th sub-script versions of the G_D_F_ file that contains these post-process analyses."}, {"startTime": "2490.11", "endTime": "2490.73", "role": "C", "text": "Mm-hmm."}, {"startTime": "2505.5", "endTime": "2506.1", "role": "C", "text": "Right , yeah."}, {"startTime": "2518.66", "endTime": "2530.7", "role": "C", "text": "Mm-hmm. Well that's partly why I brought this up now is it I'm not sure what point down the data path things sort of happen. But that's what I want out in the end."}, {"startTime": "2529.61", "endTime": "2530.3", "role": "B", "text": "Yeah."}, {"startTime": "2531.34", "endTime": "2540.57", "role": "A", "text": "Right. So so so w will you actually be doing much of the G_D_F_? Or is are you expecting do most the analysis on out of the N_X_T_ stuff then? So whe when you uh when you actually generate your results. Mm-hmm."}, {"startTime": "2541.31", "endTime": "2569.23", "role": "C", "text": "Um well the N_X_T_ stuff will have the more complete picture 'cause it will include combine all the linguistic stuff with all the movements and the actions. Um but there'll be I suppose just some purely eye movement stuff we could do. I s presumably with G_D_F_. Uh Mm-hmm."}, {"startTime": "2550.39", "endTime": "2550.87", "role": "B", "text": "Yeah."}, {"startTime": "2553.59", "endTime": "2553.91", "role": "A", "text": "Right."}, {"startTime": "2563.47", "endTime": "2575.45", "role": "A", "text": "Yeah. Uh yeah. C well yeah , you told that earlier 'cause you could do a quick ana you could do a quick analysis on the G_D_F_ stuff without having to before you hit before you do the dialogue analysis type stuff. So you can get some some results anyway , can't you. Okay. Yeah."}, {"startTime": "2573.22", "endTime": "2573.61", "role": "C", "text": "Mm-hmm."}, {"startTime": "2573.59", "endTime": "2614.87", "role": "B", "text": "Yeah. I mean it to some extent it doesn't matter which data format it's in , N_X_T_ or G_D_F_. But it makes more sense for the converter between G_D_F_ and N_X_T_ not to add any data. All it does is do this this stupid data format conversion. And it it's just , you know , separating it out in the little steps. So , you know , there have to be these other scripts that add any um data transforms um not data format transform forms , but data transforms. Like this idea of um of putting together gazes from fixations. So y you know , i if we keep it simpler like that so that it's in little pieces , then it'll be just easier to understand w what the wh the whole thing does."}, {"startTime": "2584.1", "endTime": "2584.99", "role": "C", "text": "Mm-hmm."}, {"startTime": "2612.12", "endTime": "2612.47", "role": "C", "text": "Hmm."}, {"startTime": "2615.41", "endTime": "2616.4", "role": "A", "text": "Right. Okay , okay."}, {"startTime": "2616.05", "endTime": "2678.85", "role": "C", "text": "Hmm. C An And uh yeah , that's also why I sent you the mm Saarbruecken software f that uh the stuff that takes the ASCII sort of format originally and then just uh sort of compresses it and things. Yeah , the German stuff. Uh because that little utility um does things like t well but you can tell it to what to do with blinks , whether just to lump them in or or not. Uh what the minimum fixation duration for a stable fixation would be , sort of you have if it picks up t fixations less than say fifty milliseconds , you can tell it just to again lump them all together , that's not a sort of reliable enough fixation. Uh you can put in these sort of of things. So that's uh that's a bit of software that's sent and that includes the source code and things as well."}, {"startTime": "2616.19", "endTime": "2654.68", "role": "B", "text": "'Cause you you c you know , i if suddenly you discover there's a problem with the G_D_F_ to N_X_T_ transform , you wanna know whether it's one of these little post-processes going wrong or whether it's just the thing that dumps it into the multiple files for the and G_D_F_ to N_X_T_ transform is c is pretty simple. So um , you know Oh yeah."}, {"startTime": "2631.09", "endTime": "2631.37", "role": "A", "text": "Right."}, {"startTime": "2642.7", "endTime": "2644.67", "role": "A", "text": "Oh yeah yeah. The Germans don't yeah , yeah , yeah."}, {"startTime": "2671.32", "endTime": "2684.0", "role": "A", "text": "Fair enough , fair en Yeah , so so they they we're allowed to do whatever without without source code. There's no c sort of restrictions on that. Fair enough , fair enough."}, {"startTime": "2683.13", "endTime": "2683.93", "role": "C", "text": "Mm-hmm."}, {"startTime": "2683.72", "endTime": "2705.59", "role": "B", "text": "So that's like all the analysis that you need to do to things. Are you just gonna copy what they do? Or Is it documented like why they did it they way they did it? Or is it just Well it's good starting point , right. So it'd be interesting to see if you agree with the decisions that they made about how to do things."}, {"startTime": "2694.06", "endTime": "2705.18", "role": "C", "text": "Uh no , there's very little documentation as you might imagine for these sort of things. Yeah , so I g I uh yeah. That's that's why. So Mm-hmm."}, {"startTime": "2708.32", "endTime": "2709.53", "role": "C", "text": "Mm-hmm. Hmm."}, {"startTime": "2708.33", "endTime": "2747.09", "role": "A", "text": "Yeah , I suppose I can easy look through and start writing up some documentation on it. That'll gi that'll give us a starting point for us to sort to talk about it to look for what analysis we n actually need to do on it and things. Um yeah , easy. C yeah , create all the uh switches and whatever else you need to do. So um Okay. Okay. Yeah. So we'll on once yeah. Well once I've had once I've had a bit of bit more look at this G_D_F_ stuff , then start looking through that. Start looking through that and make sure that works. 'Cause Yeah."}, {"startTime": "2712.66", "endTime": "2713.2", "role": "C", "text": "Mm-hmm."}, {"startTime": "2722.45", "endTime": "2722.71", "role": "B", "text": "Mm."}, {"startTime": "2723.59", "endTime": "2724.4", "role": "C", "text": "Fine. Good."}, {"startTime": "2732.83", "endTime": "2754.15", "role": "C", "text": "Mm-hmm. 'Cause uh al also just filters it. There are a lot of um strange event tags that the eye link produces that are fairly meaningless , I think. And it can stri it strips out a lot of the junk uh as well. So it cleans it up. Mm-hmm. Uh-huh."}, {"startTime": "2749.48", "endTime": "2817.92", "role": "A", "text": "Yeah , yeah. I've l yeah I've no no noticed that the the the gest analyser knows quite a few things as well. So um but as Yeah. Well uh I use it that useful for generating this G_D_F_ stuff , I can easily incorporate whatever functions it takes from into gest analyser when I'm do doing the G_D_F_ stuff. So Yeah , yeah. I mean but what , yeah , say what what I'll what I'll plan to do with it then is take the is take to the software , find out what functions are useful for us in that , and then use those functions to generate the stuff that goes into the X_M_L_ file , the the G_F_ format."}, {"startTime": "2749.52", "endTime": "2749.87", "role": "B", "text": "Ah."}, {"startTime": "2754.67", "endTime": "2761.09", "role": "B", "text": "Well b but we don't wanna build it into our data path. We just wanna learn from it , I think , right? Correct? Or no?"}, {"startTime": "2758.79", "endTime": "2758.97", "role": "C", "text": "Right."}, {"startTime": "2760.57", "endTime": "2764.0", "role": "C", "text": "Uh b fine. Well um possibly."}, {"startTime": "2771.46", "endTime": "2804.07", "role": "B", "text": "Yeah. I'm just thinking , you know , like i so this takes the ASCII to to a d simplified ASCII. And simplified in with transforms in it ASCII and it's just it seems to be harder to maintain something that's got that in it if it'd be better to break things up into like steps. That you know , as part of the the and als Well why do I think this? I don't know , because it's somebody else's programme and then they're gonna give us the next version and that's gonna break our entire pipeline. You know. That's the main reason."}, {"startTime": "2777.27", "endTime": "2778.22", "role": "C", "text": "Yep. Mm-hmm."}, {"startTime": "2781.53", "endTime": "2781.74", "role": "C", "text": "Yeah."}, {"startTime": "2793.4", "endTime": "2803.25", "role": "C", "text": "The pr Uh yeah. Uh-huh. Yeah , I see what you mean , uh-huh."}, {"startTime": "2815.93", "endTime": "2829.47", "role": "B", "text": "Yeah. Uh yeah , I can imagine I can imagine that also requiring some discussion about whether what they do is what we actually wanna do. That should be interesting. Uh Uh-huh."}, {"startTime": "2816.51", "endTime": "2817.11", "role": "C", "text": "Mm-hmm."}, {"startTime": "2822.23", "endTime": "2835.82", "role": "C", "text": "Six or Mm-hmm. It's it's not quite s it so it's not gonna be quite grabbable 'cause it is it's written in Java."}, {"startTime": "2824.1", "endTime": "2855.69", "role": "A", "text": "Yeah , yeah. So so the fir fir first part that'll be documenting what they've got and then discussing it with Robin. So uh yeah. So so I suppose pose that that way the Right. But yeah , well I tr mo mostly , yeah. I'm sure I sure most the logic's gonna be gonna be the same. So um Right. Yeah , fair enough."}, {"startTime": "2831.09", "endTime": "2831.79", "role": "B", "text": "Well , sounds good."}, {"startTime": "2841.94", "endTime": "2853.59", "role": "C", "text": "Yeah , well yes , uh-huh , the actual uh Mm-hmm."}, {"startTime": "2842.78", "endTime": "2843.18", "role": "B", "text": "Yeah."}, {"startTime": "2845.22", "endTime": "2865.99", "role": "B", "text": "And if in doubt um don't filter stuff out , keep it in , right. 'Cause we always dump it to this other N_X_T_ track that we don't need to load necessarily. So um the idea is you just keep stuff unless Mm-hmm."}, {"startTime": "2858.36", "endTime": "2868.33", "role": "C", "text": "Yeah. It's always better than making too much compression to start with and then being out of unable to go back or yeah. Lossiness."}, {"startTime": "2865.32", "endTime": "2873.59", "role": "A", "text": "Yeah , fair enough. Well so so it's so long as it's X_M_L_ , N_X_T_ will handle it , won't it. 'Cause Yep."}, {"startTime": "2869.96", "endTime": "2893.84", "role": "B", "text": "Oh yeah , and it's easy enough to dump stuff into an into separate track. W we gotta teach you about this at some point though. So um but still not quite sure when. It sounds like maybe in another week. So Jonathan made me promise not to um tell you about it when you first arrived 'cause you were gonna get overload about learning eye trackers and No. It's just too many things at once and it wasn't important that it be then."}, {"startTime": "2876.91", "endTime": "2877.23", "role": "A", "text": "Fair enough."}, {"startTime": "2880.9", "endTime": "2881.71", "role": "A", "text": "Okay , okay."}, {"startTime": "2887.4", "endTime": "2891.92", "role": "C", "text": "Or or you leave very quickly. Uh-huh."}, {"startTime": "2894.2", "endTime": "2911.48", "role": "A", "text": "Yeah. Well I'm well I'm well g I've got the hang of all the stuff I've been going through. And it looks like l looks like I'm coming to end of the stuff the stuff list there already. So I'm gonna have start looking at that as the next stage. So Yep."}, {"startTime": "2898.04", "endTime": "2910.23", "role": "B", "text": "Yeah. So Yeah. He's a cool customer. He's ready for it. Okay. I think we're done , right."}, {"startTime": "2910.7", "endTime": "2913.49", "role": "C", "text": "Yep. Well I'm I am."}, {"startTime": "2918.0", "endTime": "2924.99", "role": "C", "text": "Oh dear. Uh my page is blank still."}, {"startTime": "2923.36", "endTime": "2940.54", "role": "B", "text": "Sorry? Oh yeah , I don't know. I do not really need to this just says look at the Wiki. Find out what's next. You could give give Craig more work to do. This one's mine. It Oh yeah , well that'll take forever."}, {"startTime": "2926.723", "endTime": "2945.87", "role": "A", "text": ". Well , I ma I ma I may be maybe I want to check out these batteries and things , won't I? So tomorrow. Well , that'll be something to do. well well will the will the will will do if the trains are tha as bad as today."}, {"startTime": "2942.35", "endTime": "2943.96", "role": "B", "text": "That's that's really fun. Check your batteries."}]