[{"startTime": "16.41", "endTime": "16.82", "role": "A", "text": "Oh."}, {"startTime": "25.54", "endTime": "70.43", "role": "C", "text": "Du Uh we yes s I've lo I've done the role that I was asked to do anyway. I think."}, {"startTime": "46.21", "endTime": "47.68", "role": "A", "text": "Okay."}, {"startTime": "50.47", "endTime": "62.56", "role": "A", "text": "Thanks for coming to this meeting. S how we doing on our remote? We have some we have some ideas and some uh ideas for what people want."}, {"startTime": "50.65", "endTime": "51.02", "role": "D", "text": "Hm."}, {"startTime": "68.61", "endTime": "83.39", "role": "A", "text": "Yeah. Alright let's just go over the agenda real quick for this meeting. See if I can't get things uh moving along here a little bit better. Um I'll go over what we went over last time , which shouldn't take long."}, {"startTime": "83.77", "endTime": "104.48", "role": "A", "text": "Then I believe each of you have a presentation. Um I've was sent a a couple more requirements for our remote , what they want. Um then we can come to a conclusion on uh what we want the remote to do , um and how it's going to do it hopefully."}, {"startTime": "105.19", "endTime": "143.37", "role": "A", "text": "And uh then we'll have the closing. Um which we'll have forty minutes for. Uh let's see , the last meeting we went over um who was responsible for what. I'm responsible for leading the meetings , keeping the notes , uh and coming up with the final presentation. Um Corinne is our Marketing Expert. She's gonna figure out what what um the consumer wants. Um Ryan is our User Interface Designer."}, {"startTime": "144.65", "endTime": "164.13", "role": "A", "text": "And Manuel is the Industrial Designer. So you're gonna come up with the ideas Ryan , and you're gonna pick 'em apart. Um we decided our remote , uh we want it to be a universal remote uh that everyone would want."}, {"startTime": "165.07", "endTime": "183.84", "role": "A", "text": "Um we want to be modern , um fun , different. Uh it needs to be sturdy , um easy to find , so we gonna have that locator function. Um and we want to be different."}, {"startTime": "185.87", "endTime": "201.14", "role": "A", "text": "Um and then we went over a couple of different ideas. Ball-shaped phone. The keyboard shape. Um we decided that it should probably be one-handed. Something we could use with one hand. Um and that was our last meeting."}, {"startTime": "202.52", "endTime": "209.66", "role": "A", "text": "So um why don't um Do each of you have a presentation?"}, {"startTime": "209.7", "endTime": "210.24", "role": "D", "text": "Yep."}, {"startTime": "211.18", "endTime": "223.12", "role": "A", "text": "Okay. I'll hand it off to you and um Does anyone do you wanna go first? So we can maybe see what uh what the people want."}, {"startTime": "218.64", "endTime": "219.06", "role": "D", "text": "Sure."}, {"startTime": "229.35", "endTime": "230.5", "role": "D", "text": "What was it? Function?"}, {"startTime": "231.26", "endTime": "232.32", "role": "B", "text": "Eight. F_ eight."}, {"startTime": "231.83", "endTime": "232.5", "role": "D", "text": "F_ eight?"}, {"startTime": "254.67", "endTime": "254.94", "role": "D", "text": "Well."}, {"startTime": "261.21", "endTime": "266.24", "role": "D", "text": "How do I get it Oh right right right."}, {"startTime": "263.93", "endTime": "264.65", "role": "C", "text": "Slide show."}, {"startTime": "264.6", "endTime": "268.37", "role": "A", "text": "To go to the next one? Yeah you click on that guy. Yeah."}, {"startTime": "267.45", "endTime": "268.96", "role": "D", "text": "That one? Okay."}, {"startTime": "270.7", "endTime": "294.86", "role": "D", "text": "Alright. Well , this is my report , which is going to be based pretty much on a survey that I was sent. Oh gosh , I've no idea. G Okay. Sorry I actually need to see something else on my screen."}, {"startTime": "287.73", "endTime": "289.81", "role": "C", "text": "Just press the arrow keys I think. Usually goes to it."}, {"startTime": "299.34", "endTime": "300.14", "role": "A", "text": "Hit F_ eight again."}, {"startTime": "300.55", "endTime": "300.88", "role": "D", "text": "Yeah."}, {"startTime": "301.33", "endTime": "301.81", "role": "A", "text": "I think."}, {"startTime": "302.12", "endTime": "303.85", "role": "D", "text": "And then? Again?"}, {"startTime": "304.82", "endTime": "305.11", "role": "A", "text": "Yeah."}, {"startTime": "307.74", "endTime": "310.5", "role": "A", "text": "You want it to be on both screens , or just just yours?"}, {"startTime": "309.04", "endTime": "310.86", "role": "D", "text": "No I want something else on mine."}, {"startTime": "312.77", "endTime": "313.49", "role": "D", "text": "Is that possible?"}, {"startTime": "313.95", "endTime": "317.02", "role": "A", "text": "Yeah but I think you have to hit escape."}, {"startTime": "319.14", "endTime": "322.77", "role": "A", "text": "And then you can Yeah."}, {"startTime": "322.66", "endTime": "324.15", "role": "D", "text": "Okay but now you don't have that."}, {"startTime": "324.01", "endTime": "324.91", "role": "A", "text": "Oh hit F_ eight again."}, {"startTime": "325.9", "endTime": "326.59", "role": "D", "text": "Sorry guys."}, {"startTime": "326.55", "endTime": "327.91", "role": "A", "text": "I know. I did the same thing."}, {"startTime": "329.51", "endTime": "332.88", "role": "A", "text": "And then it should come up here shortly."}, {"startTime": "334.57", "endTime": "334.9", "role": "A", "text": "'Kay."}, {"startTime": "344.77", "endTime": "351.96", "role": "D", "text": "So is there no way I can give you the slideshow and have something yeah. Yeah. Oh well."}, {"startTime": "346.65", "endTime": "358.72", "role": "A", "text": "I think oh give us the slideshow and something on your screen? Mm. I'm not sure. You could maybe minimise that screen and then have them both up at the same time I think."}, {"startTime": "356.42", "endTime": "356.71", "role": "D", "text": "Yeah."}, {"startTime": "357.94", "endTime": "373.3", "role": "D", "text": "It's okay. Okay. Um so first of all , the method that I used was by doing some marketing research , by um doing research on some interviews that were conducted. And then some internet research."}, {"startTime": "373.68", "endTime": "402.79", "role": "D", "text": "And I was sent a report that was I think there were a hundred remote users that they interviewed. And so I will show you some of the results from that , which I think will be helpful. Um okay here are some of the findings. They said that the users dislike the look and feel of their current remote controls. And seventy five percent of the users find their remote controls to be ugly. Which is a fairly significant number I would say."}, {"startTime": "403.04", "endTime": "417.48", "role": "D", "text": "And eighty percent of the users would be willing to spend more money if they could get a remote that would look fancy. So I think that earlier we were onto something when we were talking about having it be a modern cool look , I think that's definitely important."}, {"startTime": "418.03", "endTime": "436.59", "role": "D", "text": "Um they say that current remote controls do not match well the operating behaviour of the user. Seventy five percent of users said they zap a lot. And if anyone could clarify what that means? Zap , does that just mean like changing the channel? Okay."}, {"startTime": "432.68", "endTime": "435.61", "role": "C", "text": "Is is it j just just just using it yeah."}, {"startTime": "433.59", "endTime": "436.09", "role": "B", "text": "Just jus yeah."}, {"startTime": "436.98", "endTime": "461.55", "role": "D", "text": "Um and fifty percent of the users say that they're only using ten percent of the buttons on their remote control. And there was something else , they kept track of the frequency per hour in using certain buttons. And some of them it looks like barely need to be included at all. Of course channel selection is used the most frequently."}, {"startTime": "462.12", "endTime": "480.62", "role": "D", "text": "And then teletext was the next. Volume and then power. And then audio settings and screen settings and channel settings were practically never used. So I think we could definitely eliminate or somehow combine a lot of the functions into one button."}, {"startTime": "483.38", "endTime": "501.9", "role": "D", "text": "Um the biggest user frustrations , as we said fifty percent of people find that their remotes are lost somewhere , and so I think a tracking device of some sort would be a good idea. They said it take thirty four percent said it takes too much time to learn how to use a new remote."}, {"startTime": "502.95", "endTime": "507.61", "role": "D", "text": "And twenty six percent said that the controls are bad for R_S_I_."}, {"startTime": "509.94", "endTime": "511.31", "role": "C", "text": "A repetitive strain injury."}, {"startTime": "511.77", "endTime": "512.51", "role": "D", "text": "What is it?"}, {"startTime": "512.46", "endTime": "515.21", "role": "C", "text": "Just repetitive strain injury. I think. That's what I guess."}, {"startTime": "514.1", "endTime": "552.48", "role": "D", "text": "Okay. Okay. And so bas okay. Um as far as speech recognition goes , um the younger group looks like they're all for it. From the fifteen to twenty five age group over ninety percent said they would pay more. And it kind of just went down incrementally. The groups at the older they get it looks like the less willing they are to pay , so maybe we could discuss this and think and decide if we think it's worth investing in this. At least if we're targeting the younger groups."}, {"startTime": "554.23", "endTime": "576.68", "role": "D", "text": "And so in conclusion. Some things that I drew from this are that I think we were correct. We definitely need to focus on a new modern appearance , since so many people seem to be concerned about the ugliness of their remote control. Um a multifunctional remote could be a good thing to explore. So you only have one rather than five different remotes sitting all over your room."}, {"startTime": "577.28", "endTime": "589.57", "role": "D", "text": "Uh we need to simplify the remote and reduce the number of buttons , get rid of the ones that don't seem to be serving much purpose. And then lastly I thought that maybe we could discuss the idea of speech recognition."}, {"startTime": "591.15", "endTime": "591.89", "role": "D", "text": "And that's it."}, {"startTime": "601.23", "endTime": "853.95", "role": "A", "text": "'Kay. Very nice. Now we actually have some ideas of what what people want , what we should focus on. Uh Wait can I look at that real quick? . What was your last conclusion on that one? Focus on uh the i the image of it."}, {"startTime": "624.36", "endTime": "624.69", "role": "D", "text": "Oh yeah."}, {"startTime": "625.98", "endTime": "630.52", "role": "D", "text": "Sorry did you guys get time to write everything that you needed? 'Kay."}, {"startTime": "628.85", "endTime": "629.26", "role": "C", "text": "Yeah."}, {"startTime": "633.32", "endTime": "640.97", "role": "C", "text": "Having just listened to what Corinne just said , I'll draw on some of the things as well. Some things that sort of relevant to what I wanna say."}, {"startTime": "642.24", "endTime": "645.61", "role": "C", "text": "'Kay so I'm just gonna yeah approach the technical functions design."}, {"startTime": "648.79", "endTime": "668.29", "role": "C", "text": "Um the method I used was to explore the uh technical functions of a remote control. And t s simplest approach that I came to is is to change , programme and operate an electronic device remotely. I mean that's an obvious thing to say , but it's not attached to the device that you want to control."}, {"startTime": "668.81", "endTime": "772.33", "role": "C", "text": "Um I had some things sent to me. Not very much. To look at similar devices. Um defined in some them. And then the personal preferences that I will suggest. Um we discussed a universal one. Um like it's just been brought up again then. But I think a universal remote control is actually quite a difficult object to design , and po possibly within maybe the budget that we do it , um because you'd need to know all the spef specifications of a all the like electronic companies. I'm not sure have you ever come across a universal remote control yourself , but you have to i they're a nightmare to use. You have to set them , reset them to everything. Um and that would only add buttons. Whereas I think the aim is to take away buttons. So I think it'd be better maybe to concentrate on maybe just a universal one for T_V_s. Um or maybe just one that you could we could design and then different people , manufacturers could use it to set to their specifications , if if the aim is to get something that's unique in design. Um Okay here here's just two pictures of remote controls. They're just simple T_V_ remote controls. But one is uh user-centred. That is the one on the left. And you can straight away see there's less buttons. And the other one is engineer-centred where that's more uh specified for the sort of the elaborate piece of equipment it's trying to control um which appeals more to the product that we want , and on what the have said and the market research and stuff probably looking at something that should be user-centred."}, {"startTime": "772.77", "endTime": "793.14", "role": "C", "text": "Fewer buttons , simpler to use , and if ten percent um is hidden away if ten percent is what's used , maybe the other fifty percent , the buttons that are used very rarely like programming , they could be hidden maybe under some remote controls you might have come across have maybe a little flip thi thing where they're hidden away. And the main buttons are the ones you or the ones you come across."}, {"startTime": "794.44", "endTime": "824.71", "role": "C", "text": "Um and finally , um uh sort I've sort of covered that , our product I think should be user interface orientated. Um Like I said to concentrate on T_V_ remote control , a universal remote might be too complex. Um and as what it , the major findings market researchers have said , it's the image and the appearance that people di dislike. So that we should concentrate on something that would set a trend. And then and change the fashion of remote controls."}, {"startTime": "826.45", "endTime": "827.16", "role": "C", "text": "And that's it."}, {"startTime": "840.6", "endTime": "842.02", "role": "B", "text": "cable there. Thank you."}, {"startTime": "852.0", "endTime": "855.26", "role": "C", "text": "On something on the image of it. Uh the f the actual design."}, {"startTime": "855.36", "endTime": "857.2", "role": "A", "text": "'Kay. Good. Good."}, {"startTime": "907.09", "endTime": "983.64", "role": "B", "text": "Okay. Gonna talk to you about the working design of the interiors basically which is what dictates the design the both the interface basically and the outer appearance because this is all the stuff that needs to go in there. Right. So unfortunately the people who were supposed to do this little presentation for me obviously were too drunk to actually accomplish it , so um I'm going to do a lot of the stuff on the board. Um just This is the basic basic premise of a remote control. Um the basic function is to send messages to another system. Okay so much is clear. An energy source feeds an integrated circuit , like a chip , that can compose messages. Often in the form of infrared bits. This is the most mostly used. Um there's uh also some sound systems but infrared is the better or the more more used system. Um parts are cheaper as well. A user interface controls the chip and accordingly the messages."}, {"startTime": "984.99", "endTime": "1007.18", "role": "B", "text": "This is where my people screwed up basically. So I'm going to explain that on the board rather. Um what we have is different components that obviously need to go in there. We'll start with an energy source. Right. Um which is usually a battery right?"}, {"startTime": "1008.82", "endTime": "1048.87", "role": "B", "text": "Since it's not feasible to add a cable to that. This energy source of course is connected to the the user interface itself. Uh which can be buttons , whatever , which in fact controls a chip. Right? This is the user interface and there we have the chip. Um the way this goes normally is that this chip then controls an infrared lamp."}, {"startTime": "1050.67", "endTime": "1052.19", "role": "B", "text": "That sends out the signal."}, {"startTime": "1056.97", "endTime": "1083.91", "role": "B", "text": "Of course the signal differs accordingly. Um depending on what the chip tells the infrared lan lamp. And Of course that's controlled , the chip itself is controlled by the user interface. The way you normally normally do it is that you add a little device such as a lamp to the whole thing as well , so that you know that it's working basically. You press something , you get a response."}, {"startTime": "1085.14", "endTime": "1090.23", "role": "B", "text": "Which is also comparatively um important on one of those devices."}, {"startTime": "1091.94", "endTime": "1135.85", "role": "B", "text": "Now this , what we're talking about here , or what I think should be discussed are these two components mostly. The the uh energy source for one thing can be altered. What we probably cannot alter is of course the infrared , the sending device basically , the infrared lamp. We cannot change the chip which controls the infrared lamp. Right? These two are components that we have to use , and these are dictated by the whole function of the whole thing. Um the lamp can be put onto the desi the device. It c it doesn't have to be there. This can be discussed as well."}, {"startTime": "1140.44", "endTime": "1151.32", "role": "B", "text": "The user interface. That's something we can also discuss. Um as we've heard uh speech recognition is the hype obviously in the moment."}, {"startTime": "1152.58", "endTime": "1172.2", "role": "B", "text": "Speech recognition um interface , we don't know that. Or if we just do the usual button thing. Or we have a touch pad or something like that that's something we can discuss. And of course the energy source. Batteries. Solar cells. Who knows?"}, {"startTime": "1177.69", "endTime": "1196.04", "role": "B", "text": "Of course it's always a question whether these these components are in fact available cheap enough , developed enough. But that's like I s I suppose rather up to marketing , and not to to the industrial design department."}, {"startTime": "1193.51", "endTime": "1213.01", "role": "A", "text": "So we could the the the more complex we make it of course , the more expensive But people have said that they would well younger generations of people have said that they would pay more for a speech recognition remote. So possibly it might be worth the investment."}, {"startTime": "1197.73", "endTime": "1200.31", "role": "B", "text": "Expensive it's gonna be get uh. Yeah."}, {"startTime": "1207.37", "endTime": "1208.1", "role": "D", "text": "Mm-hmm."}, {"startTime": "1210.13", "endTime": "1210.45", "role": "B", "text": "Right."}, {"startTime": "1213.12", "endTime": "1224.27", "role": "C", "text": "I think speech recognition was uh one of those things where um they have to be really good for them to work. 'Cause sometimes you find yourself just saying things over and o if it's on your phone."}, {"startTime": "1223.03", "endTime": "1223.66", "role": "D", "text": "Yeah."}, {"startTime": "1224.36", "endTime": "1224.88", "role": "A", "text": "I agree."}, {"startTime": "1226.01", "endTime": "1232.25", "role": "C", "text": "And you need to sort of take into light languages and then different dialects I suppose as well."}, {"startTime": "1226.07", "endTime": "1252.47", "role": "A", "text": "Well I myself I find , when you , h when there's something like spee speech recognition. Like uh you call on the phone and you try to change your telephone or power or something. Sometimes they have a a speech recognition on the other end , and you say one for this , and you find yours , like you said , saying the same thing over and over and over."}, {"startTime": "1245.47", "endTime": "1245.71", "role": "C", "text": "Yeah."}, {"startTime": "1252.69", "endTime": "1275.98", "role": "A", "text": "I find myself , especially if I'm in a crowd of people , looking really silly. So maybe if you're sitting on your couch with a bunch of people then you know , you Volume up. Volume down. Change the channel , you know channel up , channel down? I I don't know."}, {"startTime": "1257.14", "endTime": "1257.44", "role": "C", "text": "Yeah."}, {"startTime": "1263.06", "endTime": "1271.32", "role": "C", "text": "And wou I don't know if would would you want to keep saying stuff if you were watching stuff. If you were watching something would you sort of be wanting Yeah."}, {"startTime": "1276.69", "endTime": "1290.48", "role": "D", "text": "Another thing about these figures is ninety one percent of the youngest age groups said they'd do it , but probably a lot of them that's actually their parents money. Like I don't know if they would actually go out and purchase this themselves , a fifteen year old you know."}, {"startTime": "1288.89", "endTime": "1300.25", "role": "C", "text": "I think As well it'd be j the gimmick factor for the younger people. But practically I don't think it's Yeah. It'll wear off."}, {"startTime": "1292.88", "endTime": "1293.5", "role": "A", "text": "Mm-hmm."}, {"startTime": "1293.42", "endTime": "1293.86", "role": "D", "text": "Yeah."}, {"startTime": "1295.8", "endTime": "1311.04", "role": "A", "text": "It's a , it's a gimmick factor that they like at first , and Okay. Um Let's see here."}, {"startTime": "1300.3", "endTime": "1301.41", "role": "D", "text": "Gets old yeah."}, {"startTime": "1310.6", "endTime": "1313.35", "role": "C", "text": "Do you wanna put your cord back in?"}, {"startTime": "1313.62", "endTime": "1314.44", "role": "A", "text": "Yeah I guess so."}, {"startTime": "1314.33", "endTime": "1315.39", "role": "B", "text": "Oh right."}, {"startTime": "1315.67", "endTime": "1316.34", "role": "A", "text": "Trade you."}, {"startTime": "1316.68", "endTime": "1318.82", "role": "B", "text": "go."}, {"startTime": "1318.8", "endTime": "1384.96", "role": "A", "text": "Now I was sent a couple of things to modify our uh new requirements. Um the remote's only gonna be for the television , which is good because we already decided y your your research showed that uh not only is a universal remote more complicated , it's more cost , more costly. And your re uh research showed that you know most of the people don't even use it. I think uh you said fifty percent of the people only use half the or ten percent of the buttons. So if we remove the universal remote then that solves that problem. Um no teletext. Um So we don't have to worry about that. Um but we do have to use the the company wants us to incorporate the corporate colour and our slogan , which is we put the fashion in electronics. And our corporate colours are grey and yellow."}, {"startTime": "1350.74", "endTime": "1351.3", "role": "D", "text": "Mm."}, {"startTime": "1388.71", "endTime": "1455.96", "role": "A", "text": "And we could probably get away with black too but So those are the three um the three new requirements that that I was told we need to use. Um from all all three of your uh presentations , I think that we were on the right track a lot in our last meeting. Um We want something that looks good. Um we want something that's simple. We want something that you can find easily. Um And the speech recognition I I guess is kind of uh give or take. It's gonna cost more. S the young the younger people say that they like it. But um it's probably , I would say , probably not worth the investment at this point in time. So maybe we should just do away with speech recognition. Um And that way we can focus on our form."}, {"startTime": "1434.35", "endTime": "1434.94", "role": "B", "text": "Mm-hmm."}, {"startTime": "1457.0", "endTime": "1480.81", "role": "C", "text": "I did have have a thought about the sort of the tracking thing. Is that if it came with maybe a holder or holster , whatever you wanna call it. Um that you you should put it back in. Your remote. But if you don't put it back in , you press something like a little button on that , and that just sort of sends out a beep to find where it is or something. Just by infrared. That shouldn't be too complex I would've thought."}, {"startTime": "1482.71", "endTime": "1486.12", "role": "A", "text": "That'd be , that'd be good if we were going with our our ball."}, {"startTime": "1486.33", "endTime": "1493.61", "role": "C", "text": "Yeah it would be quite good. The ball could sit on a Yeah."}, {"startTime": "1487.24", "endTime": "1508.23", "role": "A", "text": "Or or with you know I guess with any form that that would be good. You know that could be the charger. For you know we could use rechargeable batteries in the remote. And that would be or solar. Or you know However , however you wanted to go about it , the holder could also be the charging unit. Um With the locator button."}, {"startTime": "1488.55", "endTime": "1489.18", "role": "D", "text": "Mm."}, {"startTime": "1504.8", "endTime": "1505.03", "role": "C", "text": "Yeah."}, {"startTime": "1509.73", "endTime": "1513.79", "role": "A", "text": "Um and if it were the ball you'd no longer have to have a flat space on it."}, {"startTime": "1514.01", "endTime": "1514.41", "role": "C", "text": "Yeah."}, {"startTime": "1515.78", "endTime": "1524.9", "role": "A", "text": "Um like if we still have the how to hold on to it and It's gonna roll away."}, {"startTime": "1516.4", "endTime": "1527.14", "role": "B", "text": "Well you still do. You s you still W yeah. You put it on t on the couch table. While you're watching , it's gonna roll off. So that's not an issue really."}, {"startTime": "1523.65", "endTime": "1525.01", "role": "D", "text": "Rolls away yeah."}, {"startTime": "1547.45", "endTime": "1567.65", "role": "A", "text": "Um So I guess after the meeting we'll have some questionnaires. And uh and some summaries for for what's going on. Um then we'll take lunch. Then we can come back and uh work on our individual work."}, {"startTime": "1568.87", "endTime": "1572.81", "role": "A", "text": "Um I'll do the minutes."}, {"startTime": "1577.86", "endTime": "1579.39", "role": "A", "text": "Uh let's see."}, {"startTime": "1584.48", "endTime": "1601.06", "role": "A", "text": "It looks like you're already on your way for uh working with the components. Um chips , the what chips we need and what uh you know how to power it and whatnot."}, {"startTime": "1594.234", "endTime": "1633.41", "role": "B", "text": ". Right."}, {"startTime": "1605.44", "endTime": "1608.21", "role": "A", "text": "User interface concept , we want it to be something simple."}, {"startTime": "1608.8", "endTime": "1609.17", "role": "C", "text": "Yeah."}, {"startTime": "1609.59", "endTime": "1612.75", "role": "A", "text": "Um Minimal number of buttons."}, {"startTime": "1617.33", "endTime": "1629.3", "role": "A", "text": "I guess our , I guess our main um main thing that we should focus on until then is probably deciding on a certain look , you know."}, {"startTime": "1630.85", "endTime": "1631.23", "role": "C", "text": "Yeah."}, {"startTime": "1634.61", "endTime": "1754.11", "role": "B", "text": "That's Mm."}, {"startTime": "1636.92", "endTime": "1645.87", "role": "A", "text": "Did you have time earlier to to work on that. Did you guys feel you have enough time in between our meetings to get everything done that you need to get done?"}, {"startTime": "1643.89", "endTime": "1645.43", "role": "D", "text": "Not really."}, {"startTime": "1647.77", "endTime": "1652.74", "role": "C", "text": "I'll yeah I'll have a look , try look at the actual appearance in the next break."}, {"startTime": "1656.08", "endTime": "1656.32", "role": "A", "text": "'Kay."}, {"startTime": "1656.08", "endTime": "1667.19", "role": "C", "text": "I th I I do still think it needs to be something that is ultimately one-handed. The ball is probably not a good idea. And even something that's held like that might be difficult. So that I think it still has to be a variation."}, {"startTime": "1660.52", "endTime": "1660.76", "role": "D", "text": "Mm."}, {"startTime": "1664.44", "endTime": "1664.78", "role": "A", "text": "Mm-hmm."}, {"startTime": "1668.51", "endTime": "1676.19", "role": "C", "text": "On maybe a a rect on a rectangle but maybe not necessarily as boring , as plain as a rectangle."}, {"startTime": "1675.05", "endTime": "1675.42", "role": "D", "text": "Mm."}, {"startTime": "1678.57", "endTime": "1684.6", "role": "A", "text": "Um Shall we maybe shoot for a a specific uh target group?"}, {"startTime": "1686.08", "endTime": "1700.37", "role": "A", "text": "That way we could l I mean if it were , if we were shooting for young guys then it's um a certain look to the remote. Or girls or older people?"}, {"startTime": "1701.6", "endTime": "1707.8", "role": "A", "text": "Um Would that you think that would help us find um a specific form?"}, {"startTime": "1709.12", "endTime": "1710.69", "role": "A", "text": "That we would would wanna pick out?"}, {"startTime": "1713.34", "endTime": "1720.06", "role": "C", "text": "D I don't know if that might cope with like the trend-watching. I find anything more on that."}, {"startTime": "1718.48", "endTime": "1719.0", "role": "D", "text": "Mm."}, {"startTime": "1721.54", "endTime": "1726.05", "role": "D", "text": "Yeah not yet but maybe by the next meeting we'll have some info on that."}, {"startTime": "1731.54", "endTime": "1732.11", "role": "A", "text": "'Kay."}, {"startTime": "1741.57", "endTime": "1829.59", "role": "A", "text": "So um we know that the remote's gonna have to be we'll just say we've got a colour scheme for it. Um yellow and you know yellow it's nice and bright , with the buttons being grey or black. And our slogan pasted somewhere on it , on the the bottom or the you know. Um Maybe we could sketch a so basically all of our remotes all of our typical remotes now are just kind of a rectangular sort. You know. Um maybe we could flare it or something. You know. So it's more of course this will look like a bone then. go ahead and erase this. Um Hope everyone memorised that uh Yeah. Yeah."}, {"startTime": "1748.72", "endTime": "1749.02", "role": "C", "text": "Yeah."}, {"startTime": "1761.2", "endTime": "1762.32", "role": "C", "text": "Bottom perhaps yeah."}, {"startTime": "1820.79", "endTime": "1835.6", "role": "C", "text": "You I mean it might be to look at sort of the the shape and trend of like things like mobile phones , and the shapes that the they've been going. They've gone from big brick block things , which is a remote control is , to sort of slinky small things."}, {"startTime": "1828.81", "endTime": "1829.22", "role": "D", "text": "Mm."}, {"startTime": "1835.86", "endTime": "1906.41", "role": "A", "text": "Yeah everybody's got a mobile phone right? Except for me now. Uh But they are all , you know , mobile phones um they've kind of taken a turn to where they're really small. Um which may defeat our purpose for being able to locate our remote all the time. But then again you don't want you know like the first mobile phone that was this big and you had a handbag to carry it around in. Um So we've got basically what remotes look like now is kind of what we're what we're stuck with. Um Maybe we could go with a square or something. Um Um you know with minimal number of buttons."}, {"startTime": "1854.29", "endTime": "1854.72", "role": "C", "text": "Yeah."}, {"startTime": "1857.66", "endTime": "1857.86", "role": "D", "text": "Mm."}, {"startTime": "1859.55", "endTime": "1859.91", "role": "B", "text": "Right."}, {"startTime": "1900.62", "endTime": "1900.79", "role": "B", "text": "Hm."}, {"startTime": "1908.78", "endTime": "1910.98", "role": "A", "text": "I guess you've got you know one through nine."}, {"startTime": "1914.55", "endTime": "1924.46", "role": "A", "text": "For typing in your channels. Uh you've got volume , up and down. Channel up and down."}, {"startTime": "1926.45", "endTime": "1927.01", "role": "D", "text": "Power."}, {"startTime": "1927.41", "endTime": "1928.04", "role": "A", "text": "Power."}, {"startTime": "1929.68", "endTime": "1933.53", "role": "A", "text": "Usually at the top. Um a mute."}, {"startTime": "1939.41", "endTime": "1941.77", "role": "B", "text": "That's the classical design."}, {"startTime": "1941.02", "endTime": "1949.89", "role": "A", "text": "That's that's pretty much all you need I think. Um A menu button , maybe."}, {"startTime": "1951.37", "endTime": "1951.74", "role": "B", "text": "Right."}, {"startTime": "1952.1", "endTime": "1953.01", "role": "A", "text": "So you know."}, {"startTime": "1954.15", "endTime": "1972.89", "role": "A", "text": "If you , if we want the remote to do other things like um or I guess the T_V_ to be able to change the tint and the colour and you know all those kind of things that are built into T_V_s , we just have that under one standard menu button where you go in , press the menu button , scroll up and down to select it."}, {"startTime": "1972.97", "endTime": "1973.32", "role": "D", "text": "Yeah."}, {"startTime": "1974.91", "endTime": "1975.87", "role": "B", "text": "Yeah."}, {"startTime": "1975.46", "endTime": "1998.49", "role": "A", "text": "Um 'Kay so Um Mm-hmm."}, {"startTime": "1978.29", "endTime": "1981.85", "role": "B", "text": "Talking of which maybe a scrolling function is not not too bad."}, {"startTime": "1983.42", "endTime": "2000.46", "role": "B", "text": "It's Talk about maybe f look at that from the side , there maybe. Which is technically the easiest option. Would probably be like a scrolling , little scrolling wheel like this. Yeah. Yeah. Yeah. So."}, {"startTime": "1999.88", "endTime": "2001.25", "role": "A", "text": "Like a wheel on your mouse."}, {"startTime": "2001.47", "endTime": "2011.64", "role": "B", "text": "Yeah , sort of like that. You can even if we're coming from mice , we can even add a click function , where you , in order to verify the information you just press it down."}, {"startTime": "2002.38", "endTime": "2003.08", "role": "A", "text": "Sort of."}, {"startTime": "2012.88", "endTime": "2035.9", "role": "B", "text": "Right. Also when it comes to the ergonomics of the whole thing , if you wanna make it square for the looks of it , then maybe to make it more comfortable to hold the whole thing , you add a little bulge down here. Just which maybe from an engineering point this could be holding the the batteries and so on."}, {"startTime": "2013.79", "endTime": "2014.62", "role": "A", "text": "'S a good idea."}, {"startTime": "2036.0", "endTime": "2036.31", "role": "A", "text": "Mm-hmm."}, {"startTime": "2037.73", "endTime": "2057.77", "role": "B", "text": "I know. You know what I'm getting at here , fel look at it from the side. It's like that. Right. Uh Then you hold it in your hand like this. And maybe you bring the buttons nearer to the or the imp more important buttons nearer to the to the side. Right. Mm."}, {"startTime": "2039.14", "endTime": "2040.93", "role": "A", "text": "Look g yeah. Looks good."}, {"startTime": "2040.1", "endTime": "2040.38", "role": "D", "text": "Mm-hmm."}, {"startTime": "2049.81", "endTime": "2067.31", "role": "C", "text": "Yes s To the thumb yeah. Maybe the buttons could like uh decrease in s the bigger ones you know they could actually be bigger in size than the ones that are less important , the smaller here."}, {"startTime": "2055.34", "endTime": "2056.88", "role": "A", "text": "To the thumb. Yeah."}, {"startTime": "2068.18", "endTime": "2072.97", "role": "B", "text": "Right. You can also have it , maybe , talking about mobile phones again , sliding open."}, {"startTime": "2074.12", "endTime": "2074.69", "role": "C", "text": "Yeah."}, {"startTime": "2074.46", "endTime": "2081.16", "role": "B", "text": "With the lesser used functions on this part , and then it slides into that part. And out."}, {"startTime": "2076.59", "endTime": "2077.95", "role": "C", "text": "Behind. Definitely."}, {"startTime": "2080.76", "endTime": "2083.86", "role": "C", "text": "just like o on a sort of side view."}, {"startTime": "2085.19", "endTime": "2094.27", "role": "C", "text": "Something that you know it would sort of fit in the hand better. So you know you just sort of have your hand Yeah. Right on the and your thumb would be up here type thing."}, {"startTime": "2089.62", "endTime": "2099.76", "role": "B", "text": "Mm well I was just thinking , this this of course causes causes a problem um for left or right-handed people actually. So."}, {"startTime": "2098.66", "endTime": "2099.59", "role": "C", "text": "Yeah that's also true."}, {"startTime": "2102.74", "endTime": "2104.7", "role": "C", "text": "instantly sort of always going for the right-handed person."}, {"startTime": "2104.8", "endTime": "2105.13", "role": "B", "text": "Right."}, {"startTime": "2107.41", "endTime": "2115.63", "role": "C", "text": "But I mean the older so Right-handed , yeah."}, {"startTime": "2109.78", "endTime": "2122.05", "role": "A", "text": "Yeah is everyone who in here's right-handed , left-handed? You guys all right-handed? Yeah. So I'm left-handed but I , so I can say that most things are designed for right-handed people."}, {"startTime": "2113.86", "endTime": "2114.52", "role": "D", "text": "Right."}, {"startTime": "2114.36", "endTime": "2115.03", "role": "B", "text": "Right."}, {"startTime": "2117.84", "endTime": "2118.15", "role": "D", "text": "Uh-huh."}, {"startTime": "2123.03", "endTime": "2123.84", "role": "B", "text": "That's right."}, {"startTime": "2123.8", "endTime": "2127.37", "role": "A", "text": "Like the written language. Or English."}, {"startTime": "2127.39", "endTime": "2133.16", "role": "D", "text": "Maybe you could buy like a special left-handed version of the remote. Special order."}, {"startTime": "2131.6", "endTime": "2138.06", "role": "A", "text": "Maybe. Ow. I would say I mean it should be probably designed for a right-handed p person."}, {"startTime": "2138.13", "endTime": "2138.68", "role": "D", "text": "Yeah."}, {"startTime": "2139.51", "endTime": "2167.147", "role": "A", "text": "Um but that's that's good. That's w I think we've got a kind of a good plan there. Um At least for what buttons we're gonna use. Um So we've got uh I like the scroll , the scroll action and the."}, {"startTime": "2166.42", "endTime": "2195.93", "role": "C", "text": "I mean I'm just just thinking maybe if it was um circular um with the sort of that sort of the sort of early idea we had , with the way that was more like that , whereas this is just a one-handed thing that you sort of almost wrap round the thumb. So you'd have your , you'd put your hand into there with the thumb there."}, {"startTime": "2197.35", "endTime": "2206.74", "role": "C", "text": "And then your thumb would do you'd have all the buttons sort of round here. And that I think could work. On any hand. If you just had it like wrapped round there. Left or right."}, {"startTime": "2202.23", "endTime": "2249.26", "role": "A", "text": "Yeah. Kinda like holding a Yeah."}, {"startTime": "2207.29", "endTime": "2207.47", "role": "D", "text": "Mm."}, {"startTime": "2209.59", "endTime": "2210.06", "role": "B", "text": "Right."}, {"startTime": "2211.88", "endTime": "2214.32", "role": "B", "text": "That minimises it size-wise as well."}, {"startTime": "2213.37", "endTime": "2216.06", "role": "C", "text": "Minimise its size. It could be you know really quite small."}, {"startTime": "2215.4", "endTime": "2215.69", "role": "B", "text": "Mm."}, {"startTime": "2218.79", "endTime": "2247.1", "role": "B", "text": "Then there's maybe another point of making it a two-in-one kind of thing. If we have a smaller a smaller device that actually fits into the big one. You give it the full functions in here , and just a couple of functions in there. Like your zap zapping device is just u channels up-down , uh volume , and on-off. That's it."}, {"startTime": "2238.19", "endTime": "2238.6", "role": "C", "text": "Yeah."}, {"startTime": "2238.75", "endTime": "2239.06", "role": "D", "text": "Hmm."}, {"startTime": "2240.48", "endTime": "2241.47", "role": "C", "text": "Zapping functions."}, {"startTime": "2248.13", "endTime": "2248.72", "role": "D", "text": "Could be good."}, {"startTime": "2248.52", "endTime": "2251.74", "role": "B", "text": "Maybe."}, {"startTime": "2282.28", "endTime": "2283.9", "role": "A", "text": "So two remotes in one."}, {"startTime": "2287.24", "endTime": "2293.08", "role": "A", "text": "But then would be easier to lose one or the other."}, {"startTime": "2293.28", "endTime": "2294.07", "role": "B", "text": "That's right."}, {"startTime": "2295.16", "endTime": "2299.73", "role": "B", "text": "Means the big one has to be sufficiently big. And perhaps heavy , so you can't move it around."}, {"startTime": "2301.4", "endTime": "2306.97", "role": "B", "text": "Make it a piece of furniture. yes. Yes , there you go."}, {"startTime": "2303.05", "endTime": "2306.73", "role": "D", "text": "Yeah , yeah."}, {"startTime": "2303.75", "endTime": "2305.45", "role": "A", "text": "It actually is your coffee table."}, {"startTime": "2310.33", "endTime": "2312.7", "role": "B", "text": "Or a statue or something."}, {"startTime": "2314.84", "endTime": "2379.86", "role": "A", "text": "Okay. Well we need to finish up here. Um So for the next So for the next um before the next meeting w uh sh shall we work on you're watching trends to see what what kind of new information we've got going on. Um Manuel you're going to work on the components for for what we're gonna use. Let's go with our our uh rounded kind of fit in your hand let's explore uh the the uh possibility of having the two-piece. So one for the the quick zapping um and possibly one you know with just that rounded part that fits into your hand. Um And Ryan you work on um how how well they'll work with the us with the user. So both of those concepts."}, {"startTime": "2335.32", "endTime": "2335.57", "role": "C", "text": "Yep."}, {"startTime": "2344.23", "endTime": "2344.87", "role": "B", "text": "Right."}, {"startTime": "2359.41", "endTime": "2359.77", "role": "B", "text": "Alright."}, {"startTime": "2365.17", "endTime": "2365.39", "role": "C", "text": "Yeah."}, {"startTime": "2376.32", "endTime": "2377.41", "role": "C", "text": "How well it'll work yeah."}, {"startTime": "2382.17", "endTime": "2403.53", "role": "A", "text": "And uh okay I think we made some good progress here. see you in I dunno. I gu I guess we'll take lunch in about uh half an hour. Or I guess we'll be taking lunch shortly and then then in about half an hour after that we'll probably have another meeting."}, {"startTime": "2386.8", "endTime": "2387.4", "role": "B", "text": "Alright."}]