[{"startTime": "91.2", "endTime": "91.89", "role": "A", "text": "Okay."}, {"startTime": "112.68", "endTime": "113.14", "role": "A", "text": "Right."}, {"startTime": "118.01", "endTime": "220.38", "role": "A", "text": "Conceptual design meeting. Right. Okay , so Right well um from the last meeting I was trying to send you the minutes , but uh it didn't work out too well , so maybe in sort of um quick summary of the last uh meeting , I can quickly give you what we what we had. Uh right , so Wishing I hadn't closed the damn Right so we had the fact that we're gonna have the the logo uh the company logo in its uh colour scheme incorporated onto the the device the remote device. We had uh made our decisions about uh made our decisions about uh the device itself , that it was gonna be simple to make it uh enable us to complete the project in time. We're gonna have uh effectively two pages , a front page which had the uh features that the uh the customers most wanted , and then the uh the backup features on the second page so that it could uh meet the technical requirements. And the customers wouldn't have to look at them too often , only as and when required. So."}, {"startTime": "224.08", "endTime": "231.45", "role": "A", "text": "So basically what decisions uh have we uh made? Uh have there been any uh changes?"}, {"startTime": "232.04", "endTime": "235.799", "role": "B", "text": "I think we all have a presentation again , so if we go through those and then um."}, {"startTime": "233.87", "endTime": "234.23", "role": "A", "text": "Right."}, {"startTime": "234.29", "endTime": "234.48", "role": "D", "text": "Yeah."}, {"startTime": "235.56", "endTime": "240.37", "role": "A", "text": "Three presentation , yeah. So Yeah , fine."}, {"startTime": "236.24", "endTime": "240.07", "role": "B", "text": "Shall I go first again?"}, {"startTime": "239.78", "endTime": "240.01", "role": "D", "text": "Okay."}, {"startTime": "249.18", "endTime": "252.14", "role": "B", "text": "I see this a little more smoothly than the last one."}, {"startTime": "288.06", "endTime": "296.97", "role": "B", "text": "Okay right , let's get started. Um basically the uh for the Um I'll back actually."}, {"startTime": "298.56", "endTime": "352.65", "role": "B", "text": "For the components design , um next step is basically the the way the remote's gonna work is still the same idea as before. We still have the user interface which is all the buttons we're gonna incorporate. Then there is a chip and still the sender. So um yes including the power s supply as well. Um I'll go on to my findings in each of these areas. Uh first in the power supply , we have the option of just the standard battery , um. There's a dynamo. Any of you think of kind of like the the old torches which you wind up um. There's a kinetic option , which if any of you've seen those new watches which you kind of you power up by waving around , um it just requires a small amount of movement which would mean the batteries wouldn't have to be replaced."}, {"startTime": "353.49", "endTime": "455.9", "role": "B", "text": "Um that's one option , but I think that was gonna cost a little more. And then there's solar cells. Um as a final option. For the buttons , we have um an integrated push button , which is Oh just to say all all these are um supplied by Real Reaction. So I guess for the ease of for quickness and ease we should take them from at least like one of these options. Um so for the buttons there's an integrated push button , which I guess is just the same as the standard ones. This says it's uh similar to uh the button on the mouse for a normal for like uh like modern computer. Um there's a scroll wheel which is you know the new mouse has just got like the centre section which you can scroll up and down , which may be for the volume. You could do do that. Um one issue for the buttons is , depending on which material we use , if we use rubber buttons then it requires a rubber case , so we have to take that into consideration. Um moving on to the printed s Um that's on the next I th I think the there wasn't too much difference in the cost , that that related to the actual buttons , but it does affect the printed circuit board. Um which is the next section. Basically for the circuit board which is the middle , it's just see it down there the chips like the like the workings of the actual um of the remote. The firm supplies a simple , a regular and an advanced um circuit board. And there's different prices according to each. So if we've got the scroll wheel for one of the buttons , that would require a slightly more advanced circuit board than if we just had a standard um push button."}, {"startTime": "353.93", "endTime": "354.26", "role": "D", "text": "Mm-hmm."}, {"startTime": "377.07", "endTime": "377.66", "role": "A", "text": "Okay."}, {"startTime": "399.65", "endTime": "400.16", "role": "A", "text": "Mm-hmm."}, {"startTime": "400.32", "endTime": "400.56", "role": "D", "text": "Mm-hmm."}, {"startTime": "414.53", "endTime": "416.68", "role": "A", "text": "What would be the cost do do we know?"}, {"startTime": "434.33", "endTime": "434.81", "role": "A", "text": "Mm-hmm."}, {"startTime": "452.26", "endTime": "452.95", "role": "A", "text": "Mm-hmm."}, {"startTime": "457.03", "endTime": "505.97", "role": "B", "text": "Um one final thing we came up with was some information on the speech recognition. There's a small unit available through the company um which obviously would be an extra cost , but it wouldn't affect the size of the remote too much. Um and I guess that would require a more advanced circuit board , so there is an extra price in that sense. There is th sorry an extra cost in that sense. Um going to my personal preferences , um I thought possibly for power we could use kinetic um which is the idea of the watches um that you move you move the remote around to power it up. And this would avoid batteries running out , having to replace batteries and such like. Um for the buttons , I thought we'd probably get away with just having the standard um push buttons rather than the scroll wheel."}, {"startTime": "507.22", "endTime": "521.93", "role": "B", "text": "Um and for the circuit board , again depends on which features we want in the actual in the remote. So if we wanted the scroll wheel and wanted the voice recognition , um then we'd have to get a a more costly circuit board. And that's it."}, {"startTime": "527.33", "endTime": "527.57", "role": "D", "text": "'Kay."}, {"startTime": "531.11", "endTime": "532.68", "role": "C", "text": "Thanks."}, {"startTime": "531.36", "endTime": "543.25", "role": "A", "text": "with the printed circuit boards you were going for the Mm-hmm."}, {"startTime": "535.47", "endTime": "545.75", "role": "B", "text": "Um i it kind of depends um if we're gonna have the speech recognition , we'd have to probably get an advanced one. I'm guessing. Uh but I don't know , so that is something I'll have to look into."}, {"startTime": "544.97", "endTime": "546.67", "role": "A", "text": "But are we going f R right."}, {"startTime": "546.5", "endTime": "549.28", "role": "B", "text": "Um that's a that's a decision for all of us. Um."}, {"startTime": "550.66", "endTime": "572.62", "role": "A", "text": "So are we able to make that decision now in a sense that this is the point at which we're discussing that issue , so would it not be best to rather than I mean one way is to do each of the presentations and then make decisions going back to the various presentations as they were. The other way would be to do the presentation and then make the decision at that point in time."}, {"startTime": "552.06", "endTime": "552.99", "role": "B", "text": "Yeah yeah."}, {"startTime": "556.16", "endTime": "557.84", "role": "B", "text": "We decide. Yeah."}, {"startTime": "556.27", "endTime": "556.52", "role": "D", "text": "Mm-hmm."}, {"startTime": "569.77", "endTime": "570.18", "role": "D", "text": "Mm-hmm."}, {"startTime": "572.84", "endTime": "588.28", "role": "B", "text": "Um. Maybe w Um."}, {"startTime": "573.88", "endTime": "576.16", "role": "C", "text": "Yeah , that's probably a better one , to discuss it straight away."}, {"startTime": "576.79", "endTime": "595.29", "role": "A", "text": "'Cause at that point then you've got the details up there , so if we wanted to know for instance that the scroll wheel required the regular and what required advance. Then if we were able to see that down then we could make the decision at that point in time and then that would be the end of that issue. Does that make sense?"}, {"startTime": "593.52", "endTime": "594.08", "role": "B", "text": "Yes."}, {"startTime": "595.9", "endTime": "596.37", "role": "D", "text": "Mm-hmm."}, {"startTime": "595.97", "endTime": "598.79", "role": "C", "text": "Um I have a lot of the information there. It might not be very clear."}, {"startTime": "601.73", "endTime": "605.12", "role": "B", "text": "Is there Um."}, {"startTime": "602.16", "endTime": "603.7", "role": "C", "text": "Unless you want to plug it back in to yours."}, {"startTime": "606.17", "endTime": "610.1", "role": "B", "text": "We could do , yeah. Um yeah we should."}, {"startTime": "618.82", "endTime": "627.54", "role": "B", "text": "As I say it only specified that we need a more advanced circuit board for the scroll wheel , it didn't The voice recognition came as a separate piece of information. Um."}, {"startTime": "623.12", "endTime": "623.89", "role": "A", "text": "Mm-hmm."}, {"startTime": "627.23", "endTime": "632.51", "role": "A", "text": "No the scroll wheel required the regular , so the Hmm."}, {"startTime": "629.72", "endTime": "631.43", "role": "B", "text": "Yeah if if you down um."}, {"startTime": "632.8", "endTime": "639.86", "role": "B", "text": "It's just this bit at the bottom which I've highlighted , but the scroll wheel requires a mini m minimally a regular chip , which is in the higher price range."}, {"startTime": "640.59", "endTime": "649.63", "role": "A", "text": "Okay. The display requires an advanced chip the display requires an advanced chip which in turn is more expense."}, {"startTime": "642.23", "endTime": "671.3", "role": "C", "text": "I think the scroll wheel um Yeah , and if we're going for sleek and sexy , I think a scroll wheel is maybe a bit kinda bulky? I I've got um pictures well I've seen pictures with it kind of sticking off the side of it , and they don't really look great."}, {"startTime": "647.11", "endTime": "660.28", "role": "B", "text": "Also the display's for something else which we decided against. Um but that bit And note that the push button just requires a simple chip , so that would keep the price down."}, {"startTime": "653.52", "endTime": "653.98", "role": "A", "text": "Okay."}, {"startTime": "659.73", "endTime": "660.17", "role": "A", "text": "Down."}, {"startTime": "661.03", "endTime": "661.57", "role": "D", "text": "Mm-hmm."}, {"startTime": "670.34", "endTime": "673.04", "role": "A", "text": "Right. Okay."}, {"startTime": "671.83", "endTime": "672.04", "role": "B", "text": "'Kay."}, {"startTime": "672.62", "endTime": "732.8", "role": "B", "text": "So maybe just a simple push button , and that would cut costs on the Did everyone get this on the speech recognition? The um it was basically what we said before , the idea that you record in a set message , and then it picks up that message um and replies to you. So it is basically the concept we discussed before. Um but then we don't know for sure whether it would require a more complicated circuit board. I'm guessing it would , but got like the definite information. Maybe we should go on what we're certain of rather than Um if it's just the push button then it just needs the simple circuit board."}, {"startTime": "674.64", "endTime": "696.94", "role": "A", "text": "So. So we're going for p Okay. So is um Simple push button."}, {"startTime": "690.05", "endTime": "692.96", "role": "D", "text": "So are we going for the w are we going for the simple one , are we?"}, {"startTime": "693.19", "endTime": "695.77", "role": "C", "text": "Yeah , a simple pushbuttons."}, {"startTime": "694.18", "endTime": "694.45", "role": "D", "text": "Okay."}, {"startTime": "705.6", "endTime": "705.98", "role": "A", "text": "Mm-hmm."}, {"startTime": "705.86", "endTime": "706.25", "role": "D", "text": "Yeah."}, {"startTime": "721.88", "endTime": "728.73", "role": "A", "text": "So if we go for the simple push button , so effectively we're going for the simple printed circuit board are we? Or are we going for the regular?"}, {"startTime": "732.69", "endTime": "764.72", "role": "A", "text": "Mm-mm. But is there any other I mean okay , that's true for the for for that element , but we have to take all el elements into consideration. And so if there is one element that requires the more expensive one , or say the regular one , or the more advanced , then that would have to be the same for all of them. S Right."}, {"startTime": "752.85", "endTime": "753.1", "role": "D", "text": "Mm."}, {"startTime": "755.83", "endTime": "777.4", "role": "C", "text": "Hmm. But But the way that I interpret that um it doesn't seem to send out a signal to the telly , it just it's like a parrot just rep reply replying to your message. So I don't think it would effect our circuit board."}, {"startTime": "756.98", "endTime": "763.05", "role": "D", "text": "I suppose we need we need to find out what circuit board that requires , maybe before we m make a decision."}, {"startTime": "771.99", "endTime": "773.5", "role": "D", "text": "Oh yeah , I suppose so , yeah."}, {"startTime": "772.3", "endTime": "772.72", "role": "A", "text": "Mm-hmm."}, {"startTime": "773.48", "endTime": "775.25", "role": "B", "text": "So maybe that would be something separate , yeah."}, {"startTime": "776.05", "endTime": "776.19", "role": "D", "text": "Yeah."}, {"startTime": "776.53", "endTime": "776.92", "role": "A", "text": "No."}, {"startTime": "776.9", "endTime": "781.97", "role": "B", "text": "Okay , so we'd have a simple circuit board and that would be an extra that would be in addition to it. Oh that makes sense."}, {"startTime": "780.2", "endTime": "796.09", "role": "C", "text": "Yeah. And I don't think you could really perform any of the remote functions with it. 'Cause the example that they've given there is good morning coffee machine , good morning Jo. It might be useful to say like where are you remote. Here I am , Jo. But I think that's maybe as far as that one could go?"}, {"startTime": "780.77", "endTime": "780.96", "role": "D", "text": "Yeah."}, {"startTime": "788.06", "endTime": "788.79", "role": "A", "text": "Mm-mm."}, {"startTime": "791.01", "endTime": "791.26", "role": "B", "text": "Okay."}, {"startTime": "793.03", "endTime": "795.06", "role": "D", "text": "Yeah."}, {"startTime": "796.53", "endTime": "797.1", "role": "A", "text": "Okay."}, {"startTime": "797.44", "endTime": "797.62", "role": "D", "text": "Yeah."}, {"startTime": "797.94", "endTime": "804.65", "role": "B", "text": "Yeah that makes sense , so we'd stick with the simple circuit board and then think of the speech recognition as an extra an extra possibility."}, {"startTime": "803.64", "endTime": "805.0", "role": "C", "text": "Yeah , just as a fun way to find it."}, {"startTime": "805.41", "endTime": "806.75", "role": "B", "text": "Okay. Um."}, {"startTime": "808.0", "endTime": "811.04", "role": "A", "text": "Simple circuit board. Simple push button."}, {"startTime": "814.23", "endTime": "820.47", "role": "A", "text": "Okay. W w kinetic. You were you were wanting to go for the kinetic power supply."}, {"startTime": "816.1", "endTime": "819.21", "role": "C", "text": "And it says that I think it said the cost of that isn't too much."}, {"startTime": "820.82", "endTime": "825.45", "role": "B", "text": "Um yeah I I thought so just for just for ease of not having to replace the batteries."}, {"startTime": "825.79", "endTime": "829.57", "role": "A", "text": "Mm-hmm. And how does it get uh charged up?"}, {"startTime": "826.16", "endTime": "826.35", "role": "D", "text": "Mm-hmm."}, {"startTime": "826.91", "endTime": "827.37", "role": "B", "text": "Um."}, {"startTime": "830.08", "endTime": "846.52", "role": "B", "text": "It's um I think it works on the basis they have some kind of ball bearings inside. It's um it's some on watches which you you kind of you shake to power it up. Somehow the mechanism inside powers up through movement. So you'd you'd move the remote around a little bit and then that powers it up to use it."}, {"startTime": "840.37", "endTime": "840.73", "role": "D", "text": "Mm-hmm."}, {"startTime": "843.29", "endTime": "843.81", "role": "A", "text": "Okay."}, {"startTime": "846.8", "endTime": "894.76", "role": "A", "text": "Okay. So the speech recognition was Are we going for speech recognition? No? 'Cause that required the advanced I had speech recognition requires advanced req require Oh. So okay. Speech recognition you reckon then is s simple. And so we would want it in as an extra because it doesn't appear to cost too much. Would that be In fact , it wouldn't really cost anymore , would it?"}, {"startTime": "847.11", "endTime": "847.39", "role": "D", "text": "Yeah."}, {"startTime": "854.32", "endTime": "862.65", "role": "C", "text": "Um I think it would be helpful to find it , but I don't think it'd um Yeah , I think so."}, {"startTime": "856.72", "endTime": "864.95", "role": "D", "text": "Just Just just for the call and find thing."}, {"startTime": "858.21", "endTime": "869.74", "role": "B", "text": "Uh yeah I think did we decide it didn't affect the circuit board , it just affected It was just Oh no th that's what that's what I thought , but maybe maybe it doesn't."}, {"startTime": "870.44", "endTime": "871.64", "role": "B", "text": "Um I think I might have got that wrong."}, {"startTime": "871.84", "endTime": "884.61", "role": "D", "text": "'Cause it's s it's separate isn't it , it's not part of the Mm-hmm."}, {"startTime": "876.72", "endTime": "879.23", "role": "B", "text": "It's it's just an addition thing it's um yeah."}, {"startTime": "883.94", "endTime": "884.33", "role": "B", "text": "'Kay."}, {"startTime": "883.94", "endTime": "884.18", "role": "C", "text": "Mm-hmm."}, {"startTime": "888.34", "endTime": "889.49", "role": "B", "text": "'Kay shall I pass on to you now?"}, {"startTime": "888.97", "endTime": "896.59", "role": "C", "text": "I think I'll just just check what it said."}, {"startTime": "900.72", "endTime": "923.34", "role": "C", "text": "Actually I don't think it really says anything about the cost , but it says that it's already in the coffee machines , so like it's already kind of Um."}, {"startTime": "908.12", "endTime": "908.43", "role": "D", "text": "Yeah."}, {"startTime": "909.28", "endTime": "915.94", "role": "B", "text": "I assume it would cost extra , but Maybe we maybe we'll find out how much that does cost and have to decide slightly later."}, {"startTime": "915.27", "endTime": "919.79", "role": "A", "text": "And then have to change all change everything at the last minute."}, {"startTime": "921.73", "endTime": "960.88", "role": "A", "text": "Okay. S Sorry?"}, {"startTime": "929.73", "endTime": "936.22", "role": "C", "text": "Oh , that was quick. Um okay , so very brief presentation , um."}, {"startTime": "938.34", "endTime": "957.36", "role": "C", "text": "From looking at the remotes that are out there at the minute , none of them are particularly um sleek and sexy. Um I haven't actually got the examples of the scroll button there , um but there's some curved cases that you can see , uh a range of sizes uh. All of them have a lot of buttons there um they seem to just have the rubber buttons."}, {"startTime": "958.83", "endTime": "959.44", "role": "C", "text": "Does that move it?"}, {"startTime": "961.21", "endTime": "964.05", "role": "C", "text": "It just seems to be skipping on without us doing anything."}, {"startTime": "962.33", "endTime": "966.23", "role": "A", "text": "Yeah , I've found that try and get it back."}, {"startTime": "965.72", "endTime": "967.82", "role": "B", "text": "If you right click and then go onto a previous slide."}, {"startTime": "968.32", "endTime": "1035.08", "role": "C", "text": "Ah it's alright. Um. There wasn't much more to say about that , just rambling. Um some of the uh remotes that I looked at , one of the models da did actually have voice recognition where you could um where it was connected to the remote control functions. And uh it was quite uh a swish model , where it can control uh four devices , T_V_ , cable , satellite , video , D_V_D_ , audio. Um so that's a bit of competition there. So I mean maybe it's better not to try and compete with that sort of thing and just to market it as a completely different um like different viewpoint as a kind of finding your lost control rather than trying to compete with the functions. Um the scroll buttons , as you've already mentioned , um there's examples of those , but they don't look as sleek as other models. And there's no real advantage and because it impacts on other on the materials and the price it's not great. Um Yeah. Th there was a specialist type of remote that we could think about , um."}, {"startTime": "968.96", "endTime": "971.15", "role": "B", "text": "Okay , right."}, {"startTime": "1005.96", "endTime": "1006.64", "role": "B", "text": "Yeah , yeah."}, {"startTime": "1025.0", "endTime": "1025.83", "role": "B", "text": "On the price , yeah."}, {"startTime": "1028.06", "endTime": "1049.73", "role": "A", "text": "So you were saying the scroll buttons Mm-hmm."}, {"startTime": "1036.88", "endTime": "1048.54", "role": "C", "text": "There was children's remote , where um they just had a very limited range of buttons and they were b uh bright and colourful and um you you could program them so that they could only look at certain channels."}, {"startTime": "1048.93", "endTime": "1049.17", "role": "B", "text": "'Kay."}, {"startTime": "1049.99", "endTime": "1053.44", "role": "C", "text": "Um but I don't know if that's really in our field? But that's something that's out there."}, {"startTime": "1052.36", "endTime": "1058.85", "role": "B", "text": "I guess I guess we're going for the biggest market , maybe not , but Was it was it specified that we went for the biggest?"}, {"startTime": "1059.16", "endTime": "1088.3", "role": "A", "text": "Well we're to go for the international market rather than a local market but that that wouldn't necessarily preclude The one thing that you can often do with products is you can uh make small modifications. So you have your basic model which you would sell at whatever , and then you could have additional features in you know like a You'd have model one , model two and model three , and therefore you can sub-divide your market up. But that's really where your field is."}, {"startTime": "1062.76", "endTime": "1062.91", "role": "C", "text": "Hmm."}, {"startTime": "1086.69", "endTime": "1086.94", "role": "D", "text": "Mm-hmm."}, {"startTime": "1088.1", "endTime": "1137.46", "role": "B", "text": "So maybe the children's remote should be like a a next step , but maybe I dunno for ours , maybe we should Yeah."}, {"startTime": "1092.11", "endTime": "1111.44", "role": "A", "text": "Anyway you could add on for an extra package , but on this basic one I'm reckoning that we're going for the basic model to be discussed here and that uh you would have for future reference the possibility of adding in extra features at extra cost to take care of specialist market segments."}, {"startTime": "1106.5", "endTime": "1106.75", "role": "C", "text": "Hmm."}, {"startTime": "1107.68", "endTime": "1108.15", "role": "D", "text": "Mm-hmm."}, {"startTime": "1110.85", "endTime": "1111.08", "role": "D", "text": "Mm-hmm."}, {"startTime": "1111.6", "endTime": "1116.14", "role": "C", "text": "Okay. Right well that's something that we can be aware of."}, {"startTime": "1113.09", "endTime": "1118.46", "role": "A", "text": "Is that So so what are we deciding to do here?"}, {"startTime": "1117.96", "endTime": "1118.46", "role": "C", "text": "Um."}, {"startTime": "1119.49", "endTime": "1133.01", "role": "C", "text": "I think because there's already um very good voice recognition technology out there , and because ours might not cover the same functions that the leading brands do , it might be a good idea to market it as a um finder function."}, {"startTime": "1124.88", "endTime": "1125.39", "role": "A", "text": "Right."}, {"startTime": "1129.08", "endTime": "1129.62", "role": "A", "text": "Mm-hmm."}, {"startTime": "1133.63", "endTime": "1139.87", "role": "A", "text": "Uh the fi Yeah , the finder function rather than as a speech function to find your remote. Okay."}, {"startTime": "1138.38", "endTime": "1138.63", "role": "C", "text": "Yeah."}, {"startTime": "1139.06", "endTime": "1146.21", "role": "B", "text": "So you also said for going for the international market um that some some maybe older people might not like the speech recognition."}, {"startTime": "1146.8", "endTime": "1147.24", "role": "C", "text": "Oh yeah."}, {"startTime": "1146.88", "endTime": "1163.52", "role": "B", "text": "S s so um Yeah , yeah. It w it would make it quite complicated , where um ours at least keeps it fairly simple and then the Yeah , yeah."}, {"startTime": "1148.05", "endTime": "1150.49", "role": "C", "text": "Different languages might not be compatible."}, {"startTime": "1152.65", "endTime": "1153.32", "role": "A", "text": "Hmm."}, {"startTime": "1155.94", "endTime": "1156.16", "role": "C", "text": "Hmm."}, {"startTime": "1156.9", "endTime": "1157.15", "role": "D", "text": "Mm-hmm."}, {"startTime": "1158.06", "endTime": "1164.54", "role": "C", "text": "Yeah , 'cause I think you program um this one yourself , like to say like whatever you want to your question."}, {"startTime": "1166.28", "endTime": "1170.3", "role": "D", "text": "Yeah and ours is quite a cheap device , so I don't know how much we'll be able to put into it."}, {"startTime": "1170.74", "endTime": "1171.07", "role": "B", "text": "Yeah."}, {"startTime": "1171.79", "endTime": "1172.26", "role": "D", "text": "Yeah."}, {"startTime": "1171.9", "endTime": "1181.45", "role": "A", "text": "So you'd have a finder feature rather than a voice recognition feature. And you were talking Mm. And you were talking about scroll buttons?"}, {"startTime": "1176.01", "endTime": "1178.51", "role": "C", "text": "Hmm. Maybe unless something else comes up."}, {"startTime": "1181.69", "endTime": "1192.12", "role": "C", "text": "Um yeah I think um I think we've decided that it's gonna increase the cost and give no real kinda extra benefit and it's gonna decrease from the sleekness of it."}, {"startTime": "1187.8", "endTime": "1195.9", "role": "A", "text": "Okay. b Alright , so we're just gonna have the the rubber buttons , was that right?"}, {"startTime": "1189.19", "endTime": "1189.51", "role": "B", "text": "Yeah."}, {"startTime": "1194.98", "endTime": "1195.63", "role": "B", "text": "Yes yes."}, {"startTime": "1195.75", "endTime": "1206.2", "role": "C", "text": "Hmm um and just to be aware that there are kind of specialist functions and specialist remotes but we probably don't want to focus on those like such as the children's remote."}, {"startTime": "1205.53", "endTime": "1208.96", "role": "A", "text": "Okay. So not to be focused on."}, {"startTime": "1208.69", "endTime": "1228.69", "role": "C", "text": "Yeah. Um there was a mention just as kind of a warning about button design. Um just to avoid ambiguity. So it gave the example of say your volume buttons for up and down , they might both have a V_ on for volume , Um let's think how they did this."}, {"startTime": "1230.3", "endTime": "1237.81", "role": "A", "text": "Good in in Flip it round in ninety degree a hundred and eighty degrees and have it up and down. An upside-down V_."}, {"startTime": "1231.64", "endTime": "1233.13", "role": "C", "text": "I'm just gonna check so I do this right."}, {"startTime": "1238.52", "endTime": "1240.43", "role": "C", "text": "Um. What did they say?"}, {"startTime": "1238.88", "endTime": "1243.0", "role": "A", "text": "So that would show that volume was going up , whereas the one underneath would see the volume going down."}, {"startTime": "1243.64", "endTime": "1271.5", "role": "C", "text": "Um I think the thing was that if you decide to do this , to have triangular buttons , um somebody might look at this one and say oh well this triangular button is pointing up , and that's the first thing that they see Actually that can't be right , can it? Oh well , no , they might see yeah , they might see this pointing down and think right that's gonna turn the volume down , whereas the actual button's pointing up , so the function is to turn the button up."}, {"startTime": "1258.47", "endTime": "1258.98", "role": "A", "text": "Right."}, {"startTime": "1264.85", "endTime": "1265.25", "role": "A", "text": "Mm-hmm."}, {"startTime": "1269.99", "endTime": "1270.38", "role": "A", "text": "Mm-hmm."}, {"startTime": "1272.58", "endTime": "1281.88", "role": "C", "text": "So , be careful what you put on the buttons and be careful of the shape that you make them , because they might be kind of two um contradicting kind of shapes."}, {"startTime": "1273.11", "endTime": "1277.22", "role": "B", "text": "So maybe we could have like Yeah."}, {"startTime": "1276.91", "endTime": "1277.13", "role": "D", "text": "Mm-hmm."}, {"startTime": "1280.8", "endTime": "1286.52", "role": "B", "text": "Yeah I I know what you mean. So maybe we could have volume written on the side and then up and down on the on the buttons themselves."}, {"startTime": "1286.98", "endTime": "1334.59", "role": "A", "text": "Yeah. You could have volume up and volume Volume up , down and Like that. And 'cause the idea was to have limited um it was to have sizable amount of information on it. Limited number of buttons. 'Cause it was sixteen buttons , wasn't it that were Okay."}, {"startTime": "1287.01", "endTime": "1287.62", "role": "C", "text": "Yeah."}, {"startTime": "1287.92", "endTime": "1288.41", "role": "B", "text": "Possible."}, {"startTime": "1293.78", "endTime": "1293.99", "role": "B", "text": "Mm."}, {"startTime": "1301.99", "endTime": "1302.93", "role": "B", "text": "Yeah yeah."}, {"startTime": "1304.46", "endTime": "1304.62", "role": "B", "text": "Yeah."}, {"startTime": "1306.4", "endTime": "1308.32", "role": "B", "text": "Yeah we got it down to not too many."}, {"startTime": "1306.99", "endTime": "1307.21", "role": "D", "text": "Mm-hmm."}, {"startTime": "1311.48", "endTime": "1314.59", "role": "C", "text": "Um and I think that's all I had to say for that."}, {"startTime": "1316.82", "endTime": "1317.18", "role": "D", "text": "Okay."}, {"startTime": "1319.86", "endTime": "1322.97", "role": "C", "text": "Um so what was the decision on the um design of the volume button?"}, {"startTime": "1323.88", "endTime": "1335.42", "role": "B", "text": "Um Are we are we gonna go through the design of all the buttons at the moment , or are we gonna t Yeah , maybe we should see yours first."}, {"startTime": "1330.84", "endTime": "1335.48", "role": "D", "text": "I've I've got some things to say about possible design things from trend watching."}, {"startTime": "1334.1", "endTime": "1334.72", "role": "C", "text": "Oh okay."}, {"startTime": "1338.26", "endTime": "1338.5", "role": "D", "text": "Cool."}, {"startTime": "1352.55", "endTime": "1413.01", "role": "D", "text": "Right , um I've been looking at some trends in in sort of basically fashion on top of doing the um research into the remote control market the the one that's the one I talked about last time , that we'd sort of asked people about remote controls and what what was good about them , what was bad , what they used. And we've also been looking at sort of fa sort of fashions and what people are wanting out of consumer goods at the moment. So we've had people in Paris and Milan watching the uh fashion trends. So So just to summarise the most important things which came out of the remote control market investigation. The most important thing was that the thing sort of look and felt fancy rather than just functional. And second , there should be some technological innovation. And then third and l less important than the other two , there should be an ease of use as well."}, {"startTime": "1387.84", "endTime": "1391.82", "role": "A", "text": "You know yourself."}, {"startTime": "1402.96", "endTime": "1403.14", "role": "B", "text": "'Kay."}, {"startTime": "1413.51", "endTime": "1468.36", "role": "D", "text": "And apparently , the fashion trends are that people want sort of clothes and shoes and things with a fruit and vegetables theme. Um but um the feel of the material should be spongy , which is contrary to last year , apparently. I presume it must have been not not spongy last year. So we need to emphasise the fancy design with on on our remote control above all else. And then also try and add in technological informat innovation which could be our sort of find the thing with a hand clap. And then we need to ma sort of make it easy to use that's as a third priority , so perhaps um fewer fewer buttons and functions as we've as we've discussed. And then maybe find a way to incorporate these trends so that we sort of capture people's imaginations."}, {"startTime": "1468.77", "endTime": "1488.92", "role": "D", "text": "So maybe we could make the buttons shaped like fruit and veg , or the the buttons could be spongy , uh somehow. Maybe we could make them out of rubber rather than sort of hard plastic. And then sort of even wackier than that , we could maybe have a fruit or vegetable shaped remote , say in the shape of a banana or something like that."}, {"startTime": "1490.42", "endTime": "1497.54", "role": "D", "text": "Right , so that'll be it. Maybe a banana or courgette or something."}, {"startTime": "1499.89", "endTime": "1511.86", "role": "D", "text": "How how far we actually want to go along and sort of follow the trends , do we think the trends are particularly important for this type of gadget , or or you know , do they not matter that much?"}, {"startTime": "1512.37", "endTime": "1516.87", "role": "C", "text": "I think if you start making the buttons fruit shaped , it might make it more complicated to use."}, {"startTime": "1517.1", "endTime": "1529.88", "role": "A", "text": "Well you were just talking about you've got to be careful how you shape your buttons , 'cause you're can mis-direct people. And I would've thought the functionality 'cause the people get cheesed off by things by having to read instructions et cetera , so."}, {"startTime": "1522.8", "endTime": "1523.08", "role": "D", "text": "Yeah."}, {"startTime": "1523.01", "endTime": "1523.75", "role": "C", "text": "Yeah."}, {"startTime": "1530.528", "endTime": "1538.019", "role": "A", "text": "..."}, {"startTime": "1531.52", "endTime": "1538.14", "role": "C", "text": "Maybe just one button , say the standby button is quite kinda separate from all the other functions. Maybe that could be a little apple."}, {"startTime": "1538.71", "endTime": "1542.58", "role": "C", "text": "And then that wouldn't get in the way of like kinda one to nine , and it wouldn't confuse the numbers."}, {"startTime": "1538.76", "endTime": "1550.95", "role": "A", "text": "Okay. Now? Yeah. Stand-by button. No th that that incorporates the trend whilst at the same time not confusing people , if you're looking for functionality."}, {"startTime": "1539.09", "endTime": "1540.31", "role": "D", "text": "Maybe yeah."}, {"startTime": "1547.99", "endTime": "1548.24", "role": "D", "text": "Mm-hmm."}, {"startTime": "1551.48", "endTime": "1596.13", "role": "B", "text": "Well I dunno I I guess maybe fruit and vegetables may be popular at the moment , but as we know how fickle the fashion markets are , maybe I mean it just seems realistic that the remote control market isn't the kind of thing which takes in those kinds of fashion trends. to something which is maybe more universal."}, {"startTime": "1555.49", "endTime": "1581.58", "role": "A", "text": "But what are they gonna be next Yeah. What are they gonna be next year. But but th but okay but you you can incorporate the tr If y if you change all the buttons then you've got the problem that this year's fruit and veg , next year's uh I was gonna say animals or elephants or w whatever. That means you're constantly changing your production schedule , and you've gotta make different moulds and everything else , so that's not a good idea I would I would suggest."}, {"startTime": "1557.53", "endTime": "1559.56", "role": "D", "text": "Yeah yeah."}, {"startTime": "1559.03", "endTime": "1625.05", "role": "C", "text": "Hmm. S But I suppose as long as it's quite a subtle design , um even if the design kind of changes , It seems like you're gonna have rubber cases , as well as buttons."}, {"startTime": "1565.97", "endTime": "1566.25", "role": "D", "text": "Mm-hmm."}, {"startTime": "1572.49", "endTime": "1578.58", "role": "D", "text": "Yeah , I'm not Yeah."}, {"startTime": "1580.33", "endTime": "1587.02", "role": "D", "text": "I'm not I'm not sure what what what the sort of timescale we're thinking of selling the product over is. I don't know."}, {"startTime": "1592.12", "endTime": "1592.97", "role": "D", "text": "Yeah , yeah."}, {"startTime": "1596.68", "endTime": "1596.93", "role": "D", "text": "Mm-hmm."}, {"startTime": "1596.95", "endTime": "1610.72", "role": "A", "text": "Well Ah d d But if Mm-hmm. Well. Yep."}, {"startTime": "1599.68", "endTime": "1599.82", "role": "D", "text": "Mm-hmm."}, {"startTime": "1600.78", "endTime": "1603.64", "role": "B", "text": "We c maybe can imply a fruit shape possibly."}, {"startTime": "1603.72", "endTime": "1604.04", "role": "D", "text": "Mm-hmm."}, {"startTime": "1605.37", "endTime": "1608.79", "role": "B", "text": "Maybe the spongy feel is something we could think about , um."}, {"startTime": "1611.12", "endTime": "1628.22", "role": "B", "text": "Maybe still with a rubber design we could Um."}, {"startTime": "1613.58", "endTime": "1637.87", "role": "A", "text": "Was that in the sort of fashion sense that this Or was the spongy feel was that uh sort of fashion? It was , wasn't it? So the Mm-hmm."}, {"startTime": "1620.47", "endTime": "1620.7", "role": "D", "text": "Yeah."}, {"startTime": "1625.3", "endTime": "1625.62", "role": "D", "text": "Yeah."}, {"startTime": "1626.84", "endTime": "1627.02", "role": "D", "text": "Yeah."}, {"startTime": "1628.74", "endTime": "1634.11", "role": "C", "text": "And that you can make them curved or double-curved and that would be the kind of sleek and sexy look."}, {"startTime": "1632.93", "endTime": "1636.69", "role": "B", "text": "Oh yeah yeah one of the things were if you had rubber buttons then you had to have a rubber case."}, {"startTime": "1637.55", "endTime": "1639.09", "role": "C", "text": "Oh right , that fits , doesn't it?"}, {"startTime": "1637.57", "endTime": "1647.31", "role": "B", "text": "Um oh no no no sorry it's if you use the uh rubber double curved case then you must use rubber buttons. That's the way round. If you have the rubber case then you have to have the rubber buttons to go with it."}, {"startTime": "1648.36", "endTime": "1649.42", "role": "B", "text": "Which makes sense."}, {"startTime": "1650.13", "endTime": "1650.41", "role": "C", "text": "Right."}, {"startTime": "1651.27", "endTime": "1651.61", "role": "B", "text": "Um."}, {"startTime": "1651.51", "endTime": "1654.79", "role": "A", "text": "Rubber buttons require rubber case."}, {"startTime": "1653.99", "endTime": "1657.8", "role": "C", "text": "And that would fit in with what we want , wouldn't it , for the spongy feel , to have everything rubber."}, {"startTime": "1655.88", "endTime": "1656.22", "role": "D", "text": "Mm-hmm."}, {"startTime": "1658.46", "endTime": "1727.68", "role": "A", "text": "Uh so , yeah. The m the main problem is how f how frequently do the fashions change? 'Cause in essence in the production you want things to stay you want to basically mint them out 'cause if you've got fashion changes and that you're incorporating , then it means that your stock is um is last year's stock and therefore you're selling it or having to sell it at a discounted rate which you wouldn't want to do. Whereas if you kept the product the same but you could have a difference from year to year , uh it seems to me that you could incorporate a fashion statement if you like , rather than changing the whole kit and caboodle. You're just changing one aspect like like the standby button or something like that , and especially 'cause then you could make it something that Well , you might be limited in space , that yes. Well you two are obviously gonna find that out fairly quickly when you move over to your kit modelling stage as to uh how much pl how much how much how pliable is Plasticine."}, {"startTime": "1668.05", "endTime": "1668.27", "role": "D", "text": "Mm-hmm."}, {"startTime": "1678.92", "endTime": "1679.19", "role": "D", "text": "Mm-hmm."}, {"startTime": "1684.04", "endTime": "1684.37", "role": "D", "text": "Yeah."}, {"startTime": "1691.43", "endTime": "1691.98", "role": "D", "text": "Okay."}, {"startTime": "1697.68", "endTime": "1698.05", "role": "D", "text": "Yeah."}, {"startTime": "1698.0", "endTime": "1698.33", "role": "B", "text": "Yeah."}, {"startTime": "1706.81", "endTime": "1712.6", "role": "B", "text": "I suppose we maybe are limited in the fact that we still have to put the logo on the actual would or not."}, {"startTime": "1707.25", "endTime": "1707.46", "role": "D", "text": "Mm-hmm."}, {"startTime": "1713.38", "endTime": "1713.71", "role": "B", "text": "Yeah."}, {"startTime": "1713.66", "endTime": "1714.09", "role": "D", "text": "Mm-hmm."}, {"startTime": "1714.48", "endTime": "1714.79", "role": "C", "text": "Hmm."}, {"startTime": "1719.54", "endTime": "1721.02", "role": "B", "text": "Yes yes."}, {"startTime": "1726.53", "endTime": "1739.77", "role": "B", "text": "Maybe we could think of the the cases like changing with the fashions like the Nokia phones where you could take the casing off the outside. But whether that would be too much to incorporate in production , whether that would just increase the costs , make it more complicated."}, {"startTime": "1732.81", "endTime": "1733.12", "role": "D", "text": "Mm-hmm."}, {"startTime": "1737.62", "endTime": "1747.13", "role": "A", "text": "Hmm. So you're talking there about uh changing changing the casing."}, {"startTime": "1740.87", "endTime": "1741.82", "role": "D", "text": "That's possibly it."}, {"startTime": "1747.11", "endTime": "1756.22", "role": "B", "text": "Yeah the a the actual the sort of the look from the outside , so where the buttons would stay the same , and the general function of the remote would stay the same , but you could change the the way it looked."}, {"startTime": "1751.28", "endTime": "1751.52", "role": "D", "text": "Mm-hmm."}, {"startTime": "1756.61", "endTime": "1766.6", "role": "C", "text": "Yeah and then you could have Oh but you still would have to have the logo on every new case , but you could have like pink cases for girls and red ones and things like that."}, {"startTime": "1761.01", "endTime": "1762.16", "role": "B", "text": "Yeah , that's true."}, {"startTime": "1764.38", "endTime": "1832.32", "role": "A", "text": "Yeah you you could do a colour change , so therefore you would yeah yeah I mean that's effectively what they did with the with the mobile phones , was to have some in blue , some in red , some in rather than all in black or , you know , which four do you want , as long as it's black? But uh so Yes oh that's true uh that might no Well not necessarily , because you could have your company uh We're we're meant to be finishing up. You could have your company badge and logo. I mean a lot of um computers for instance like like on the one you've got there , it actually has a sort of um stick on badge so what you would al all you would really need , whether it , you know , whether the casing be w any colour , could be any colour , but that badge would then have to stick out on top of it so that uh in a sense , with a with a logo like that , because it's on a white background , the only colour that it might not stick out so well on would be a white casing."}, {"startTime": "1771.27", "endTime": "1771.64", "role": "B", "text": "Yeah."}, {"startTime": "1773.51", "endTime": "1773.93", "role": "D", "text": "Mm-hmm."}, {"startTime": "1776.2", "endTime": "1776.48", "role": "C", "text": "Hmm."}, {"startTime": "1781.94", "endTime": "1783.52", "role": "B", "text": "So it is a possibility , um."}, {"startTime": "1783.67", "endTime": "1792.76", "role": "C", "text": "But we are supposed to use the um company colour scheme , aren't we? We haven't really seen that yet It might and we might be able to do both but it might clash with certain things."}, {"startTime": "1787.57", "endTime": "1833.49", "role": "B", "text": "Oh okay yes that is Mm-hmm."}, {"startTime": "1788.39", "endTime": "1788.98", "role": "D", "text": "Yeah."}, {"startTime": "1805.35", "endTime": "1805.8", "role": "D", "text": "Mm-hmm."}, {"startTime": "1822.07", "endTime": "1822.55", "role": "D", "text": "Mm-hmm."}, {"startTime": "1832.86", "endTime": "1857.17", "role": "A", "text": "'Cause you you know you're sort of you're badging it. And in fact a lot of companies get somebody else to make them and literally just badge them themselves with their own uh badge over the top. And in fact the way they've got that there even if you had that on a white , which is the predominant colour of the uh the Windows badge , you'd still be able to see it clearly from you know a white casing uh product. So."}, {"startTime": "1839.52", "endTime": "1840.0", "role": "D", "text": "Mm-hmm."}, {"startTime": "1841.91", "endTime": "1842.13", "role": "D", "text": "Mm-hmm."}, {"startTime": "1852.81", "endTime": "1853.27", "role": "B", "text": "Mm-hmm."}, {"startTime": "1855.31", "endTime": "1855.63", "role": "B", "text": "Yeah."}, {"startTime": "1856.71", "endTime": "1857.28", "role": "C", "text": "Hmm."}, {"startTime": "1856.74", "endTime": "1863.28", "role": "B", "text": "And whether we'd have a big enough market to have this kind of like secondary market of selling the cases might be something to consider."}, {"startTime": "1863.96", "endTime": "1864.27", "role": "D", "text": "Mm-hmm."}, {"startTime": "1864.37", "endTime": "1872.86", "role": "C", "text": "Well if it's for young people , um like the phone generation , that sort of thing'd probably go down well , and the market research has been on that side of things , hasn't it?"}, {"startTime": "1867.04", "endTime": "1867.34", "role": "D", "text": "Yeah."}, {"startTime": "1869.32", "endTime": "1869.63", "role": "B", "text": "Yeah."}, {"startTime": "1873.15", "endTime": "1895.08", "role": "D", "text": "Yeah , I mean it's people say that it's the look , they want the fancy looking thing but I'm Yeah. I'm not convinced on whether having changeable covers would be something that people would buy into. I think with the mobiles , it's the , you know it's a communication device , people see you with it all about and i if it Yeah."}, {"startTime": "1890.75", "endTime": "1894.47", "role": "B", "text": "Yeah I suppose , where you you keep the remote hidden under the sofa most of the time."}, {"startTime": "1892.92", "endTime": "1895.7", "role": "A", "text": "It's uh in in the house , isn't it , I suppose."}, {"startTime": "1896.44", "endTime": "1900.75", "role": "D", "text": "I think Mm-hmm."}, {"startTime": "1896.45", "endTime": "1913.02", "role": "C", "text": "Okay , so if we just went for one colour of a rubber case Did we decide on the rubber case? The spongy feel , or did we think that that might go as a trend?"}, {"startTime": "1899.87", "endTime": "1907.44", "role": "A", "text": "So don't change case. Change case colour. And we're sort of saying no to that."}, {"startTime": "1913.73", "endTime": "1919.02", "role": "D", "text": "Well , it was different last year. The trend was different last year apparently. It was not not spongy feel."}, {"startTime": "1919.54", "endTime": "1940.12", "role": "D", "text": "But I don't know whether the trend will change. I don't know whether it's one of those things that like sort of having all fruit shaped keys , that that probably would go out of fashion very quickly , whereas just the fact that it was a rubber case is probably less less of something that y you're gonna end up hating in a year , you know."}, {"startTime": "1932.38", "endTime": "1933.13", "role": "A", "text": "Yeah."}, {"startTime": "1935.99", "endTime": "1948.36", "role": "B", "text": "Yeah , less likely to So then th th that would Yeah."}, {"startTime": "1937.03", "endTime": "1937.76", "role": "A", "text": "Sounds reasonable."}, {"startTime": "1942.23", "endTime": "1952.49", "role": "A", "text": "If you're going for fashion trends like that they'll need t you'd have to have interchangeable cases so that you could or 'cause otherwise someone's gonna have to buy a complete new remote rather than just a case."}, {"startTime": "1949.27", "endTime": "1949.73", "role": "D", "text": "Yeah."}, {"startTime": "1952.89", "endTime": "1953.13", "role": "D", "text": "Mm."}, {"startTime": "1953.28", "endTime": "1958.85", "role": "B", "text": "it seems to make sense that we we'd just maybe stick with the standard rubber case , and then have the standard rubber buttons as well."}, {"startTime": "1959.51", "endTime": "1960.32", "role": "A", "text": "Okay."}, {"startTime": "1959.57", "endTime": "1960.08", "role": "D", "text": "Okay."}, {"startTime": "1960.29", "endTime": "1961.04", "role": "B", "text": "Um."}, {"startTime": "1960.45", "endTime": "1966.63", "role": "C", "text": "Uh we haven't really talked about uh the curvature of the case. There's flat , there's single-curved and there's double-curved."}, {"startTime": "1967.33", "endTime": "1968.08", "role": "B", "text": "Um."}, {"startTime": "1969.06", "endTime": "1971.38", "role": "C", "text": "I'm not exactly sure what these things look like."}, {"startTime": "1969.14", "endTime": "1981.86", "role": "B", "text": "Mayb Maybe curves give it like the slightly more aesthetic feel? But the double curve wouldn't require us to perform miracles with the Plasticine."}, {"startTime": "1979.25", "endTime": "1996.5", "role": "C", "text": "Well it says that I'm not exactly sure. Um I'll show you the remotes that I've got. See how uh Let's just get that bigger."}, {"startTime": "1981.88", "endTime": "1985.14", "role": "D", "text": "When you say d when you say double-curved , what what exactly does that mean?"}, {"startTime": "1987.58", "endTime": "1988.26", "role": "D", "text": "Okay."}, {"startTime": "1998.05", "endTime": "2004.5", "role": "C", "text": "See how uh the one Oh I'm not plugged in , am I? That doesn't help. Shall I just turn it round for time?"}, {"startTime": "2000.34", "endTime": "2004.22", "role": "D", "text": "No you're not connected to me anymore."}, {"startTime": "2002.07", "endTime": "2032.11", "role": "A", "text": "One one thing to cons one thing to consider is that in some ways you want um by having a fairly standard case it means they can all fit together on top of each other therefore for storage purposes in shops and the like and it makes it easier that you can if you can store them up on top of each other. Whereas if you do um fancy things with it , you then gotta put it in a ca a a packaging box that that does that. And the cost of packaging could be quite important vis-a-vis the total cost of the product."}, {"startTime": "2008.91", "endTime": "2010.06", "role": "D", "text": "That should come up."}, {"startTime": "2016.9", "endTime": "2018.52", "role": "D", "text": "Mm."}, {"startTime": "2017.79", "endTime": "2018.21", "role": "B", "text": "Mm-hmm."}, {"startTime": "2032.08", "endTime": "2071.33", "role": "B", "text": "Yeah yeah. So shall we go through quickly and just work out what we've decide on , if we have to kind of 'Kay , so shall we quickly We'll go for single curve , yeah. Single curve."}, {"startTime": "2032.71", "endTime": "2032.88", "role": "D", "text": "Mm-hmm."}, {"startTime": "2032.81", "endTime": "2033.19", "role": "C", "text": "Hmm."}, {"startTime": "2037.95", "endTime": "2042.34", "role": "A", "text": "So but No."}, {"startTime": "2039.04", "endTime": "2039.32", "role": "D", "text": "Yeah."}, {"startTime": "2040.45", "endTime": "2052.59", "role": "C", "text": "Um it's not very clear up there , but you can see some of them have got kind of bulges , like the second one and the end one uh where there's a curve there. I'm not exactl I don't know if a double curve is maybe it comes up slightly , or?"}, {"startTime": "2044.21", "endTime": "2045.08", "role": "A", "text": "Mm yep."}, {"startTime": "2046.04", "endTime": "2046.22", "role": "D", "text": "Right."}, {"startTime": "2052.15", "endTime": "2053.84", "role": "D", "text": "That's what I was trying to work out."}, {"startTime": "2054.98", "endTime": "2058.01", "role": "C", "text": "But um it is a kinda sleeker look if you've got curves in there."}, {"startTime": "2055.18", "endTime": "2056.43", "role": "A", "text": "Oh right."}, {"startTime": "2058.32", "endTime": "2067.08", "role": "D", "text": "Shall we Yeah."}, {"startTime": "2058.56", "endTime": "2066.78", "role": "A", "text": "S so do you wanna go for curves , more curves? We're meant to be f we're meant to be finishing this meeting in about a minute or so."}, {"startTime": "2062.22", "endTime": "2064.25", "role": "C", "text": "Definitely a single , maybe a double."}, {"startTime": "2067.43", "endTime": "2069.42", "role": "C", "text": "Shall we go for single curve , just to compromise?"}, {"startTime": "2070.21", "endTime": "2070.83", "role": "D", "text": "Okay."}, {"startTime": "2070.59", "endTime": "2073.86", "role": "A", "text": "Okay , curved or double curved? So it's single curved."}, {"startTime": "2074.02", "endTime": "2106.14", "role": "B", "text": "So did we did we decide on the kinetic power supply? The one you move around? Okay. Um Oh we ca Yeah yeah , we'll still have the Are we gonna go for the simple circuit board just to keep the cost down? I th I think we can by by not having anything too complicated."}, {"startTime": "2077.57", "endTime": "2079.79", "role": "D", "text": "Yeah I think that think that's a good idea."}, {"startTime": "2077.99", "endTime": "2078.51", "role": "C", "text": "Yeah."}, {"startTime": "2078.82", "endTime": "2079.12", "role": "A", "text": "Yep."}, {"startTime": "2084.21", "endTime": "2086.75", "role": "C", "text": "And the rubber push buttons , rubber case."}, {"startTime": "2085.6", "endTime": "2089.69", "role": "D", "text": "Rubber Rubber buttons and case."}, {"startTime": "2091.57", "endTime": "2097.05", "role": "C", "text": "Um and we don't really know much about the colour scheme or logo yet do we , but possibly a sticker."}, {"startTime": "2104.02", "endTime": "2104.52", "role": "D", "text": "Yeah."}, {"startTime": "2106.39", "endTime": "2110.96", "role": "C", "text": "Yeah. Yeah and and the voice recognition , we can use that can't we , just to find it."}, {"startTime": "2107.24", "endTime": "2107.44", "role": "B", "text": "Um."}, {"startTime": "2111.52", "endTime": "2112.34", "role": "D", "text": "Yeah yeah."}, {"startTime": "2111.97", "endTime": "2113.43", "role": "C", "text": "Without affecting the circuit board."}, {"startTime": "2112.04", "endTime": "2114.19", "role": "A", "text": "Yes. Yep."}, {"startTime": "2112.15", "endTime": "2112.56", "role": "B", "text": "Um."}, {"startTime": "2113.92", "endTime": "2118.82", "role": "B", "text": "And see we could always decide against it if something comes up that's just something to that we seemed to leave out."}, {"startTime": "2121.08", "endTime": "2128.49", "role": "D", "text": "Okay. And then are we going for sort of one button shaped like a fruit. Or veg."}, {"startTime": "2127.59", "endTime": "2133.18", "role": "C", "text": "Yeah that sounds like it wouldn't do too much harm in a couple of years. Uh what sort of shape do we want?"}, {"startTime": "2135.01", "endTime": "2139.69", "role": "D", "text": "Don't know , maybe just Yeah."}, {"startTime": "2135.45", "endTime": "2147.62", "role": "A", "text": "So we've got spongy feel buttons as well , have we? As well as or w or was that So it's rubber buttons , so it's not really spongy feel buttons , it's just rubber buttons. With a rubber case right?"}, {"startTime": "2140.47", "endTime": "2141.82", "role": "D", "text": "That's ru rubber buttons , yeah."}, {"startTime": "2141.67", "endTime": "2145.71", "role": "B", "text": "Yeah , it was just 'Kay."}, {"startTime": "2145.68", "endTime": "2147.64", "role": "D", "text": "Yeah. Reasonably spongy I guess , yeah."}, {"startTime": "2146.19", "endTime": "2147.84", "role": "C", "text": "Yeah , so it's not too wacky."}, {"startTime": "2148.93", "endTime": "2151.0", "role": "A", "text": "And the standby button is gonna be different."}, {"startTime": "2151.29", "endTime": "2152.08", "role": "D", "text": "Yeah okay."}, {"startTime": "2153.56", "endTime": "2159.89", "role": "C", "text": "Um I think an apple would be a good recognisable shape. If you start getting into kinda aubergines and things , it gets a bit weird."}, {"startTime": "2160.96", "endTime": "2161.64", "role": "D", "text": "Yeah."}, {"startTime": "2161.01", "endTime": "2166.26", "role": "A", "text": "Okay so what what shape are we making the standby button? A apple. Oh oh Sorry?"}, {"startTime": "2163.8", "endTime": "2164.17", "role": "D", "text": "Apple?"}, {"startTime": "2164.31", "endTime": "2164.67", "role": "C", "text": "Vote?"}, {"startTime": "2165.46", "endTime": "2165.98", "role": "D", "text": "Yeah."}, {"startTime": "2166.65", "endTime": "2170.68", "role": "C", "text": "Shall we vote on it? Anyone got any suggestions? Right."}, {"startTime": "2167.81", "endTime": "2178.41", "role": "D", "text": "Yeah. Apple apple a a qu Quite a big one , as well. A big apple. Uh Could be a red apple , yeah."}, {"startTime": "2167.99", "endTime": "2170.12", "role": "B", "text": "We will go for the a a a apples apples."}, {"startTime": "2172.39", "endTime": "2176.12", "role": "C", "text": "Okay. Ah. Well it could be red."}, {"startTime": "2179.65", "endTime": "2180.75", "role": "D", "text": "Either , don't mind."}, {"startTime": "2180.82", "endTime": "2182.57", "role": "A", "text": "A red apple? Is it?"}, {"startTime": "2181.78", "endTime": "2198.45", "role": "C", "text": "Yeah 'cause we wanna incorporate a bit of colour if we can , once we find out um Yeah."}, {"startTime": "2186.32", "endTime": "2194.72", "role": "B", "text": "Okay. And then we're gonna are you gonna work on keeping the button design quite simple? Just like the Just working out what we're gonna do for the next time."}, {"startTime": "2195.98", "endTime": "2196.26", "role": "D", "text": "Mm-hmm."}, {"startTime": "2196.52", "endTime": "2197.08", "role": "B", "text": "Um."}, {"startTime": "2199.97", "endTime": "2206.83", "role": "C", "text": "Yeah that seems pretty straight forward. 'Cause most of them will just be kind of mainly circular or like very plain."}, {"startTime": "2201.81", "endTime": "2202.0", "role": "B", "text": "Yeah."}, {"startTime": "2206.99", "endTime": "2207.63", "role": "B", "text": "'Kay."}, {"startTime": "2207.64", "endTime": "2207.79", "role": "D", "text": "Mm-hmm."}, {"startTime": "2209.88", "endTime": "2210.32", "role": "D", "text": "Okay."}, {"startTime": "2213.21", "endTime": "2216.21", "role": "A", "text": "Sorry what was that last thing again there?"}, {"startTime": "2215.46", "endTime": "2217.77", "role": "C", "text": "Uh just to keep the shape of the buttons simple."}, {"startTime": "2219.09", "endTime": "2228.49", "role": "A", "text": "Right much option on that. I thought you were going for a single curve and Alright."}, {"startTime": "2224.17", "endTime": "2226.7", "role": "C", "text": "Ah just the uh shape of the buttons."}, {"startTime": "2228.98", "endTime": "2236.3", "role": "B", "text": "And j yeah , just keeping the sort of the labelling them labelling of them fairly simple as well. Fairly sort of self explanatory."}, {"startTime": "2236.95", "endTime": "2239.22", "role": "A", "text": "Right , so shape of buttons simple."}, {"startTime": "2248.42", "endTime": "2262.22", "role": "A", "text": "Okay. So that's that , I guess. We should now go away and get these things sorted out. I guess you two are on plasticine duty or whatever. Okay , so um."}, {"startTime": "2258.94", "endTime": "2259.26", "role": "B", "text": "Okay."}, {"startTime": "2266.58", "endTime": "2267.4", "role": "B", "text": "Is that the end? Okay."}]