[{"startTime": "39.79", "endTime": "54.42", "role": "B", "text": "Okay , we start waiting for people coming late and uh I can say this because in this moment you cannot answer because you don't have the microphone. So I can say whatever and you cannot reply. So yeah."}, {"startTime": "39.96", "endTime": "40.4", "role": "A", "text": "Thanks."}, {"startTime": "43.41", "endTime": "45.41", "role": "C", "text": "Yeah , sorry about that , Matthew is still on the way."}, {"startTime": "43.58", "endTime": "43.78", "role": "A", "text": "Yeah."}, {"startTime": "50.85", "endTime": "51.08", "role": "A", "text": "Yeah."}, {"startTime": "53.41", "endTime": "60.56", "role": "C", "text": "Okay , hang on , reply coming. Yeah , it's okay. U oh , I hate these things."}, {"startTime": "65.34", "endTime": "101.92", "role": "C", "text": "Voila. Okay. So Um we can maybe get a head start. Um have you been talking to Matthew about what you've been doing? Or Yeah."}, {"startTime": "104.38", "endTime": "104.96", "role": "C", "text": "Yeah , yeah."}, {"startTime": "111.69", "endTime": "133.22", "role": "A", "text": ". Um a little bit , but uh I'm m I'm not sure he knows uh everything. So uh basically uh well , first we tried to um explain why in this uh resc uh N_ best list re-scoring uh from the slides to enhance the speech recognition on the meetings data is not working. So um uh that's one thing. And uh so what we did with Alessandro is uh um ch t uh performing some statistical tests to see whatever r if the if the words uh the the appearance of the words during the meeting is uh in independent of the ap appearances of the different slides."}, {"startTime": "133.4", "endTime": "133.65", "role": "C", "text": "Yeah."}, {"startTime": "133.67", "endTime": "150.5", "role": "A", "text": "So the in the case if it is dependent that would mean that certain words tend to appear during certain slides and that there is a correlation and uh then there will be uh a reason like for believing that uh this will work."}, {"startTime": "140.75", "endTime": "143.49", "role": "C", "text": "Yeah , which was the intuitive feeling."}, {"startTime": "149.47", "endTime": "163.84", "role": "C", "text": "Yeah. Yeah. And is and the r result was no. But uh bu but the question is if is that result no because it's no or is it also just because there's not really enough data to be sure about anything?"}, {"startTime": "153.99", "endTime": "155.39", "role": "A", "text": "The resu the result was no."}, {"startTime": "170.95", "endTime": "171.29", "role": "C", "text": "Sure."}, {"startTime": "182.45", "endTime": "184.06", "role": "C", "text": "Yeah , okay. Yeah."}, {"startTime": "186.2", "endTime": "186.5", "role": "C", "text": "Yeah."}, {"startTime": "192.19", "endTime": "192.49", "role": "C", "text": "Yeah."}, {"startTime": "204.28", "endTime": "205.33", "role": "C", "text": "It's not gonna yeah."}, {"startTime": "212.29", "endTime": "213.91", "role": "C", "text": "Yeah. Yeah , yeah."}, {"startTime": "216.69", "endTime": "232.03", "role": "C", "text": "This is so sort of a feeling that we had but hadn't shown. I think I mean i in uh from uh from an application point of view it might be interesting to make sure that your vocabulary contains all the words on the slides. But from a research perspective it's not interesting."}, {"startTime": "225.48", "endTime": "225.69", "role": "B", "text": "Hmm."}, {"startTime": "232.31", "endTime": "243.28", "role": "B", "text": "You know , even if actually I remember I just made some measure uh saying okay l let's look at how many words I don't have in the dictionary and are in the slides. It was two percent."}, {"startTime": "240.83", "endTime": "241.66", "role": "C", "text": "There'd be very few."}, {"startTime": "242.28", "endTime": "244.44", "role": "A", "text": "Yeah , true. Yeah , almost nothing."}, {"startTime": "243.78", "endTime": "262.82", "role": "C", "text": "Well , this is h this is how the dictionary's calculated. It calculated such that if you don't have the word it doesn't affect to a great degree the the the word error rate. So Yeah."}, {"startTime": "246.55", "endTime": "247.89", "role": "D", "text": "Yeah."}, {"startTime": "246.59", "endTime": "246.93", "role": "A", "text": "Mm-hmm."}, {"startTime": "248.2", "endTime": "249.06", "role": "B", "text": "Exactly."}, {"startTime": "250.85", "endTime": "251.33", "role": "B", "text": "Exactly."}, {"startTime": "253.26", "endTime": "294.29", "role": "B", "text": "Exactly. So some in some sense it intuitively it sounds very good. But in practical terms , in terms of recognition uh here we we we have to be clear. If you want to improve the recognition , that im improves very slightly. Uh it is different if you want to have other tasks where the only words that all are words. In that case , even the slight improvements uh he gets at that point , they can make the difference. But does the recognition And some way the statistical independence I think it can be a good explanation to show why it is happen even if it is counterintuitive. But that's that's what happens basically."}, {"startTime": "253.98", "endTime": "254.21", "role": "A", "text": "Mm-hmm."}, {"startTime": "264.54", "endTime": "264.96", "role": "C", "text": "Sure."}, {"startTime": "266.72", "endTime": "266.94", "role": "C", "text": "Yep."}, {"startTime": "270.07", "endTime": "271.29", "role": "C", "text": "M like yeah."}, {"startTime": "274.64", "endTime": "275.01", "role": "C", "text": "Yeah."}, {"startTime": "277.33", "endTime": "277.66", "role": "C", "text": "Yeah."}, {"startTime": "280.44", "endTime": "285.12", "role": "C", "text": "But th yeah. No. Well , this is yeah. That's yeah."}, {"startTime": "290.53", "endTime": "290.78", "role": "C", "text": "Yeah."}, {"startTime": "294.22", "endTime": "348.93", "role": "A", "text": "Huh. So Matthew we were uh yeah , it's uh we were talking that we did some experiments to see if the word during meeting the words appear independently of the slides in a sense that uh if certain words tend to appear during certain slides or no. And uh the answer is uh no. And uh so we did a statistical test for that. And I will add also that we did that on the uh w the words after filtering them from the removing the the stop words. Yeah , so uh so uh bec s because yeah , with the stop words okay th there would be a reason for uh in independence because there is uh such a huge mess of them. But uh even uh after removing them uh there it it remains uh independent."}, {"startTime": "294.99", "endTime": "301.71", "role": "D", "text": "Could you ju just quickly rewind?"}, {"startTime": "297.97", "endTime": "300.51", "role": "C", "text": "Oh sorry about that. Yeah."}, {"startTime": "298.04", "endTime": "298.59", "role": "B", "text": "Yeah."}, {"startTime": "304.07", "endTime": "304.61", "role": "D", "text": "Yeah."}, {"startTime": "306.97", "endTime": "308.51", "role": "D", "text": "Okay. Oh."}, {"startTime": "311.84", "endTime": "312.56", "role": "D", "text": "Okay."}, {"startTime": "315.99", "endTime": "316.61", "role": "D", "text": "Okay."}, {"startTime": "319.64", "endTime": "319.73", "role": "D", "text": "Oh."}, {"startTime": "328.4", "endTime": "331.03", "role": "C", "text": "Of course. Yeah , yeah. Yep. 'Cause it's not gonna make any difference. Yep."}, {"startTime": "329.31", "endTime": "329.75", "role": "D", "text": "Okay."}, {"startTime": "330.25", "endTime": "330.53", "role": "B", "text": "Mm-hmm."}, {"startTime": "349.61", "endTime": "412.46", "role": "A", "text": "And actually uh so when I was doing the re-scoring experiments , I was doing that on uh one meeting that I selected as being like the best looking one. Uh it ha it had the m the most uh slides. And now I did the same uh on uh the other meetings which were available where well it's only three meetings because well here there are four of them which are from the test set uh from the AMI recogniser w but only three of them have uh slides. So it's total of three meetings and for the others the tendency and I c 'cause you know I was when I was doing re-scoring , I was uh taking into account the for one given slide also the n neighbouring slides. And as I was in increasing the number of slides which were affecting the the utterance I was re-scoring um the performance was improving sli s uh slightly. Very very little. But uh Yeah."}, {"startTime": "370.43", "endTime": "370.82", "role": "D", "text": "Mm-hmm."}, {"startTime": "378.24", "endTime": "378.46", "role": "C", "text": "Yep."}, {"startTime": "407.08", "endTime": "407.48", "role": "D", "text": "Mm-hmm."}, {"startTime": "410.07", "endTime": "442.21", "role": "D", "text": "No no. Wait wait. It's going very fast for me actually. thing actually. It's very fast. So wha first point the first thing you told me that you took the slides and you was and you had a l big dictionary and you are seeing uh what what are the inside the slide , right? Uh what the 'cause I first statement I could not understand. Uh when you said the the st uh uh the s uh the w yeah , so we what's so yeah , so could you please tell me little bit more in detail? Yeah."}, {"startTime": "429.87", "endTime": "438.65", "role": "A", "text": "Uh the the first thing we are talking about ex the experiment to see the uh if it's dependent or independent."}, {"startTime": "441.17", "endTime": "449.41", "role": "A", "text": "How we did it? Uh so we used the Pearson uh chi square uh test no."}, {"startTime": "448.28", "endTime": "465.34", "role": "D", "text": "No no no , don't go that. I I want the no , I want to understand what did you mean by the wo uh the te uh thing like saying that I took a dictionary and then a word from the slide and what you are looking for. I could not understand clearly clearly that."}, {"startTime": "463.64", "endTime": "554.46", "role": "A", "text": "Ah okay. It was to to see if uh certain words have a tendency to appear during uh uh they if they are more likely to appear during certain slides. W Hmm."}, {"startTime": "472.53", "endTime": "472.83", "role": "D", "text": "Mm mm-hmm."}, {"startTime": "478.16", "endTime": "486.79", "role": "D", "text": "Okay , but do how do why do you want certain words. Like wha how do you expect that certain words?"}, {"startTime": "482.16", "endTime": "519.9", "role": "B", "text": "Be be b be careful , it's not exactly this because for sure there are words that tend to be. So the point is you want to verify whether you can improve the recognition rate by using as an information the words that uh are contain in the slides. So basically the idea is that uh in the moment you are in the slide somewhere your language change accordingly to the slide. So the fact of having that information somewhere can help you to improve the recognition. But actually it's not what happens. And this does not happen for many reason. First , for example , fifty percent of the words in any kind of text are stop words. So are everywhere."}, {"startTime": "486.95", "endTime": "216.69", "role": "B", "text": ". Ye In my opinion it is no because of the nature of the language. I mean intuitively of course you tend to use more the words that are on the slide. , But the mass of the words actually you use are words that are common. Just think that fifty percent of the words on average whatever corpus you take are stop words , articles , et cetera. So in terms of recognition fifty percent goes away. Of the rest uh remaining fifty percent I mean are all words that appear one , two , three times. So in any case even if actually and they tend to be uh related or a statistically related to a single slide , in any case in terms of uh recognition do not help at all , or help a very little. So uh that's the kind of thing uh I mean that's the kind of measure , the ind statistical independence is not on single words. Is overall , which basically means in terms of recognition that doesn't help."}, {"startTime": "492.19", "endTime": "492.51", "role": "D", "text": "Yeah."}, {"startTime": "503.38", "endTime": "504.02", "role": "D", "text": "Exactly."}, {"startTime": "508.13", "endTime": "508.84", "role": "D", "text": "Exactly."}, {"startTime": "510.34", "endTime": "510.75", "role": "D", "text": "Yeah."}, {"startTime": "520.05", "endTime": "520.36", "role": "D", "text": "Yeah."}, {"startTime": "520.37", "endTime": "616.94", "role": "B", "text": "And the remaining a appear so little , that in the case cannot really improve that much. Most of the words we use actually whatever we talk about are common uh words. So how to verify this? I mean this is something that has been measured et cetera but still is a bit qualitative. To have a quantitative measure , mm-hmm , we simply did uh a measure of statistical independence between the words in general , so not some words , the words in general. Otherwise you can see that if a words appear once , basically it is one hundred percent related to one slide , huh? But you have to i if you want to consider in terms of recognition performance,you have to make it overall. I mean what is important is not the word that appear once , it's the word that appear If uh i exactly. If if there is one word that appear once all over the meeting , it appears in correspondence of one slide , then of course it seems to be very related. But very few words uh they represent a very little part of the word mass , mm. So we simply used a very old test , statistical test , that basically measure the hypothesis that some way the probability of having one word in correspondence of a certain slide is simply the product of the probability of the word for the probability of the. That's it. So that's what we did. But is in general the language and not certain words. Because certain words for sure have a strong dependency on the slides. But there are l few. Yeah."}, {"startTime": "529.5", "endTime": "530.0", "role": "D", "text": "Okay."}, {"startTime": "538.69", "endTime": "539.17", "role": "D", "text": "Mm-hmm."}, {"startTime": "543.49", "endTime": "543.89", "role": "D", "text": "Okay."}, {"startTime": "545.45", "endTime": "545.75", "role": "D", "text": "Mm-hmm."}, {"startTime": "547.87", "endTime": "548.13", "role": "D", "text": "Mm."}, {"startTime": "553.37", "endTime": "553.76", "role": "D", "text": "Yeah."}, {"startTime": "558.38", "endTime": "558.78", "role": "D", "text": "Mm-hmm."}, {"startTime": "562.9", "endTime": "573.71", "role": "D", "text": "Yeah. It appears in almost uh uh it is if it appears in all the slides it says a hundred percent correlation for me. One percent well. Yeah."}, {"startTime": "577.01", "endTime": "577.32", "role": "D", "text": "Yeah."}, {"startTime": "578.89", "endTime": "579.16", "role": "D", "text": "Yeah."}, {"startTime": "580.94", "endTime": "581.75", "role": "D", "text": "Are like that."}, {"startTime": "583.68", "endTime": "584.03", "role": "A", "text": "Mm-hmm."}, {"startTime": "584.06", "endTime": "584.48", "role": "D", "text": "Okay."}, {"startTime": "585.38", "endTime": "585.69", "role": "C", "text": "Hmm."}, {"startTime": "588.966", "endTime": "589.72", "role": "D", "text": ". Okay."}, {"startTime": "595.5", "endTime": "595.91", "role": "D", "text": "Mm-hmm."}, {"startTime": "598.61", "endTime": "599.06", "role": "D", "text": "Mm-hmm."}, {"startTime": "602.39", "endTime": "604.59", "role": "D", "text": "Okay , it's independent of each other. Okay."}, {"startTime": "606.26", "endTime": "625.68", "role": "D", "text": "Okay , fine , that's fine , that's uh uh uh s certain words it should. You have to Okay. Fine. Now I'm uh okay. I'm into the loop. Mm-hmm. Mm-hmm."}, {"startTime": "610.55", "endTime": "611.41", "role": "A", "text": "Mm-hmm. Yeah."}, {"startTime": "614.9", "endTime": "615.11", "role": "A", "text": "Yeah."}, {"startTime": "616.45", "endTime": "616.94", "role": "C", "text": "Yeah."}, {"startTime": "618.98", "endTime": "619.5", "role": "C", "text": "Hmm."}, {"startTime": "621.31", "endTime": "680.21", "role": "A", "text": "Yeah. And the answer to that was no. And s so when extending the those experiments to the other meetings uh when while I was observing an improvement on the first meeting I was using , uh so I was r observing an improvement as I was increasing um like the um the context. Yeah. Uh On the on the recognition , yeah. So there was uh the improvement was also increasing as I was increasing the context , while on the other meetings it's um it's it's it's really fluctuating and uh i it it uh it looks more like um uh ps uh well , what's the word for that? Statistical um um fluctuation."}, {"startTime": "644.73", "endTime": "645.43", "role": "D", "text": "Context."}, {"startTime": "647.2", "endTime": "651.79", "role": "D", "text": "But it is implemented on the A_S_R_? Or uh where? Okay."}, {"startTime": "656.05", "endTime": "656.51", "role": "D", "text": "Okay."}, {"startTime": "678.9", "endTime": "679.56", "role": "B", "text": "Fluctuations?"}, {"startTime": "679.66", "endTime": "681.0", "role": "D", "text": "Oh okay."}, {"startTime": "682.48", "endTime": "697.73", "role": "A", "text": "So uh Mm-hmm."}, {"startTime": "683.12", "endTime": "715.41", "role": "C", "text": "I mean the it's probably very dependent on the speaker as well. Some people have a habit of just reading what they've got on their slides and some people are com are are well , or or or quite purposefully talk about different things so that they've sort of got multi-modality of you know. But so I mean I guess that's not a surprising result then. The um Yeah."}, {"startTime": "685.99", "endTime": "686.36", "role": "D", "text": "Yeah."}, {"startTime": "690.92", "endTime": "697.32", "role": "D", "text": "Else interpolate , extrapolate. Yeah. Yeah."}, {"startTime": "695.68", "endTime": "695.94", "role": "B", "text": "Mm-hmm."}, {"startTime": "699.39", "endTime": "699.91", "role": "D", "text": "Uh yeah."}, {"startTime": "705.12", "endTime": "705.46", "role": "D", "text": "Yeah."}, {"startTime": "706.56", "endTime": "741.42", "role": "B", "text": "It is not in terms I mean for me for example it was not in the sense that uh after working a little bit on language you realise that this kind of thing do not help simply because most of the words uh have nothing to do specifically with the subject you use. Uh most of the words we use uh that's strange , but are simply necessary to build a sentence. There are very few uh content uh words. But it is true that intuitively uh as we are driven in our attention uh I mean in in our understanding we're pretty much driven by attention , that we tend to spot only those words."}, {"startTime": "717.97", "endTime": "718.25", "role": "C", "text": "Yeah."}, {"startTime": "722.36", "endTime": "725.68", "role": "C", "text": "S Yeah."}, {"startTime": "725.65", "endTime": "725.99", "role": "D", "text": "Yeah."}, {"startTime": "729.44", "endTime": "729.79", "role": "C", "text": "Yeah."}, {"startTime": "740.05", "endTime": "744.44", "role": "C", "text": "Yeah , sure. We s go straight to the semantics of the yep."}, {"startTime": "743.44", "endTime": "760.64", "role": "B", "text": "Exactly , and in some sense intuitively it seems that it can happen , I mean this is not the first attempt to do things like this and it never works actually i in terms of recognition. For other task it can be uh it can be uh helpful."}, {"startTime": "751.64", "endTime": "751.94", "role": "C", "text": "Hmm."}, {"startTime": "754.42", "endTime": "756.43", "role": "C", "text": "Yes. Maybe."}, {"startTime": "758.96", "endTime": "759.36", "role": "C", "text": "Okay."}, {"startTime": "761.84", "endTime": "762.7", "role": "C", "text": "Oh okay."}, {"startTime": "762.06", "endTime": "784.89", "role": "D", "text": "So you mea so uh you mean to say that um like when one case you were saying that if you include the context and all those thing it helps in your A_S_R_ improvement , but it doesn't , which more subjective I think this whole Yeah."}, {"startTime": "777.31", "endTime": "807.2", "role": "C", "text": "Well I mean uh it just comes down to the to the mere fact that word error rate is just take the words. How many of them did you get right. Take plus or minus two or three or five or ten words doesn't really make any difference. So yeah. Even if those words at the end of the day would be quite important in any sort of search of the transcript. But at the end of the day why wouldn't you just use the slides to search the transcript? I if you have th slides , then yeah."}, {"startTime": "787.1", "endTime": "787.97", "role": "D", "text": "Uh-huh. Yes."}, {"startTime": "789.54", "endTime": "789.8", "role": "B", "text": "Yeah."}, {"startTime": "789.87", "endTime": "790.23", "role": "D", "text": "Yeah."}, {"startTime": "790.08", "endTime": "790.21", "role": "A", "text": "Huh."}, {"startTime": "795.32", "endTime": "795.58", "role": "B", "text": "Yep."}, {"startTime": "795.7", "endTime": "796.08", "role": "A", "text": "Mm-hmm."}, {"startTime": "798.16", "endTime": "798.76", "role": "D", "text": "Mm."}, {"startTime": "798.19", "endTime": "798.65", "role": "A", "text": "Exactly."}, {"startTime": "803.36", "endTime": "805.14", "role": "D", "text": "Mm yeah , you can do that , yeah."}, {"startTime": "807.06", "endTime": "837.6", "role": "D", "text": "Or it could Mm."}, {"startTime": "808.12", "endTime": "839.32", "role": "A", "text": "So that's why um uh if we look on the relationship that uh exists between the speech and the slides , uh the task of improving the recognition , uh the overall um sp uh speech recognition using the slides uh seems to be uh uh not very uh um good. I mean um we cannot expect much from from it."}, {"startTime": "834.49", "endTime": "853.5", "role": "C", "text": "No. Y you'd ju I mean the uh I mean it so I mean have you been doing other things then? Have you have you been thinking about what you would like to to do in in in place of this? Or or or leading on from this , given what you've learnt?"}, {"startTime": "854.15", "endTime": "913.79", "role": "A", "text": "Mm well for now the uh most effort was uh on uh um showing why i it's i it's it will not work. Especially those experiments and these uh statistical tests. But uh we w were thinking for example of a task like um trying to uh see if uh where a speaker is talking I mean if the speech is actually correlated with the slides uh where the slides uh which happen during the not correlated , but if the Uh well if the um If the speaker is actually talking about what is in the slides or not."}, {"startTime": "870.39", "endTime": "870.73", "role": "D", "text": "Mm-hmm."}, {"startTime": "896.49", "endTime": "903.47", "role": "B", "text": "Be careful. Correlate is a dangerous word in statistic. It seems to be the opposite as before."}, {"startTime": "899.35", "endTime": "904.07", "role": "C", "text": "'Cause ours is strict. Yeah. Yeah."}, {"startTime": "907.75", "endTime": "909.26", "role": "C", "text": "Associated?"}, {"startTime": "911.73", "endTime": "912.21", "role": "B", "text": "The."}, {"startTime": "912.68", "endTime": "913.15", "role": "D", "text": "Mm-hmm."}, {"startTime": "914.51", "endTime": "914.95", "role": "D", "text": "Okay."}, {"startTime": "916.98", "endTime": "960.65", "role": "B", "text": "Or roughly. Basically uh one thing it can't be done. And and here uh on the contrary for example the few words that are mm how may I say it recognized more can really make the difference. It isn't the case if you want to see if uh I mean what if seen in the meeting and that okay. There are presentation. Then yeah , still the slide is there. But actually the people talk about other things. Or not really other things but the slide is no longer uh a support for the discussion , huh? There are moment that actually this is the support because the people describe , et cetera. And there are moment where it is not. Is a just a background uh thing. And we rough estimated very quickly. But it was one third of the time. At least in in the meeting we have seen."}, {"startTime": "927.4", "endTime": "927.77", "role": "C", "text": "Yeah."}, {"startTime": "941.17", "endTime": "941.76", "role": "C", "text": "Sure."}, {"startTime": "944.64", "endTime": "947.38", "role": "C", "text": "The focus. Yeah , okay."}, {"startTime": "954.72", "endTime": "954.98", "role": "C", "text": "Yep."}, {"startTime": "961.22", "endTime": "998.6", "role": "B", "text": "The slide were just there I mean but they were no longer use as a support. It was a discussion rather between people. So in that case the presence or the absence and especially the frequence with which you observe the words that are on the slides can be an excellent uh uh clue , huh. Indication , a clear indication , whether actually does it support of the discussion or not. Uh It can be this. It can be interpreted as a kind of focus of interest. It can be simply interpreted in the sense of saying uh okay I mean you have this channel open there. Do I have to p taken into account or not?"}, {"startTime": "965.62", "endTime": "966.05", "role": "C", "text": "Okay."}, {"startTime": "978.6", "endTime": "979.29", "role": "A", "text": "Indicator."}, {"startTime": "984.37", "endTime": "987.05", "role": "C", "text": "M meeting action sort of focus."}, {"startTime": "996.31", "endTime": "996.53", "role": "C", "text": "Yep."}, {"startTime": "999.39", "endTime": "999.61", "role": "C", "text": "Hmm."}, {"startTime": "999.69", "endTime": "1036.36", "role": "B", "text": "Or also in terms of action , yeah uh when you see that s the discussion is completely m disconnected with respect to this some way uh it means that it's happen in something different than before. So I mean it's a kind of feature that in my opinion can be easy to detect it and um that can , yeah , uh f can be interesting to do. Relatively easy to do. And uh in that case , for example , the few words mm that you that you get more can make the difference. Oh so is that mm double way to to show how some way dependent on the task."}, {"startTime": "1006.61", "endTime": "1006.87", "role": "C", "text": "Yeah."}, {"startTime": "1011.72", "endTime": "1012.05", "role": "C", "text": "Yep."}, {"startTime": "1021.33", "endTime": "1021.59", "role": "C", "text": "Yeah."}, {"startTime": "1027.6", "endTime": "1028.12", "role": "C", "text": "Yeah , sure."}, {"startTime": "1029.9", "endTime": "1030.24", "role": "C", "text": "Yeah."}, {"startTime": "1037.54", "endTime": "1053.9", "role": "D", "text": "So you so you so okay. So maybe like it can be uh something like in a meeting it can be like an unusual scenario for you , in a presentation with a slide. And the unusual scenario that you're not using the uh slide at all."}, {"startTime": "1049.05", "endTime": "1063.15", "role": "C", "text": "W Well Yeah."}, {"startTime": "1053.94", "endTime": "1073.83", "role": "A", "text": "Yeah , or for example uh what happened for example in one of the meetings is that p people were um summarizing the the results of the previous meeting , you know. So in the beginning so the meeting started with the summary of what happened uh previous time and this was not related to what was on the slides."}, {"startTime": "1063.13", "endTime": "1063.42", "role": "D", "text": "Mm-hmm."}, {"startTime": "1071.02", "endTime": "1071.28", "role": "D", "text": "Yeah."}, {"startTime": "1072.89", "endTime": "1074.67", "role": "D", "text": "What are the other slide , yeah."}, {"startTime": "1073.7", "endTime": "1118.42", "role": "C", "text": "Ye yeah , okay. So I mean uh you could begin with s saying the a um the simple task of just determining whether or not the speech is related to the slide content , and which is sort of building upon what , you know , Dong and others have worked on in terms of , you know , is it discussion , monologue , from the original M_ four data collection. Uh a y are are you also considering that you could actually look at the relationship between meetings for instance? Um well okay , well I mean it if if if these similar sort of phrases or words were discussed in this meeting and were also discussed in the previous meeting , then you sort of have a a link between meetings for instance."}, {"startTime": "1102.91", "endTime": "1104.19", "role": "B", "text": "What do you mean exactly?"}, {"startTime": "1112.52", "endTime": "1113.06", "role": "B", "text": "Mm-hmm."}, {"startTime": "1115.9", "endTime": "1123.58", "role": "A", "text": "Link uh But this is one yeah."}, {"startTime": "1118.1", "endTime": "1121.65", "role": "B", "text": "Yeah. Some way well there are f yeah yeah yeah yeah yeah."}, {"startTime": "1119.67", "endTime": "1140.1", "role": "C", "text": "I don't know I don't know how this you have to ches the check the statistics. But I I mean 'cause obviously you've gotta think towards what , you know , this this won't occupy ab ab you know , won't occupy you for three years or whatever just on this I guess. But have to look at all the future and so just a s Yeah , yeah."}, {"startTime": "1126.85", "endTime": "1127.12", "role": "B", "text": "Yeah."}, {"startTime": "1132.7", "endTime": "1184.17", "role": "B", "text": "Mm-hmm hmm. Yeah , I know , this we are s s talking about today short term if you want. Uh things just to the use the things. I mean all the work they that has done basically , which is a huge work. And the data we have then uh enough for the for a thesis of course it must be much better. But of course the there's only two two different kinds of words. Some of them you can do it on a single meeting. So this kind of feature extraction because basically that's what it is , saying yes no this channel is good. Now is background. Now is foreground , et cetera. You can put it in that in that way. This you do it on a single meeting. And then there are corpus um based um how may I say it works so yeah , that is one possibility for example , finding the connection between different meetings."}, {"startTime": "1133.17", "endTime": "1133.43", "role": "A", "text": "Huh."}, {"startTime": "1139.43", "endTime": "1139.75", "role": "A", "text": "Mm-hmm."}, {"startTime": "1143.45", "endTime": "1143.79", "role": "C", "text": "Okay."}, {"startTime": "1143.86", "endTime": "1146.19", "role": "A", "text": "Yeah , it was recycling uh kind of."}, {"startTime": "1147.5", "endTime": "1147.78", "role": "C", "text": "Yeah."}, {"startTime": "1166.78", "endTime": "1167.48", "role": "C", "text": "Yeah , okay."}, {"startTime": "1170.99", "endTime": "1171.3", "role": "C", "text": "Yeah."}, {"startTime": "1175.0", "endTime": "1177.88", "role": "C", "text": "and yep. Yep."}, {"startTime": "1175.81", "endTime": "1176.19", "role": "A", "text": "Task."}, {"startTime": "1184.85", "endTime": "1239.91", "role": "B", "text": "Then I don't know , I mean at that point it becomes pretty much crucial the kind of uh data you have in the sense that for the way we have collected the data some way I don't know if it can be at the same time too easy in the sense that some way you have little groups of meetings extremely correlated. So I mean it it makes it easier. I mean I don't know how much significant can be at that level. It can be I in a sense , if you want uh this kind of words become interesting when the corpus is really big uh uh when when you when you consider each meeting as a single item. So it's interesting when you have tens , hundreds , thousands of meetings , which is not the case. But I mean you can do other work if you consider in terms of speaker turns or in terms of slides , and that is immediately multiply."}, {"startTime": "1190.58", "endTime": "1190.93", "role": "C", "text": "Yeah."}, {"startTime": "1197.89", "endTime": "1198.95", "role": "C", "text": "Well y yeah."}, {"startTime": "1202.46", "endTime": "1202.81", "role": "C", "text": "Sure."}, {"startTime": "1207.28", "endTime": "1207.49", "role": "C", "text": "Yeah."}, {"startTime": "1210.23", "endTime": "1217.02", "role": "C", "text": "Yeah. I mean uh it's it's and because we don't have all the data collected or annotated yet , it's it's very difficult to know , isn't it."}, {"startTime": "1223.43", "endTime": "1224.55", "role": "C", "text": "Yeah. Yep , yep , yep."}, {"startTime": "1231.69", "endTime": "1231.91", "role": "C", "text": "Hmm."}, {"startTime": "1237.65", "endTime": "1248.31", "role": "C", "text": "Yeah , sure. Or b or as you say , back-channel versus yeah. 'Cause I th think that's quite interesting. I mean 'cause it's an awful lot of speech activity , which is yeah."}, {"startTime": "1242.17", "endTime": "1263.72", "role": "B", "text": "Yeah. Yep , yep. That is another So it can be one more feature that helps in but it is very short-term. I mean just uh well it is ju just few few few times we talk together and it was just , mean , the very quick thing you can can have uh like this."}, {"startTime": "1243.28", "endTime": "1243.54", "role": "A", "text": "Huh."}, {"startTime": "1245.23", "endTime": "1245.44", "role": "A", "text": "Huh."}, {"startTime": "1245.92", "endTime": "1256.43", "role": "A", "text": "Even summarization. Or Mm-hmm. Mm yeah."}, {"startTime": "1255.12", "endTime": "1255.44", "role": "C", "text": "Sure."}, {"startTime": "1259.58", "endTime": "1259.97", "role": "C", "text": "Okay."}, {"startTime": "1264.0", "endTime": "1353.4", "role": "C", "text": "Okay. So I mean as far as that you've got everything to do that , I presume. Um you don't need any extra stuff from us in the immediate future? Or I mean that's good. That's good. But I mean it it Uh yeah I wouldn't get too distracted I guess on d d if you've got two tracks , I'd like to Yeah. Um Yeah."}, {"startTime": "1272.62", "endTime": "1307.51", "role": "A", "text": "Uh no. No. But for the other thing , you know uh uh the alternative measures. Or maybe we should finish with this first. Uh I mean uh Yeah , this uh this would be a f uh another subject I would like to discuss. S but uh w but uh uh basically ju just , you know , if we finish uh discussing this first."}, {"startTime": "1276.33", "endTime": "1278.37", "role": "D", "text": "We have plenty of things to do."}, {"startTime": "1285.94", "endTime": "1286.32", "role": "D", "text": "What track?"}, {"startTime": "1300.28", "endTime": "1301.81", "role": "D", "text": "Yeah. Go on. Yeah , it's no problem."}, {"startTime": "1307.55", "endTime": "1319.82", "role": "D", "text": "Okay. So uh well so ultimately now the next step what is that? Because I want like kind of a uh so at first you said that okay now you did this."}, {"startTime": "1321.18", "endTime": "1338.11", "role": "D", "text": "This correlation studies. And they show that there's a very less correlation or in fact no correlation kind of thing. And uh um uh so uh so what next in on top of it what you are going to build I mean is the question now."}, {"startTime": "1328.44", "endTime": "1328.87", "role": "B", "text": "Mm-hmm."}, {"startTime": "1328.53", "endTime": "1329.01", "role": "A", "text": "Mm-hmm."}, {"startTime": "1339.96", "endTime": "1352.76", "role": "B", "text": "But I think in a sense in my opinion well there are two things. When this uh statistical test it can be we have made an experiment we get a result somewhat counter-intuitive we give an explanation."}, {"startTime": "1348.34", "endTime": "1348.55", "role": "D", "text": "Mm."}, {"startTime": "1353.58", "endTime": "1353.84", "role": "D", "text": "Yeah."}, {"startTime": "1354.52", "endTime": "1378.05", "role": "B", "text": "And uh that's it. I mean that's that's something that some way closes here. So when it gives you the kind of answer you get is that okay to go in that in that direction maybe is not the best thing. Maybe to improve the recognition that way is not uh something you can expect. So it gives the possibility to decide to go uh in a different direction that can be more on this uh let's say."}, {"startTime": "1364.04", "endTime": "1364.4", "role": "D", "text": "Mm-hmm."}, {"startTime": "1377.31", "endTime": "1386.02", "role": "D", "text": "Yeah , so t I mean to the different direction now that's what I mean to say. What you like to take from there. Uh it's not defined yet , okay."}, {"startTime": "1382.72", "endTime": "1384.35", "role": "A", "text": "This is not clearly defined yet."}, {"startTime": "1383.53", "endTime": "1385.4", "role": "B", "text": "This is Hmm."}, {"startTime": "1386.76", "endTime": "1397.6", "role": "A", "text": "But uh um something um using this relationship uh between the slides uh and other even other tek textual support and the uh and the speech."}, {"startTime": "1398.1", "endTime": "1398.5", "role": "D", "text": "Mm-hmm."}, {"startTime": "1399.43", "endTime": "1399.69", "role": "C", "text": "Hmm."}, {"startTime": "1399.92", "endTime": "1407.06", "role": "D", "text": "But what kind of problem? We need a definition of some kind of uh problem , right? Uh yeah."}, {"startTime": "1402.2", "endTime": "1431.96", "role": "C", "text": "But I And uh the k and the question is also are there other sort of more sensible ways of doing it. For instance um gaze tracking. I mean if if people are looking at the slides Yeah , sure. And it has specific to the environment and all that sort of thing. Yeah."}, {"startTime": "1410.908", "endTime": "1413.49", "role": "D", "text": ". Yeah."}, {"startTime": "1415.48", "endTime": "1415.9", "role": "B", "text": "Mm-hmm hmm."}, {"startTime": "1417.66", "endTime": "1459.03", "role": "B", "text": "Well uh I think the advantage eventually w I mean the advantage with this kind of things is that are much easier. Gaze tracking is still Just with the environment is a difficult thing. I mean it requires cameras with pretty good quality , et cetera. Uh but I think his question is more uh general. A and it says so I mean based on this work , do you figure out uh a direction if they guess correctly. Uh a domain , a direction for your thesis for your exactly. Exactly. Exactly. Exactly. Exactly."}, {"startTime": "1428.94", "endTime": "1431.38", "role": "D", "text": "No , no , no."}, {"startTime": "1436.74", "endTime": "1437.08", "role": "C", "text": "Yeah."}, {"startTime": "1436.75", "endTime": "1512.86", "role": "D", "text": "No but yeah , direction. Yeah , that's that is a thing. We go on to the next direction. It should not that i it should not happen that you're doing so many things and ultimately it doesn't goes into a thesis. The that's that should not the problem. Your thesis should be w in one direction. One problem. And uh should go uh in one or uh one d yeah. It it doesn't make sense. Uh the it may be good as a C_V_ for you , but then as a thesis you will have problems uh defending it and all those things. So what is that uh what would be the next possible direction you want to take. Uh Error measure."}, {"startTime": "1440.87", "endTime": "1441.28", "role": "C", "text": "Yeah."}, {"startTime": "1447.25", "endTime": "1447.42", "role": "A", "text": "Huh."}, {"startTime": "1457.15", "endTime": "1457.46", "role": "A", "text": "Mm-hmm."}, {"startTime": "1462.29", "endTime": "1462.67", "role": "A", "text": "Mm-hmm."}, {"startTime": "1464.61", "endTime": "1529.87", "role": "B", "text": "One domain , yeah. Not a collection of little uh things completely unrelated. But uh That's very Mm-hmm."}, {"startTime": "1476.12", "endTime": "1477.09", "role": "A", "text": "Mm-hmm. Yeah , sure."}, {"startTime": "1488.39", "endTime": "1498.95", "role": "A", "text": "Well , this is um the question I'm working on."}, {"startTime": "1499.81", "endTime": "1545.62", "role": "C", "text": "Mm. Uh but I mean for instance it should be linked to the other stuff that you've been doing on um call routing for instance. And and um , you know , uh error merit err error measures , yes. I mean I think I mean I I think that it's possible to draw some sort of relationship between the two , as we were saying. I mean maybe if you you don't measure things in terms of word error rate , maybe this sort of information does actually mean something. Given that fifty percent of the words are not actually interesting. Um so I mean W Well w uh w No , it doesn't solve the problem , but it's f what is it? Yeah."}, {"startTime": "1519.91", "endTime": "1520.32", "role": "A", "text": "Mm-hmm."}, {"startTime": "1526.95", "endTime": "1528.0", "role": "A", "text": "Mm-hmm. Mm yeah."}, {"startTime": "1531.99", "endTime": "1532.21", "role": "B", "text": "Yeah."}, {"startTime": "1535.02", "endTime": "1543.78", "role": "A", "text": "Yeah , that that could be interesting to try to merge those two uh things. Uh yeah. Yeah."}, {"startTime": "1539.95", "endTime": "1560.76", "role": "B", "text": "M but still doesn't solve the problem of saying what I yeah yeah , sure sure. What I what you are going to do for your thesis. I mean as Herve said , I mean basically if you have to explain in four lines what will be the topic of my thesis , the subject of my thesis."}, {"startTime": "1541.86", "endTime": "1543.2", "role": "D", "text": "It's yeah."}, {"startTime": "1550.07", "endTime": "1550.43", "role": "A", "text": "Mm-hmm."}, {"startTime": "1555.29", "endTime": "1556.36", "role": "D", "text": "Yeah , exactly."}, {"startTime": "1561.04", "endTime": "1562.7", "role": "A", "text": "Mm-hmm. Yeah."}, {"startTime": "1562.43", "endTime": "1576.96", "role": "B", "text": "And it is something that is not just saying I'm going to do uh this this this and that. I mean because this we actually don't know. But yeah , in a very broad sense I mean w what you're going to investigate , what kind of uh If I interpret correctly."}, {"startTime": "1565.35", "endTime": "1565.49", "role": "D", "text": "Mm."}, {"startTime": "1572.55", "endTime": "1626.51", "role": "A", "text": "Yeah , and I um uh Are they are interested in that or no?"}, {"startTime": "1574.23", "endTime": "1623.69", "role": "D", "text": "S see that is going to tell us uh something like uh wha the thing is that i uh it it see you can totally go into the text domain and be there , you know? It can be s no problem. But as long as uh it is okay. But if you want to do with uh s like certain something with the speed and all those things together then it's a different scenario. Uh you may not want to work on all the problems. Someone may work on some other problem. But then you you make use of that to extend your work in some. And uh and as I also t it depends like also like I think if uh boss is interested in working in both speech and text , you can understand very well. That part is also there."}, {"startTime": "1598.13", "endTime": "1598.38", "role": "C", "text": "Hmm."}, {"startTime": "1622.79", "endTime": "1623.11", "role": "C", "text": "Sure."}, {"startTime": "1625.88", "endTime": "1636.26", "role": "D", "text": "No , the boss. Like have a it's like instead of saying like you should like work on both side , you know , the text and the speech aspect of it. So yeah."}, {"startTime": "1635.92", "endTime": "1653.98", "role": "B", "text": "Then uh one basic thing I suggested even thinking about I mean is exactly this stru all these scenarios that can be a meeting , that can be presentation where you have a s a relationship between speech , between things that are said and uh some textual documents some way."}, {"startTime": "1646.18", "endTime": "1646.5", "role": "D", "text": "Yeah."}, {"startTime": "1656.45", "endTime": "1682.46", "role": "B", "text": "Why not try to to to to study this relationship , to improve this relationship , to use this relationship for um mm whatever it is , indexing or annotation or whatever , meta-data extraction. And if you want for example this little work uh about seeing when the slide channel is background and foreground is not beginning of this kind of thing. So a relationship between two channel that provide some kind of information."}, {"startTime": "1659.13", "endTime": "1659.41", "role": "A", "text": "Mm-hmm."}, {"startTime": "1659.59", "endTime": "1659.93", "role": "D", "text": "Yeah."}, {"startTime": "1675.87", "endTime": "1676.29", "role": "C", "text": "Mm."}, {"startTime": "1676.72", "endTime": "1677.02", "role": "D", "text": "Yeah."}, {"startTime": "1679.9", "endTime": "1680.25", "role": "D", "text": "Yeah."}, {"startTime": "1679.93", "endTime": "1680.32", "role": "C", "text": "Yeah."}, {"startTime": "1682.51", "endTime": "1701.29", "role": "C", "text": "I think I think it's maybe an interesting test scenario and we know that you're sort of basing something around speech and and text. I think there needs to be one sort of extra higher goal above that so that you can motivate future research."}, {"startTime": "1692.73", "endTime": "1693.01", "role": "A", "text": "Mm-hmm."}, {"startTime": "1697.55", "endTime": "1700.82", "role": "A", "text": "Mm-hmm , yep. Yeah , that's what what is missing."}, {"startTime": "1698.64", "endTime": "1702.69", "role": "B", "text": "Mm-hmm. Sure. Sure. Sure , sure , sure , sure."}, {"startTime": "1702.52", "endTime": "1735.75", "role": "D", "text": "Uh w one thing interesting is what we came up in the discussion also you about telling that uh detecting such scenarios where there is no relation between the slide and the person talking , that may be one good starting point for you actually. And then at that point y uh you detect something like that and then you show something like uh what you are saying that i if there is uh if uh there i if it is out of discussion , the words are no way are going to help your recognition anyway , A_S_R_."}, {"startTime": "1710.43", "endTime": "1710.93", "role": "B", "text": "Mm-hmm."}, {"startTime": "1716.96", "endTime": "1717.28", "role": "A", "text": "Mm-hmm."}, {"startTime": "1736.23", "endTime": "1762.87", "role": "D", "text": "But if it is more on the um the slide information is not going to help you. But uh if it is uh if it is related to the sli what he is giving a presentation on the slide then you show the your A_S_R_ if you detect this even then you can show that how where you can really help or not help. Because you say there's no correlation now. But then here it comes that there at some point there might be a correlation there."}, {"startTime": "1758.35", "endTime": "1758.74", "role": "A", "text": "Mm-hmm."}, {"startTime": "1762.34", "endTime": "1802.92", "role": "B", "text": "No no , be careful. For the recognition in general there is no correlation in the sense that even if you're talking about what is on the slide , most of the words you use most of the words you use are not really correlated to that. Are simply words. And consider also that we all speak English here. And apart of uh native English speakers we have a very limited vocabulary in general. So we tend to use always the same words. But on average , you know , linguistic research shows that on average the people use five hundred words. That's what we have a disposition. And we say everything uh yeah. We say everything with that. And probably we , not a native English speaker , we use even less."}, {"startTime": "1765.83", "endTime": "1766.18", "role": "D", "text": "Mm-hmm."}, {"startTime": "1773.85", "endTime": "1778.4", "role": "C", "text": "Hmm Yeah."}, {"startTime": "1773.91", "endTime": "1774.42", "role": "D", "text": "Mm-hmm."}, {"startTime": "1781.39", "endTime": "1781.78", "role": "D", "text": "Yeah."}, {"startTime": "1785.53", "endTime": "1786.01", "role": "D", "text": "Yeah."}, {"startTime": "1786.34", "endTime": "1797.4", "role": "C", "text": "Yeah , this was Yeah. For English it's especially low. Yeah."}, {"startTime": "1794.63", "endTime": "1796.06", "role": "D", "text": "So okay."}, {"startTime": "1800.111", "endTime": "1812.14", "role": "D", "text": ". Mm-hmm."}, {"startTime": "1803.32", "endTime": "1851.09", "role": "B", "text": "So that's gives an idea of why basically in terms of recognition it doesn't really help because you always use anyway the same words. And a few occurrences of words that are there in terms of recognition make one , two percent. So maybe it's not enough to justify uh an effort to improve the recognition. Then you can change of task and use a task , the task we were mentioning about the back channel or foreground channel. In that case the only words that really are important are those words that appear on both slides. At that point , I mean , a little improvement of that , it becomes a big improvement. I mean maybe in terms of recognition it's zero point five percent. But in terms of that task is maybe twenty percent."}, {"startTime": "1811.43", "endTime": "1811.67", "role": "C", "text": "Yeah."}, {"startTime": "1817.71", "endTime": "1818.11", "role": "D", "text": "Mm."}, {"startTime": "1821.08", "endTime": "1821.44", "role": "D", "text": "Oh."}, {"startTime": "1823.3", "endTime": "1837.55", "role": "C", "text": "Speci Yeah."}, {"startTime": "1823.75", "endTime": "1824.09", "role": "D", "text": "Mm-hmm."}, {"startTime": "1825.58", "endTime": "1825.98", "role": "D", "text": "Okay."}, {"startTime": "1829.99", "endTime": "1830.34", "role": "D", "text": "Mm-hmm."}, {"startTime": "1832.55", "endTime": "1832.91", "role": "D", "text": "Mm-hmm."}, {"startTime": "1835.97", "endTime": "1837.56", "role": "D", "text": "The th sides and the talk."}, {"startTime": "1843.87", "endTime": "1844.4", "role": "D", "text": "Yeah."}, {"startTime": "1847.06", "endTime": "1847.45", "role": "D", "text": "Yeah."}, {"startTime": "1850.93", "endTime": "1874.18", "role": "C", "text": "Yeah. Well another thing you have to remember is these models have been tuned to include AMI data. So I mean perhaps if you had slides and and presentations to do with something that was off topic , you didn't have you hadn't seen any prior data , then you might see a bigger contribution as well. But I mean essentially you've actually sort of included the information from the slides in the language model."}, {"startTime": "1851.39", "endTime": "1851.8", "role": "D", "text": "Okay."}, {"startTime": "1858.03", "endTime": "1858.31", "role": "D", "text": "Yeah."}, {"startTime": "1865.03", "endTime": "1866.08", "role": "D", "text": "Like another mic."}, {"startTime": "1866.44", "endTime": "1866.63", "role": "B", "text": "Yeah."}, {"startTime": "1866.74", "endTime": "1866.96", "role": "A", "text": "Mm-hmm."}, {"startTime": "1869.72", "endTime": "1869.93", "role": "B", "text": "Yeah."}, {"startTime": "1873.993", "endTime": "1890.1", "role": "A", "text": ". Mm-hmm."}, {"startTime": "1874.34", "endTime": "1886.43", "role": "B", "text": "That's another interesting point. I mean we are using data that are fake. Any uh in any case they are simulation , no real data. And especially the slides. I think I've seen those slides. I mean they are pretty much artificial."}, {"startTime": "1881.68", "endTime": "1881.97", "role": "C", "text": "Yeah."}, {"startTime": "1886.57", "endTime": "1890.23", "role": "C", "text": "Okay. Okay , they're pre pre prepared. Okay."}, {"startTime": "1889.14", "endTime": "1966.16", "role": "B", "text": "Exactly. But but not pre-prepare. But Yeah , but Yeah , I yeah , I mean uh everything is pretty much artificial. That that's what I mean. So you mention for example this uh fact that sometimes uh speakers tend to read. This is especially true when you have bullet list , huh. Sometimes people really go through. It didn't happen in the data simply because uh uh it was not the same people prepa uh exactly. Ah? So for example it will be possible in any case because the Herve's infrastructure is ready and now we are going to collect the presentation. There maybe we can see The audio is is is very bad. I I thing is really You know , that was collected m a little bit like this without uh too much care. It was it was uh a personal effort of Mael that decided to do it. It was really good to do it. It was very good. But basically it was made without any specific um,you know , without thinking we want to recognize , just to have them. So the especially the audio channel is absolutely awful."}, {"startTime": "1889.29", "endTime": "1901.32", "role": "D", "text": "Th yeah , most of the most of the time you have the title to do , no. The AMI dat the AMI data what that like that only most of the time you knew they had the word. The word you are going to present. Everyone is presenting the same set of slide."}, {"startTime": "1901.55", "endTime": "1901.73", "role": "A", "text": "Uh-huh."}, {"startTime": "1904.59", "endTime": "1904.96", "role": "D", "text": "Yeah."}, {"startTime": "1910.05", "endTime": "1910.81", "role": "C", "text": "Yeah , yeah."}, {"startTime": "1918.53", "endTime": "1923.51", "role": "C", "text": "It's not there. Okay."}, {"startTime": "1930.46", "endTime": "1941.02", "role": "D", "text": "What about M_L_M_I_? W the one we collected last year. Audio is very bad , right? Yeah. uh one single channel or at least a closed channel collection , no."}, {"startTime": "1932.55", "endTime": "1937.48", "role": "C", "text": "Y the audio quality though. Yeah. Yeah."}, {"startTime": "1947.88", "endTime": "1948.97", "role": "D", "text": "Okay , okay , okay."}, {"startTime": "1951.8", "endTime": "1957.96", "role": "D", "text": "It was good. Tha tha tha that Uh okay."}, {"startTime": "1952.73", "endTime": "1953.82", "role": "C", "text": "Was good to yeah."}, {"startTime": "1964.66", "endTime": "1965.03", "role": "C", "text": "Yeah."}, {"startTime": "1965.4", "endTime": "1979.72", "role": "D", "text": "So they are is there are still using that uh desktop microphone or what over there. Or Uh Ah."}, {"startTime": "1969.38", "endTime": "2043.99", "role": "C", "text": "Ah. Yeah , they had like uh y uh y they , you know , they had this set-up with the uh the microphones. So someone every it there was one microphone shared between every two people. But they had deals with people forgetting to turn the microphone on , forgetting to turn it off , uh f it was it was meant I think they they chose that lecture theatre possibly with the idea that it would be good for collecting data. I mean I uh I'm sure they could have probably had University of Edinburgh host it or whatever. But I th I think the , you know , the H_C_I_ part of it didn't quite work out to how they planned. So ap Yeah. Um it is I mean it's same as us putting on a the headphones and whatever. I mean even that minor thing. I mean any any audio captured during that period is i is rubbish. But there's no sort of system that's really built to d to be able to say when you're you're capturing that."}, {"startTime": "1992.28", "endTime": "1992.65", "role": "B", "text": "Mm-hmm."}, {"startTime": "2002.5", "endTime": "2002.92", "role": "D", "text": "Okay."}, {"startTime": "2002.83", "endTime": "2003.66", "role": "B", "text": "Yeah."}, {"startTime": "2004.58", "endTime": "2006.21", "role": "D", "text": "Okay. That's fine , yeah."}, {"startTime": "2005.8", "endTime": "2037.71", "role": "B", "text": "Uh that's uh that's that is one of the reason for example why which uh mark we point pretty much on slides as a mean of indexing. Because at that point there is no interaction between humans and capture. Because whenever you have microphones that you have to move , it's it's it becomes complete uh really Yeah."}, {"startTime": "2018.09", "endTime": "2018.54", "role": "D", "text": "Yeah."}, {"startTime": "2023.02", "endTime": "2055.83", "role": "D", "text": "It's a. Yeah it's a Yeah , I understand. Okay , so now there be uh would be some time wh what is we should be getting a time recording system , right? That uh uh uh so Mm."}, {"startTime": "2049.17", "endTime": "2057.74", "role": "B", "text": "We are building this slowly. I mean it's it's unfortunate. I mean is is is taking time for the material and so on. But yeah. There will be this."}, {"startTime": "2054.05", "endTime": "2054.46", "role": "C", "text": "Okay."}, {"startTime": "2056.24", "endTime": "2069.39", "role": "C", "text": "The Uh what will that incorporate? Will it incorporate like uh an S_M_A_ and uh Yep."}, {"startTime": "2057.86", "endTime": "2058.4", "role": "D", "text": "Okay."}, {"startTime": "2062.84", "endTime": "2083.87", "role": "B", "text": "Uh it will be one camera pointing very general but just for display purposes essentially. One uh microphone. And we are thinking to use uh lapel microphone , you know , this this thing. And so that potentially helpful hopefully helpful to to do recognition. And to slides through the projector."}, {"startTime": "2074.35", "endTime": "2074.97", "role": "D", "text": "Lapel."}, {"startTime": "2075.04", "endTime": "2075.38", "role": "C", "text": "Okay."}, {"startTime": "2079.88", "endTime": "2080.73", "role": "D", "text": "Should be okay."}, {"startTime": "2081.26", "endTime": "2082.78", "role": "C", "text": "Yeah. Okay."}, {"startTime": "2084.37", "endTime": "2093.39", "role": "C", "text": "Okay. So no no uh microphone arrays or anything like that. I guess that's quite a that's a quite a bi big deal for setting up the recordings , I guess."}, {"startTime": "2089.93", "endTime": "2122.51", "role": "B", "text": "Wo Let's say that uh in any case uh w well there are two reason. First of all we are trying to do something that can be easily the the the idea is really it's something that you take you bring somewhere else and it works. So it must be as easy as possible. But in any case I mean the device we are doing has input channels. So some way you can add as many input as we want. So we are dealing now with three. But there are other input uh lines open."}, {"startTime": "2093.17", "endTime": "2097.03", "role": "D", "text": "No , it it's it's uh quite a bit , yeah , problem , to do that kind of thing."}, {"startTime": "2105.29", "endTime": "2105.5", "role": "D", "text": "Yeah."}, {"startTime": "2105.32", "endTime": "2107.21", "role": "C", "text": "Yeah. Yep."}, {"startTime": "2115.47", "endTime": "2116.27", "role": "C", "text": "As you want , yep."}, {"startTime": "2119.88", "endTime": "2120.49", "role": "D", "text": "Mm."}, {"startTime": "2121.97", "endTime": "2122.38", "role": "C", "text": "Okay."}, {"startTime": "2122.83", "endTime": "2147.66", "role": "D", "text": "Yeah , but probably we were the f you know , the post uh the the thing is somewhere projector. Suppose there's like the the white-board or whatever , the presentation is over there , the speaker is more probably is going to this way or that way. So probably you you may not need a very big microphone either. Probably one or two. uh uh ye uh yeah. Uh yeah."}, {"startTime": "2142.53", "endTime": "2175.7", "role": "C", "text": "Yeah , but let's pretend that it's not going to happen in any foreseeable future. Wh uh the I mean I'm just thinking from practical perspectives , you'd you'd have to the the AMI recognition system that we have now is either for these microphones or for the microphone array. There's no lapel system trained for instance. So I mean that in itself , it would I mean you'd have some fun training some more speech recognition models. But Yeah."}, {"startTime": "2157.86", "endTime": "2158.25", "role": "B", "text": "Mm-hmm."}, {"startTime": "2159.99", "endTime": "2160.25", "role": "B", "text": "Mm-hmm."}, {"startTime": "2167.2", "endTime": "2167.63", "role": "A", "text": "Mm-hmm."}, {"startTime": "2168.67", "endTime": "2220.02", "role": "B", "text": "Although at that point we can use this. I mean I was mention the the lapel microphone mm just like this. But if you tell me this , that's very interesting because at this point we can use this kind of things. But I don't why why not uh so there will be other data , their test data. Uh and especially for this kind of problem I think it can be a much more useful kind of data because there is real presentations. I mean is it's reality. You know , it's it's it's uh y n it it it it's exactly. It's more realistic and um yeah , probably it can help go in this direction of saying well let's see what happen between speech and slides. Uh Yeah , yeah , yeah."}, {"startTime": "2179.1", "endTime": "2179.54", "role": "D", "text": "Hmm."}, {"startTime": "2179.17", "endTime": "2193.48", "role": "C", "text": "Yeah. Yeah. Yeah , that's Sure."}, {"startTime": "2195.12", "endTime": "2195.33", "role": "C", "text": "Yeah."}, {"startTime": "2196.98", "endTime": "2200.0", "role": "C", "text": "It's what you should be using for this type of task."}, {"startTime": "2205.26", "endTime": "2246.34", "role": "C", "text": "I think Yeah. And every time we d we generate a new corpus and try to carry out new research we discover sort of areas that are too controlled , you know. I mean the AMI ones were a lot better in term of that than M_ four or whatever. But still. I mean es especially when you get into higher level sort of uh interpretation , it's yeah. Oh well. I'm uh I'm just curious , do the like the ICSI meetings , do they have anything other than the audio? Do they have slides or anything along that I don't think they would. Okay , I'm just thinking whether or not there an are any other sources , I mean maybe CHIL data?"}, {"startTime": "2223.16", "endTime": "2225.07", "role": "B", "text": "Yeah. Mm-hmm."}, {"startTime": "2228.48", "endTime": "2228.78", "role": "B", "text": "Yeah."}, {"startTime": "2231.87", "endTime": "2232.71", "role": "B", "text": "Yeah , yeah , yeah , yeah."}, {"startTime": "2235.13", "endTime": "2235.5", "role": "D", "text": "Yeah."}, {"startTime": "2240.93", "endTime": "2254.1", "role": "D", "text": "No the they the the the CHIL may be interesting for you. But it's a l uh well yeah , it may be interesting for your problem , I think. Y yeah. No no no."}, {"startTime": "2241.61", "endTime": "2241.9", "role": "A", "text": "No."}, {"startTime": "2251.34", "endTime": "2251.69", "role": "B", "text": "Yeah."}, {"startTime": "2252.07", "endTime": "2262.64", "role": "C", "text": "'Cause it's I think it's gonna be more like the TAM type situation. So Mm-hmm."}, {"startTime": "2255.59", "endTime": "2274.4", "role": "D", "text": "Yeah. Yeah , it's more like TAM. But uh yeah. The the their collection is much uh uh like they have uh R_T_N_s and all those thing. People sitting and uh it's a lec it's a lecture uh a meeting collection. And I uh is it through n n uh L_D_A_ or something."}, {"startTime": "2256.71", "endTime": "2257.1", "role": "B", "text": "Mm-hmm."}, {"startTime": "2259.54", "endTime": "2259.71", "role": "B", "text": "Yep."}, {"startTime": "2265.42", "endTime": "2266.63", "role": "B", "text": "Okay , that is cool."}, {"startTime": "2266.687", "endTime": "2286.47", "role": "C", "text": ". I don't know. But I mean given that it's coming from the same basis as AMI , I I expect there has to be some sort of relatively f liberal sort of distribution policy. Yeah."}, {"startTime": "2268.85", "endTime": "2269.98", "role": "B", "text": "Yeah , yeah. That's cool."}, {"startTime": "2283.74", "endTime": "2291.56", "role": "B", "text": "Uh yeah , yeah. Yeah , it's a it's a European project anyway. So I guess uh it must be available somewhere. Yeah."}, {"startTime": "2283.81", "endTime": "2284.01", "role": "D", "text": "Mm-hmm."}, {"startTime": "2286.49", "endTime": "2292.16", "role": "D", "text": "Yeah. So so probably we can yeah. CHIL may be interesting actually. You can look at it."}, {"startTime": "2291.22", "endTime": "2337.02", "role": "C", "text": "Yeah. The one thing about that , and this is something that came up in the last NIST evals , was the fact that it's almost too uni-modal. You've just got one lecturer talking. So once again you don't see the the complex sort of levels of interaction. I mean uh y uh there's no way of getting around that. I mean you just have to think of a a task a challenge that is relevant to that type of recording , which might mm you might use the same methods as what we've been pr talking about today. But the actual sort of what you're trying to measure might need to be slightly slightly different I guess. I don't yeah , you know , in terms of in terms of , say , measuring whether or not they're talking about the slides or off channel , I mean you might find ninety eight percent of your data is directly referring to your slides in a t in a TAM."}, {"startTime": "2293.136", "endTime": "2346.15", "role": "A", "text": ". AMI meeting."}, {"startTime": "2296.85", "endTime": "2297.12", "role": "B", "text": "Mm-hmm."}, {"startTime": "2305.44", "endTime": "2305.76", "role": "B", "text": "Yeah."}, {"startTime": "2309.56", "endTime": "2309.78", "role": "B", "text": "Yeah."}, {"startTime": "2313.09", "endTime": "2313.41", "role": "B", "text": "Yeah."}, {"startTime": "2315.28", "endTime": "2315.56", "role": "B", "text": "Mm-hmm."}, {"startTime": "2317.99", "endTime": "2318.48", "role": "B", "text": "Mm-hmm."}, {"startTime": "2325.88", "endTime": "2332.19", "role": "B", "text": "Mm-hmm. M Yeah , mm-hmm."}, {"startTime": "2335.54", "endTime": "2336.55", "role": "D", "text": "In the text."}, {"startTime": "2337.0", "endTime": "2428.97", "role": "B", "text": "But only we're measuring one third. It's not At least in no , I'm uh talking now about um the meeting. How presentation , of course. On presentation it it should be one hundred percent , yeah. Yeah yeah yeah , of course. No , that is just something that in my opinion uh with the work that's been already done is something we can get pretty quickly. It's an interesting task. It's more specific on uh meetings. Certainly not for uh for presentation. And it represent a nice task that can be measured , that is clear and Mm yeah. Yeah. Uh i in terms of actual recognition can of course uh help. So it's it's uh but of course not going to be it's not going to be a kind of thesis about this. No , that doesn't make any sense. I mean That uh , in a sense , if you want I mean that that's at least the way I see the that list I have made for my own thesis. I mean uh you define that domain I mean which is uh large , I mean which can be very general. So interaction between uh speech and slides , cool. And then you see how all these things , this two little works , or the statistical independence. And detecting when it is uh are two little works that some way fit in that very general uh framework."}, {"startTime": "2339.77", "endTime": "2341.16", "role": "C", "text": "That is uh is in TAMs."}, {"startTime": "2345.59", "endTime": "2353.89", "role": "C", "text": "Yeah , but I'm I'm meaning if you move on to these corpora , yeah. So you might wanna be doing something else basically , yeah."}, {"startTime": "2347.95", "endTime": "2348.42", "role": "D", "text": "Mm."}, {"startTime": "2359.83", "endTime": "2360.13", "role": "C", "text": "Yeah."}, {"startTime": "2361.8", "endTime": "2362.03", "role": "C", "text": "Yep."}, {"startTime": "2365.73", "endTime": "2365.99", "role": "C", "text": "Yeah."}, {"startTime": "2368.48", "endTime": "2368.71", "role": "C", "text": "Yep."}, {"startTime": "2373.91", "endTime": "2388.07", "role": "C", "text": "Yeah. And uh and at the s and at the same end of the day , you're probably going to be using or learning about the same techniques that you'll need for doing other things along these lines. So Okay."}, {"startTime": "2380.09", "endTime": "2380.34", "role": "A", "text": "Mm-hmm."}, {"startTime": "2382.2", "endTime": "2382.6", "role": "A", "text": "Mm yeah."}, {"startTime": "2388.49", "endTime": "2407.42", "role": "D", "text": "Well but uh S Yep."}, {"startTime": "2394.08", "endTime": "2429.6", "role": "C", "text": "It well it's it's to make a proposal basically for your yep uh This n Okay."}, {"startTime": "2394.69", "endTime": "2395.52", "role": "A", "text": "It's a first step."}, {"startTime": "2426.18", "endTime": "2426.82", "role": "D", "text": "Hmm."}, {"startTime": "2430.59", "endTime": "2488.67", "role": "B", "text": "Shown from this point of view it n that things mm there are other things , for example one that I really would like to do which is kind of fun. So when you have a bullet list can I click on one of the bullet and get the piece of speech where the guy was talking about that. Because sometimes people just read. Sometimes people uh im improve is more uh so for example that what that's another thing that fits in that kind of uh mm framework. And that's interesting in terms of uh I mean first of all again is measurable in terms of browsing , in terms of retrieval , in terms of indexing , annotation , meta-data extraction. That can be applied in many That would be you know , that uh that's uh that's something uh you're maybe joking now. That's something that can uh be done for example."}, {"startTime": "2438.62", "endTime": "2438.84", "role": "C", "text": "Yep."}, {"startTime": "2443.26", "endTime": "2445.01", "role": "C", "text": "The sp Mm-hmm."}, {"startTime": "2446.56", "endTime": "2447.02", "role": "C", "text": "Yeah."}, {"startTime": "2446.62", "endTime": "2447.21", "role": "D", "text": "Mm-hmm."}, {"startTime": "2448.92", "endTime": "2451.09", "role": "C", "text": "Sure. Sometimes it's a lot more."}, {"startTime": "2449.34", "endTime": "2449.54", "role": "A", "text": "Hmm."}, {"startTime": "2459.8", "endTime": "2460.11", "role": "C", "text": "Yeah."}, {"startTime": "2459.83", "endTime": "2460.11", "role": "A", "text": "Hmm."}, {"startTime": "2464.38", "endTime": "2464.71", "role": "C", "text": "Yeah."}, {"startTime": "2468.41", "endTime": "2468.69", "role": "C", "text": "Mm yeah."}, {"startTime": "2471.96", "endTime": "2472.27", "role": "C", "text": "Yeah."}, {"startTime": "2472.22", "endTime": "2489.05", "role": "A", "text": "And we could uh do automatical uh speaker rating if there are good speakers or bad speakers depending if they just read uh Mm-hmm."}, {"startTime": "2479.92", "endTime": "2481.99", "role": "C", "text": "Well , you'd uh sure."}, {"startTime": "2483.69", "endTime": "2486.04", "role": "D", "text": "That's that's a yeah."}, {"startTime": "2487.73", "endTime": "2495.72", "role": "C", "text": "At l at at least spot if they forget to talk about something and it won't let them continue on to the next slide until they've gone through all the points."}, {"startTime": "2488.24", "endTime": "2489.32", "role": "D", "text": "That that they have."}, {"startTime": "2493.59", "endTime": "2496.01", "role": "A", "text": "Yeah."}, {"startTime": "2495.45", "endTime": "2537.48", "role": "B", "text": "And uh some way there are parameters that can be measured that tell you that following certain uh criteria uh there is one very easy for example. I had the the the sp there are speaker that never look at the audience. Those are bad speakers in general. It's very wrong. You have to look at the audience. This is one. There is for example , and this is something that eventually can be done. If you have a certain number of words on your slides you need a certain amount of time to read them. The speakers that take a time which is too close to that , they are not good speaker because some way uh um they're talking too fast."}, {"startTime": "2499.1", "endTime": "2499.34", "role": "A", "text": "Mm-hmm."}, {"startTime": "2499.27", "endTime": "2499.75", "role": "C", "text": "Yeah."}, {"startTime": "2509.26", "endTime": "2509.55", "role": "A", "text": "Mm-hmm."}, {"startTime": "2511.55", "endTime": "2511.82", "role": "A", "text": "Yeah."}, {"startTime": "2513.98", "endTime": "2514.3", "role": "A", "text": "Mm-hmm."}, {"startTime": "2514.2", "endTime": "2514.52", "role": "C", "text": "Yeah."}, {"startTime": "2526.12", "endTime": "2526.53", "role": "D", "text": "Mm."}, {"startTime": "2534.69", "endTime": "2544.25", "role": "D", "text": "They're talking fast. I had a problem I like find the answer for my own. Yeah."}, {"startTime": "2535.13", "endTime": "2535.49", "role": "A", "text": "Mm-hmm."}, {"startTime": "2536.05", "endTime": "2545.4", "role": "C", "text": "Yeah. Well uh that that was just through sheer weight of content though."}, {"startTime": "2540.27", "endTime": "2611.98", "role": "B", "text": "They are not uh Yeah , they are not giving you the time. And there is a certain number of things that can be uh some way detected and measured that tell you whether the speaker is actually respecting some form of uh uh. It's a bit uh of having difficult and uh I would not um go that much in that direction. I mean it's uh but you know you know uh Figure , you know Tables , number. Ah , visual things. Well , that's for example with uh we submitted a project with J Jean-Marc um to use that thing as meta-data. And basically one thing for example we're trying to do and and again , this is something that can fit , huh. It will be not uh maybe. But but uh if you get the project , et cetera in any case it's something that Jean-Marc and me we want to do. Uh based on the kind of graphic object you have , so tables , questions , uh figures , plots , et cetera the side one for example , it is a result."}, {"startTime": "2540.58", "endTime": "2541.51", "role": "A", "text": "Mm-hmm , mm-hmm. Yeah."}, {"startTime": "2549.11", "endTime": "2549.21", "role": "A", "text": "Yeah."}, {"startTime": "2555.66", "endTime": "2558.85", "role": "C", "text": "W B yeah."}, {"startTime": "2563.33", "endTime": "2563.53", "role": "A", "text": "Mm-hmm."}, {"startTime": "2566.07", "endTime": "2568.04", "role": "A", "text": "Maybe possible someday. Yeah."}, {"startTime": "2568.51", "endTime": "2573.75", "role": "D", "text": "So what about the figure things? What happens if there's a figures coming on the slide? So what do you want to do with that?"}, {"startTime": "2575.32", "endTime": "2582.64", "role": "C", "text": "As in five , six , you know number where where the graphemic yeah , well I yeah."}, {"startTime": "2575.32", "endTime": "2576.49", "role": "D", "text": "On the s uh-huh."}, {"startTime": "2578.17", "endTime": "2581.08", "role": "D", "text": "Either stop it Yeah."}, {"startTime": "2586.32", "endTime": "2586.78", "role": "D", "text": "Okay."}, {"startTime": "2588.48", "endTime": "2589.01", "role": "D", "text": "Okay."}, {"startTime": "2605.68", "endTime": "2606.25", "role": "D", "text": "Okay."}, {"startTime": "2612.73", "endTime": "2613.28", "role": "D", "text": "Okay."}, {"startTime": "2613.65", "endTime": "2624.09", "role": "B", "text": "Try to get so that's again in terms of structuring , browsing , structure and retrieval , okay when it is a result. When it is an introduction."}, {"startTime": "2622.48", "endTime": "2622.86", "role": "D", "text": "Okay."}, {"startTime": "2624.75", "endTime": "2625.23", "role": "D", "text": "Okay."}, {"startTime": "2625.77", "endTime": "2626.22", "role": "C", "text": "Yeah."}, {"startTime": "2626.54", "endTime": "2637.79", "role": "B", "text": "When it is uh Yeah."}, {"startTime": "2629.46", "endTime": "2658.26", "role": "C", "text": "Although I remember discussing this like um 'cause uh when Neville was working on his his stuff , which was just based on the slides , if um he he asked me all you know , could I pre-segment the slides for him uh , you know , because you wanted to s you wanted to have the topic segmentation. And I said well just look at the the headings. Because anybody generally who writes the slides yeah. It's not okay. It's true for me then. Okay."}, {"startTime": "2629.52", "endTime": "2629.9", "role": "D", "text": "Okay."}, {"startTime": "2644.08", "endTime": "2690.63", "role": "B", "text": "Yes , yes , yes , yes , yes , yes. Uh Um It's not really true. It's not really it's not really true. Yeah , yeah , it's not really true. Yeah , that's o it's one of the most funny thing , I mean you can see when you work in this thing. Each one of us has an idea and then it's not true at all. I mean s some people actually are stick very carefully. If the p if they put in the outline uh let's say title one , title two , then you'll you find title one , title two. But many other people , and I am one of those people for example , are much more general. So my outline is something like introduction and experiments , the results , conclusions. You don't find the same title in the slides."}, {"startTime": "2650.17", "endTime": "2650.71", "role": "D", "text": "Yeah."}, {"startTime": "2652.21", "endTime": "2655.6", "role": "D", "text": "Usually in products and resources."}, {"startTime": "2657.28", "endTime": "2657.62", "role": "A", "text": "Mm-hmm."}, {"startTime": "2677.34", "endTime": "2677.61", "role": "C", "text": "Yep."}, {"startTime": "2681.46", "endTime": "2681.8", "role": "C", "text": "Okay."}, {"startTime": "2683.79", "endTime": "2684.03", "role": "C", "text": "Yeah."}, {"startTime": "2690.85", "endTime": "2696.74", "role": "C", "text": "Okay. Okay. Uh it yeah , it depends , yeah. That's a stylistic thing as much as anything. Yep."}, {"startTime": "2693.61", "endTime": "2721.06", "role": "B", "text": "It's it's really a different style of uh there are people that don't put , for example , outline. We were uh for example in the um corpus of M_L_M_E_ , so the one is on the demo. Fifty percent of the presentation have no outline. In the corpus of the TAM two thousand four , TAM presentation , twenty five percent of the presentation have no outline at all."}, {"startTime": "2705.18", "endTime": "2705.44", "role": "C", "text": "Yeah."}, {"startTime": "2710.11", "endTime": "2710.42", "role": "C", "text": "Hmm."}, {"startTime": "2716.16", "endTime": "2716.43", "role": "C", "text": "Mm."}, {"startTime": "2720.91", "endTime": "2727.09", "role": "C", "text": "Yeah. Which uh whether or not that's a good or a bad thing. It depends on the talk. Yeah , presentation , yeah."}, {"startTime": "2724.74", "endTime": "2759.76", "role": "B", "text": "That's that's uh what yeah , uh w it is. And basically that's that's uh and again , the outline is typical maybe in scientific presentation. Well in that case that majority has. Other kind of presentation probably no. I mean it's it's an habit we have. But um you but again uh I mean unfortunately th n there is nothing true. Nothing true , is is everything is chance pretty much. So uh that was on on possible work."}, {"startTime": "2732.59", "endTime": "2732.97", "role": "C", "text": "Yeah."}, {"startTime": "2737.15", "endTime": "2737.44", "role": "C", "text": "Yeah."}, {"startTime": "2741.97", "endTime": "2747.41", "role": "C", "text": "Something we're taught at university from a very young age. the structure."}, {"startTime": "2750.28", "endTime": "2752.04", "role": "C", "text": "Yeah , yeah , sure. It's all subjective."}, {"startTime": "2755.05", "endTime": "2755.32", "role": "C", "text": "Hmm."}, {"startTime": "2758.07", "endTime": "2759.34", "role": "C", "text": "Okay. Okay."}, {"startTime": "2760.65", "endTime": "2765.05", "role": "D", "text": "Okay , so what are you going to do between the data when you collect and this?"}, {"startTime": "2767.0", "endTime": "2776.29", "role": "D", "text": "What do you want to do now? By the time you get the data it's going to take another two months if I am right , the whole capturing system when it is going to come. So what is the next step?"}, {"startTime": "2773.87", "endTime": "2774.17", "role": "B", "text": "Mm-hmm."}, {"startTime": "2778.59", "endTime": "2791.69", "role": "A", "text": "Well uh did trying to really determine the um the um uh subject of something for my proposal I mean."}, {"startTime": "2792.15", "endTime": "2818.9", "role": "D", "text": "Yeah , you have to submit it in like two months also again. Yeah , yeah , to submit , yeah. It's one year , right? . For sure. You you need it bad."}, {"startTime": "2795.39", "endTime": "2816.3", "role": "A", "text": "Yeah , aro around February or March. So really um Yeah. So to find something for that. Uh also with the th thinking maybe turning this uh work into publication , the one about the for sure."}, {"startTime": "2799.03", "endTime": "2799.2", "role": "C", "text": "Okay."}, {"startTime": "2800.51", "endTime": "2803.08", "role": "C", "text": "Yeah , yeah. It's quite strictly imposed now."}, {"startTime": "2814.44", "endTime": "2819.88", "role": "B", "text": "Not maybe. For sure."}, {"startTime": "2820.2", "endTime": "2849.44", "role": "A", "text": "And uh also uh uh well that uh depends a little on on on you. But try to finish with the um measures and the call routing. 'Cause I was talking with that uh about that to Herve uh since I was uh I will recycle this poster for I_M_ two , you know , about uh about this. And uh that could be cool to to finish it. Maybe fuse it with uh Ian's work and uh do a journal paper he was suggesting."}, {"startTime": "2829.63", "endTime": "2840.779", "role": "D", "text": "Call routing where. That's inte."}, {"startTime": "2832.37", "endTime": "2945.26", "role": "C", "text": "Ye Yeah. After the after the hard drive crash we took the time to actually rebuild the the the system and actually train 'cause originally we sort of had the idea of oh we'll use a recognizer that's been trained on a large amount of telephone speech data and that should give us a better result. I just as a contrast , I trained one specifically on this data. Results were almost identical um which says to me there's something wrong with the data rather than and it's nothing serious. It's simply that it hasn't been um chunked it or or segmented in a way that's typical of speech resources. in terms of um you can have like uh a two second utterance , uh credit cards , and then twenty seconds of silence coming after it , which in which when you f when you first think about it , you just think oh silence , whatever , nothing will happen. But a lot of the normalization that we use Uh yeah , C_M_S_ C_ C_V_N_. Uh so w we need a decent end point detection system running before we can we can we can do that. And we're converging on having one now just in in sort of tandem with this development of this web based recognizer. Um but of course unfortunately all these things take time. Um but I I think we should see a decent sort of improvement then. Not just in terms of no longer having recognition errors whenever silence appears. 'Cause you get that immediate benefit that you don't have any insertion errors. But also it should actually affect the recognition on the speech segments as well."}, {"startTime": "2845.67", "endTime": "2847.21", "role": "D", "text": "I think we should yeah."}, {"startTime": "2851.92", "endTime": "2852.43", "role": "D", "text": "This is yeah."}, {"startTime": "2854.21", "endTime": "2854.92", "role": "D", "text": "Uh h oh."}, {"startTime": "2862.1", "endTime": "2862.38", "role": "B", "text": "Yeah."}, {"startTime": "2873.29", "endTime": "2873.6", "role": "D", "text": "Yeah."}, {"startTime": "2885.39", "endTime": "2885.69", "role": "D", "text": "Mm yeah."}, {"startTime": "2891.16", "endTime": "2891.54", "role": "B", "text": "Mm-hmm."}, {"startTime": "2894.32", "endTime": "2894.92", "role": "D", "text": "Mm yeah."}, {"startTime": "2894.88", "endTime": "2895.42", "role": "B", "text": "I see."}, {"startTime": "2897.21", "endTime": "2911.72", "role": "D", "text": "Uh uh Uh yeah."}, {"startTime": "2903.53", "endTime": "2904.95", "role": "B", "text": "I know. Yeah yeah. I know , I know , I know."}, {"startTime": "2912.46", "endTime": "2913.14", "role": "B", "text": "I see."}, {"startTime": "2913.5", "endTime": "2918.01", "role": "D", "text": "Yeah. Even if little bit of. Oh."}, {"startTime": "2920.2", "endTime": "2923.73", "role": "D", "text": "This Uh ye yeah."}, {"startTime": "2927.36", "endTime": "2927.64", "role": "D", "text": "Yeah."}, {"startTime": "2930.28", "endTime": "2932.88", "role": "D", "text": "No no , I think you yeah , it's uh it's huge. Yeah."}, {"startTime": "2944.68", "endTime": "2962.47", "role": "B", "text": "And so essentially say well as there is this silence time which tend to be even more than than how it is , so better to have a kind of silence detection. So something that really takes this and they recognize only that uh that part. This will improve the phoneme uh recognition rate."}, {"startTime": "2951.08", "endTime": "2952.86", "role": "D", "text": "It it it's non-determinist."}, {"startTime": "2952.0", "endTime": "2955.89", "role": "C", "text": "Th The Yeah."}, {"startTime": "2958.09", "endTime": "2958.52", "role": "C", "text": "Yeah."}, {"startTime": "2962.47", "endTime": "2968.41", "role": "C", "text": "Mm that's the hard p oh I might uh given the trouble we've had with this corpus I can't make any promises."}, {"startTime": "2962.8", "endTime": "2979.18", "role": "D", "text": "Yeah , that's what we expect to Yeah. Exa that's the intention there."}, {"startTime": "2964.76", "endTime": "2977.27", "role": "B", "text": "That's what it of of course , of course , of course. And at that point , even the uh call router that uh Jean Jean-Yves has uh made can improve uh its performance."}, {"startTime": "2976.75", "endTime": "2978.45", "role": "C", "text": "That's the intention , yep."}, {"startTime": "2978.91", "endTime": "2997.01", "role": "B", "text": "And it can be used after uh tool for the measure work. Uh That we got. Mm-hmm."}, {"startTime": "2983.06", "endTime": "3025.44", "role": "A", "text": "So so you're so what you are saying is that you you noticed that when you um tried other features and uh Because and initially it was a s Nuance , trained on Nuance , uh no? Or Mm-hmm."}, {"startTime": "2983.21", "endTime": "2983.89", "role": "C", "text": "Sure , sure."}, {"startTime": "2983.28", "endTime": "2983.37", "role": "D", "text": "Sure."}, {"startTime": "2989.31", "endTime": "3008.647", "role": "D", "text": "Mm ye."}, {"startTime": "2989.76", "endTime": "3010.29", "role": "C", "text": "We trained the system just on this data. Like there were there were six thousand utterances that weren't used for uh the call routing side of things. I think they th there were thirteen thousand in the entire corpus. Six t half of them roughly we've thrown away. So use that for acoustic training. And the results from that were almost the same as what we got for the C_T_S_ model."}, {"startTime": "3002.04", "endTime": "3002.38", "role": "B", "text": "Mm-hmm."}, {"startTime": "3008.49", "endTime": "3008.78", "role": "B", "text": "Mm."}, {"startTime": "3012.66", "endTime": "3021.65", "role": "D", "text": "No , no , no , no , no. It i Yeah."}, {"startTime": "3012.99", "endTime": "3032.38", "role": "C", "text": "Y yeah. But one can imagine a commercial system uh that that that s Steven Cox used from Nuance probably had all these things , built in end point detection , et cetera , et cetera. So Mm."}, {"startTime": "3022.5", "endTime": "3023.35", "role": "B", "text": "Mm-hmm , mm-hmm."}, {"startTime": "3023.91", "endTime": "3058.31", "role": "D", "text": "Surely they should they should have had that actually. So maybe like we had to do this end point detection and probably a little bit of final filtering. And then I think you should be pretty much converging to the system. But the still the reason with the the they had like what are the systems we train on databases are they are chop neatly. That there is not too much silence beginning , not too much silence at the end. They are they are j they they chopped so neatly for the it like custom made database. But uh here it's not like that you know like uh-huh."}, {"startTime": "3036.12", "endTime": "3036.37", "role": "C", "text": "Yeah."}, {"startTime": "3043.66", "endTime": "3044.07", "role": "B", "text": "Mm-hmm."}, {"startTime": "3045.68", "endTime": "3049.15", "role": "B", "text": "Sure , sure. Then oh yeah yeah yeah. I know. I know the problem."}, {"startTime": "3055.85", "endTime": "3072.06", "role": "C", "text": "Yeah. And there's also just things like tele uh receiver noise at the beginning and or at the end of the and I mean these these are things you can get rid of if it's a Mm."}, {"startTime": "3056.53", "endTime": "3058.19", "role": "B", "text": "I see. I see. I see."}, {"startTime": "3061.88", "endTime": "3063.97", "role": "B", "text": "Yeah , yeah , yeah. Yeah , yeah."}, {"startTime": "3062.88", "endTime": "3063.22", "role": "D", "text": "Yeah."}, {"startTime": "3066.33", "endTime": "3067.89", "role": "B", "text": "I see. I see the problem."}, {"startTime": "3066.86", "endTime": "3125.44", "role": "D", "text": "There are the several things. Like one thing is like we can do this begin and end detection , as we said. Or you and he can uh we can try to use uh France Telecom's uh approach actually. And that um uh uh they they have this front end which uh uh which which can do a spectral. And plus it can give you a voice activity detection. Part f part from basis it can give. So somethi we can just yeah , we can just run it quickly and see. And probably you will have to run it. Will give you the idea that is it okay like? Yeah. No no no no. Uh not running , I mean to say p probably uh he should run it or uh like we can ge help him to run it actually. Because at some point he has to get into Uh I mean to say I I mean to say that it's okay. We have all the scripts. But probably uh he should run it I mean to say."}, {"startTime": "3087.52", "endTime": "3097.74", "role": "C", "text": "Yep Mm okay , this is f okay. Okay. We can just run some generic yeah."}, {"startTime": "3104.36", "endTime": "3122.88", "role": "C", "text": "Well I don't mind running it. I've got all the scripts set up. So Well I'm not I'm not sure I see the point actually. Uh Mm."}, {"startTime": "3116.62", "endTime": "3154.35", "role": "B", "text": "I'm not not sure it's. Yeah. I'm losi No. No. Mm-hmm."}, {"startTime": "3126.9", "endTime": "3154.27", "role": "C", "text": "I don't know. Yeah. Whatever , I don't know thing th I don't know whether that a I don't know whether that's a We might as well. 'Cause I mean we've up until now uh you haven't been running any recognition on and neither did Jean-Yves on that on that data."}, {"startTime": "3127.99", "endTime": "3147.86", "role": "D", "text": "It's a The all these experiments probably Uh the they are uh the scri because up to uh probably maybe we shall do mm it yeah. Uh for to make it faster we should ru it run maybe. If we run f we ourself it it's very fast. Uh yeah."}, {"startTime": "3129.35", "endTime": "3130.86", "role": "A", "text": "Run run run what exactly?"}, {"startTime": "3133.53", "endTime": "3137.69", "role": "A", "text": "For the the the call routing itself or the recognition uh the phoneme recognition?"}, {"startTime": "3152.91", "endTime": "3153.11", "role": "D", "text": "Yeah."}, {"startTime": "3153.83", "endTime": "3164.52", "role": "A", "text": "Yeah. I have all uh Jean-Yves's uh scripts and uh programs for performing the call uh routing I think uh starting from the phoneme sequences."}, {"startTime": "3154.49", "endTime": "3154.89", "role": "D", "text": "Okay."}, {"startTime": "3163.01", "endTime": "3163.64", "role": "D", "text": "Mm okay."}, {"startTime": "3163.63", "endTime": "3164.08", "role": "C", "text": "Yeah."}, {"startTime": "3165.62", "endTime": "3165.82", "role": "C", "text": "Yeah."}, {"startTime": "3165.73", "endTime": "3181.05", "role": "D", "text": "No , but I mean to say that if you if you if you if you if you give him the scripts and ask him to run , uh the Uh no. Yeah. But it's Uh Yeah."}, {"startTime": "3171.01", "endTime": "3223.8", "role": "C", "text": "Oh sure , but I mean the scripts are so automated , it's just a matter of sitting uh uh submitting a job to the cluster and I don't I don't see the point of that. I don't mind running it. That'd it'd be like uh half an hour's work in a day to run the recognition scripts. I mean I I I I know you're saying. Artem should familiarise himself with the A_S_R_ systems or whatever. Fine. But I don't uh I d I don't think this is a point that's worth sort of worrying about at this stage anyway. I mean Well 'cause I'm I'm sort of assuming that that we're gonna have so an end point detection regardless of this working on this Nuance corpus. So We need it for AMI. We need it for um the online demo. For uh all these things , yeah."}, {"startTime": "3177.97", "endTime": "3180.41", "role": "A", "text": "Yeah , I I know that I don't know how to use the cluster."}, {"startTime": "3193.05", "endTime": "3194.49", "role": "D", "text": "Yeah , oh yeah."}, {"startTime": "3199.7", "endTime": "3200.1", "role": "D", "text": "Yeah."}, {"startTime": "3204.07", "endTime": "3227.3", "role": "A", "text": "Yeah , if it's just running a script I don't know if it's But this is basically detecting speech and no non-speech."}, {"startTime": "3211.56", "endTime": "3223.74", "role": "D", "text": "Yeah , that uh-huh. No no no no , I the end point system is different thing , no? That's and we need it for AMI plus other thing. And so but the I am to all saying yeah. I I am."}, {"startTime": "3226.86", "endTime": "3231.12", "role": "C", "text": "It's it's a lot more difficult than you would think."}, {"startTime": "3227.48", "endTime": "3236.4", "role": "D", "text": "It's n it uh no no no , it's not speech non-speech. Uh uh it's uh it's uh it's yeah."}, {"startTime": "3229.36", "endTime": "3240.72", "role": "A", "text": "Yeah. It's this uh problem I hear every time on the speech meeting how do we detect speech and not speech. Ah and uh Or oh okay."}, {"startTime": "3235.64", "endTime": "3291.12", "role": "C", "text": "Well , it's speech and any and any other class of sound. That's the problem. It's And is And any other class , yeah. If it was just silence it'd be easy. But uh um and in controlled places you can't just assume it's it's , you know , any energy below a certain threshold. And this is what everybody sort of claimed the problem was solved with years ago. But Well , I mean this is once again a Yeah , sure. But I mean this is once again a very constrained task again. I mean it's it's it's you you're almost assured it's only gonna be a single speaker on the microphone. So I mean the the only sorts of noise you're gonna have to deal with uh is is is hiss or impulsive I would say. Or or that would be a good start."}, {"startTime": "3238.47", "endTime": "3243.68", "role": "D", "text": "Yeah. Any anything nonsense or else it beeped."}, {"startTime": "3239.87", "endTime": "3241.41", "role": "B", "text": "Mm."}, {"startTime": "3244.14", "endTime": "3248.3", "role": "A", "text": "It's not just speech and silence. It's speech and and okay."}, {"startTime": "3247.69", "endTime": "3251.32", "role": "D", "text": "It's not silent. It's uh you can say that's very yeah."}, {"startTime": "3256.97", "endTime": "3257.37", "role": "A", "text": "Mm-hmm."}, {"startTime": "3259.71", "endTime": "3260.08", "role": "A", "text": "Mm-hmm."}, {"startTime": "3261.82", "endTime": "3280.22", "role": "A", "text": "But who really can do uh when somebody will really be able to do that , I mean detect the speech from non-speech , it will be a little revolution , no , in the Mm-hmm."}, {"startTime": "3285.79", "endTime": "3311.83", "role": "D", "text": "And it can be it can be anything. Yeah. Breathing. Yeah. No anyway , so we okay , so we'll finish this call routing stuff. What do you say all thi this is okay with you , right? So we'll k because I think uh it it it has not been even submitted outside also the work what Jean-Yves did yet. Mm yeah not done that yet. Tried Uh yeah , he still yeah."}, {"startTime": "3298.49", "endTime": "3321.62", "role": "B", "text": ". No no. Basically because it was not at uh at a level that could be anyway. So the idea was good. I think , yeah , with a better uh phoneme recognition rate definitely it could uh improve also the the call routing performance."}, {"startTime": "3304.92", "endTime": "3305.41", "role": "C", "text": "No , no."}, {"startTime": "3316.88", "endTime": "3317.11", "role": "C", "text": "Yeah."}, {"startTime": "3320.11", "endTime": "3340.74", "role": "C", "text": "yeah. It was showing that. Um you haven't heard from him I take it either? No. Okay. Well it'd be nice to get the thesis I think. There's a sort of just a research report sort of basis for this. Yeah. But Okay."}, {"startTime": "3325.75", "endTime": "3328.86", "role": "B", "text": "Nope. But we can we can find."}, {"startTime": "3327.1", "endTime": "3327.75", "role": "D", "text": "Uh-uh."}, {"startTime": "3332.44", "endTime": "3433.69", "role": "B", "text": "Yeah. Yeah , yeah. Yeah , yeah. But we can some way find a guy. I mean this should should be have all details , so it should be relatively easy to at least this is the last news I had and then I can try to get him back. Uh Yeah. No , going very pra pragmatic uh there is a submission uh deadline for example thirty one December for conference on multi-media and expo where I think these two little works on So it can be It's as a proposal. Because as far as I understand this work on the phoneme anyway still takes some development time in the sense that uh no?"}, {"startTime": "3344.31", "endTime": "3344.72", "role": "C", "text": "yeah."}, {"startTime": "3348.47", "endTime": "3351.98", "role": "C", "text": "apply some pressure."}, {"startTime": "3349.87", "endTime": "3361.65", "role": "D", "text": "Yeah. So yeah , it it's pretty much good time also , no? And he c he can and uh when do you intend to start writing the proposal? Probably you should start , I think. S slow. Little bit start thinking."}, {"startTime": "3358.93", "endTime": "3367.5", "role": "A", "text": "Yeah , well this is basically in my three uh main jobs uh proposal uh um this."}, {"startTime": "3366.06", "endTime": "3395.41", "role": "D", "text": "No no , you you should not wait till the end. That's what I mean to say. Uh yes ,. Because you Because it Okay."}, {"startTime": "3368.84", "endTime": "3372.18", "role": "C", "text": "Uh n no it should be looking towards the start of next year basically."}, {"startTime": "3369.28", "endTime": "3396.82", "role": "A", "text": "Ah yeah , yeah. Yeah but yeah. Ah yeah sure. But uh uh uh shouldn't make it clearer before on the on the on what uh I I will write. And even uh a first uh uh submission using this work um will make things clearer for me uh writing them down and f for it will help I think for that also."}, {"startTime": "3374.19", "endTime": "3426.26", "role": "C", "text": "The is it so I mean you should Okay , which is Yeah. And it's nice to get some feedback on I mean that feedback will probably come after your proposal possibly. But um Yeah. Yeah , yeah , yeah. Exactly."}, {"startTime": "3397.96", "endTime": "3398.33", "role": "D", "text": "Mm."}, {"startTime": "3402.69", "endTime": "3402.89", "role": "A", "text": "Mm."}, {"startTime": "3402.95", "endTime": "3403.29", "role": "D", "text": "Mm-hmm."}, {"startTime": "3405.68", "endTime": "3410.08", "role": "D", "text": "Uh. Yeah , it can go there , yeah."}, {"startTime": "3409.78", "endTime": "3410.1", "role": "A", "text": "Mm."}, {"startTime": "3411.54", "endTime": "3427.29", "role": "D", "text": "See No , no , no. I think it's uh it's good if he submits his pr proposal. As a research report you put here , submit it for the conference. It's quite good for the proposal directly. Yeah. Yeah."}, {"startTime": "3415.08", "endTime": "3415.39", "role": "A", "text": "Mm-hmm."}, {"startTime": "3425.36", "endTime": "3425.69", "role": "A", "text": "Mm-hmm."}, {"startTime": "3432.72", "endTime": "3455.92", "role": "D", "text": "No , I think uh we we may have to like it can have a uh it's it's kind of like uh uh maybe take like uh uh two or three days , you know , like to sit out and say uh one converge to one approach and then just do without that yeah. And probably yeah. So that is the thing. We have to sort out the bug kind of thing and see how reliable is this end point detection for us. Yeah , mm-hmm."}, {"startTime": "3443.41", "endTime": "3443.98", "role": "B", "text": "Okay."}, {"startTime": "3444.81", "endTime": "3447.99", "role": "C", "text": "N yeah , sort out any bugs or whatever. Yeah."}, {"startTime": "3445.75", "endTime": "3446.15", "role": "B", "text": "I see."}, {"startTime": "3450.61", "endTime": "3451.05", "role": "B", "text": "Mm-hmm."}, {"startTime": "3453.58", "endTime": "3464.99", "role": "C", "text": "Yeah. I I I'd prefer to go back to the C_T_S_ models I think as well 'cause I think I think they did work a little bit better. So yeah."}, {"startTime": "3454.49", "endTime": "3456.98", "role": "B", "text": "And Yeah."}, {"startTime": "3457.53", "endTime": "3460.29", "role": "D", "text": "Uh yeah , I think uh then we can go back to C_T_S_ actually."}, {"startTime": "3461.804", "endTime": "3477.92", "role": "B", "text": ". Anyway the good news is that there are results. You are you have just to to decide uh , yeah , what what what uh what you want to work first and and and finalise. I think you can really start finalising mm-hmm."}, {"startTime": "3471.93", "endTime": "3472.29", "role": "C", "text": "Yep."}, {"startTime": "3471.94", "endTime": "3472.29", "role": "A", "text": "Mm-hmm."}, {"startTime": "3474.39", "endTime": "3485.94", "role": "A", "text": "Yeah. Well I think uh first uh this submitted and this will help for the proposal. And since uh we cannot start immediately with the measures , I think that's the best thing to do."}, {"startTime": "3478.47", "endTime": "3478.82", "role": "D", "text": "Yeah."}, {"startTime": "3484.19", "endTime": "3484.54", "role": "B", "text": "Mm-hmm."}, {"startTime": "3486.53", "endTime": "3486.89", "role": "B", "text": "Mm-hmm."}, {"startTime": "3486.6", "endTime": "3514.71", "role": "D", "text": "Okay. And uh yeah , so that is this. So you wanted to talk something more than that. Well we obstructed you with that. You wanted to talk something different also. No. Or maybe another meeting. And then I say I don't remember. . No , I was just looking this. Okay uh we are not out of time , you know."}, {"startTime": "3495.03", "endTime": "3503.09", "role": "A", "text": "Mm well no. Well for me it's I think we uh it's fine."}, {"startTime": "3500.95", "endTime": "3502.16", "role": "B", "text": "Yeah it's okay."}, {"startTime": "3501.98", "endTime": "3514.7", "role": "C", "text": "Hayes is another one isn't it? Oh okay , sorry. I was like 'cause I saw you sli I saw you looking at your watch before , and I like wow. Gonna have to s Have this AMI corpus linked in no time."}, {"startTime": "3514.77", "endTime": "3522.42", "role": "A", "text": "Yeah and I think uh that will be exactly one hour and uh uh fill the tape. Uh the tape is sixty minutes. Ah so I was right."}, {"startTime": "3517.73", "endTime": "3520.19", "role": "D", "text": "Yeah."}, {"startTime": "3520.48", "endTime": "3554.68", "role": "D", "text": "Yeah , yeah , it's happened uh it happened with my friend. Like uh he was taking pictures pictures pictures and it was going thirty seven , thirty eight , forty even. . So I said there's some problem with yours uh your uh uh the way he uh put the roll inside. There is some problem , it has got stuck somewhere. It can never go to forty one , forty Yeah , I uh uh thirty seven , thirty eight is fine. forty , forty one is but see , he has already. Don't listen. Okay."}, {"startTime": "3520.9", "endTime": "3521.56", "role": "C", "text": "Oh okay."}, {"startTime": "3529.66", "endTime": "3530.02", "role": "A", "text": "Ah yeah."}, {"startTime": "3537.31", "endTime": "3537.66", "role": "A", "text": "Uh-huh."}, {"startTime": "3543.16", "endTime": "3549.17", "role": "C", "text": "Uh not normally , yeah. It could go to thirty seven , thirty eight. Yeah."}, {"startTime": "3545.53", "endTime": "3545.92", "role": "A", "text": "Mm-hmm."}, {"startTime": "3551.18", "endTime": "3551.32", "role": "A", "text": "Mm-hmm."}, {"startTime": "3551.52", "endTime": "3555.08", "role": "C", "text": "Yeah , we've been told. Okay. Fine."}, {"startTime": "3552.3", "endTime": "3553.65", "role": "A", "text": "Yeah. Yeah."}]