[{"startTime": "26.39", "endTime": "27.18", "role": "C", "text": "With the lapel."}, {"startTime": "32.383", "endTime": "148.49", "role": "A", "text": ". The show must go on."}, {"startTime": "49.77", "endTime": "123.13", "role": "C", "text": "So we I think we organise uh just to to discuss uh To discuss uh , yeah , the project Alexandre and uh Jean-Marc uh proposed a about uh capturing uh audio , video and slide uh in a synchronized way. And so we will start with uh an introduction. Uh I think Olivier prepared some slides about uh reviewing uh current systems. And um And then , even if we don't have many things to to talk about , just to to start discussing about clearly the project and also um dealing with our kind of timing constraints. And uh The U_ U_S_ U_ uh U_S_B_ cord doesn't work? And you didn't put on the Maybe you can access through the network."}, {"startTime": "54.64", "endTime": "59.99", "role": "B", "text": "Sorry. I don't have my presentation."}, {"startTime": "63.2", "endTime": "85.23", "role": "B", "text": "Um Yeah."}, {"startTime": "106.2", "endTime": "106.52", "role": "D", "text": "Mm-hmm."}, {"startTime": "107.43", "endTime": "110.75", "role": "B", "text": "So they're on my they're on a."}, {"startTime": "118.45", "endTime": "119.33", "role": "B", "text": "No no. They are."}, {"startTime": "124.8", "endTime": "126.11", "role": "C", "text": "If it's on your H_."}, {"startTime": "127.76", "endTime": "130.94", "role": "B", "text": "Yeah. No , no. My D_ machine."}, {"startTime": "127.77", "endTime": "129.8", "role": "C", "text": "Or it's on uh your D_ machine."}, {"startTime": "132.84", "endTime": "135.89", "role": "C", "text": "So maybe we wi we will be able to."}, {"startTime": "134.09", "endTime": "134.42", "role": "B", "text": "Yeah."}, {"startTime": "136.83", "endTime": "137.08", "role": "B", "text": "Okay."}, {"startTime": "139.08", "endTime": "140.98", "role": "C", "text": "Should work. What?"}, {"startTime": "139.09", "endTime": "157.12", "role": "B", "text": "Just going Mm-hmm."}, {"startTime": "142.74", "endTime": "143.35", "role": "D", "text": "Keep going."}, {"startTime": "146.35", "endTime": "171.68", "role": "C", "text": "So um w yeah , we had like five slides y uh presenting different systems. And mayb maybe you we can do that at the white-board. I it's a bit stupid. But uh y you know. I think you remember well the different uh parts. And uh I'm sure uh we can do that at the white-board. Yeah , it would be great to use the white-board."}, {"startTime": "163.8", "endTime": "164.26", "role": "B", "text": "Okay."}, {"startTime": "166.45", "endTime": "169.53", "role": "B", "text": "Okay. So uh uh yeah. I will do something like that."}, {"startTime": "172.57", "endTime": "196.88", "role": "B", "text": "Okay. So uh I would like just to review at the different project regarding acquisition system. So basically there are five systems. The first one is called SMAC , which is developed by Fribourg and CERN. The second one i is your system. Uh I would to say the cheap meeting room system. The third one yeah , maybe I can share that with you."}, {"startTime": "196.35", "endTime": "199.03", "role": "C", "text": "So the the the first one is uh SMAC. Okay."}, {"startTime": "199.46", "endTime": "201.57", "role": "B", "text": "The SMAC , yeah. Should I write?"}, {"startTime": "201.88", "endTime": "202.55", "role": "C", "text": "Yeah , maybe yeah."}, {"startTime": "205.98", "endTime": "206.37", "role": "B", "text": "Okay."}, {"startTime": "207.79", "endTime": "211.33", "role": "C", "text": "Just a review of current systems uh to introduce."}, {"startTime": "209.22", "endTime": "211.0", "role": "D", "text": "Yeah , yeah. Sure , that's interest us."}, {"startTime": "210.83", "endTime": "213.86", "role": "B", "text": "The first one is yeah , I will call that A_."}, {"startTime": "218.92", "endTime": "231.93", "role": "B", "text": "SMAC , which is develop by Fribourg and CERN. The second one , B_ , which is uh I would like to che say uh cheap uh meeting room or I don't know."}, {"startTime": "232.08", "endTime": "233.32", "role": "D", "text": "It's okay. It should."}, {"startTime": "232.92", "endTime": "248.69", "role": "C", "text": "Well , cheap meeting room is the , you know , mm it's a conference room? Or Yeah. PAS. Alexandre. PAS. Yeah."}, {"startTime": "236.05", "endTime": "248.5", "role": "D", "text": "But for the moment just for the purpose well , f for the moment it's just to understand each other so we know we know that the uh Yeah for with PAS. It's okay. Yeah , good idea."}, {"startTime": "236.07", "endTime": "239.21", "role": "B", "text": "Okay."}, {"startTime": "236.88", "endTime": "245.92", "role": "A", "text": "You can say then you It I th I thought it was called PAS , so I think just use this."}, {"startTime": "246.79", "endTime": "247.98", "role": "B", "text": "P_A_S_."}, {"startTime": "247.85", "endTime": "248.49", "role": "A", "text": "PAS. Yeah , yeah."}, {"startTime": "249.32", "endTime": "273.36", "role": "B", "text": "Okay , P_A_S_. The third one is um Okay. The third one is called uh the s um this is uh the smart meeting room develop at Fribourg which is called the smart It's DIVA."}, {"startTime": "251.75", "endTime": "272.52", "role": "D", "text": "Uh this sounds like Alexandre pas. Yeah that's not that It's Diva. N'est-ce pas? Something like this. Yeah."}, {"startTime": "254.2", "endTime": "259.19", "role": "C", "text": "P PAS project."}, {"startTime": "267.37", "endTime": "280.02", "role": "C", "text": "Smart mediat uh Smart Minutes , but uh I thi Diva. Because a Sma yeah , Smart Minute is all the process of capturing the minutes automatically. But it's Diva we can say."}, {"startTime": "276.29", "endTime": "276.73", "role": "B", "text": "Okay."}, {"startTime": "278.27", "endTime": "279.59", "role": "B", "text": "The p DIVA."}, {"startTime": "281.85", "endTime": "305.65", "role": "B", "text": "D_I_V_A_ , something like that. The third one is call uh the third one is uh the project that I have to improve the current smart meeting room at IDIAP. Uh for that we will use um uh Yeah , a tape three uh okay , let's call that."}, {"startTime": "286.98", "endTime": "287.26", "role": "D", "text": "Mm-hmm."}, {"startTime": "308.87", "endTime": "310.39", "role": "C", "text": "Free."}, {"startTime": "317.68", "endTime": "334.03", "role": "B", "text": "And the last one I would like just mention just to for the meeting and this is uh the fire-wire. Um I don't know if you saw my presentation during my turn. You did you? Uh okay. E_ , which is firewire."}, {"startTime": "328.07", "endTime": "328.26", "role": "D", "text": "Mm-hmm."}, {"startTime": "329.58", "endTime": "329.68", "role": "D", "text": "Yeah."}, {"startTime": "341.33", "endTime": "393.24", "role": "B", "text": "Okay. So I will start just with the SMAC. So maybe I draw line here. So the SMAC The SMAC project the SMAC project is a project which aims to do the acquisition of audio , video and slide uh for presentation. Yeah , this project is done with Fribourg and CERN. But I'm just going to make a very short um graphic. In fact , they use um a card , a video card which is call um I_V_C_ mm yeah. I just write I_V_C_. In fact , this is a video card with four um inputs."}, {"startTime": "384.33", "endTime": "385.81", "role": "C", "text": "Mm. Doesn't matter. Yeah."}, {"startTime": "396.3", "endTime": "448.63", "role": "B", "text": "On these four inputs you can have only video. But uh they want to make also the slide acquisition. So on one input they put um a conversion box , a converter , which converts from slide to video. So that mean that we decrease uh the the quality. We have a high quality in slide and we go to low quality to lower quality with uh video. Um so this one is just for the SMAC. Now I will just move. D Yeah. These one are just for video and audio. You can use uh them. And this board does uh the DivX compression on the fly. This is uh the box that we have on the table. The the card that we have on the table."}, {"startTime": "431.97", "endTime": "487.01", "role": "C", "text": "And this the three of those are the v the the video And uh I'd like to add that this c I think it's quite ambitious project because it's with uh the CERN. And they w they uh already worked on uh a European project called InDiCo , where they they have uh release , deliver , a full um kind of conference uh uh software. And uh to to manage uh all the the conference aspects uh uh we have in a conference automatically. And uh I know that at Fribourg they installed uh already in in a in a big uh amphitheatre for students. And I guess it's currently working."}, {"startTime": "446.27", "endTime": "446.64", "role": "D", "text": "Mm-hmm."}, {"startTime": "487.72", "endTime": "514.89", "role": "C", "text": "Ah no. Either just to uh in parentheses uh we didn't choose that um that solution because they had no um the the slides were not captured very uh in a very uh precise way. That's the point. Okay. Otherwise they uh it's fully automatic? Or have have you discussed with them? Did you discuss that? Is it fully automatic? You don't know?"}, {"startTime": "503.65", "endTime": "504.63", "role": "A", "text": "Mm-hmm. Mm."}, {"startTime": "504.5", "endTime": "504.91", "role": "D", "text": "Mm-hmm."}, {"startTime": "515.49", "endTime": "515.86", "role": "D", "text": "I don't know."}, {"startTime": "517.26", "endTime": "517.58", "role": "C", "text": "Okay."}, {"startTime": "518.65", "endTime": "527.46", "role": "A", "text": "Well I suppose uh I suppose they can capture things , right. I mean don't s I don't see why you could not capture the videos I mean with a card like this."}, {"startTime": "520.56", "endTime": "714.98", "role": "B", "text": "Uh I think Mm."}, {"startTime": "523.03", "endTime": "536.04", "role": "C", "text": "But the p i But i i it all synchronize and i is it doing all what we want but without the slide uh precision?"}, {"startTime": "533.84", "endTime": "534.13", "role": "D", "text": "Mm-hmm."}, {"startTime": "538.9", "endTime": "540.22", "role": "A", "text": "I don't know. I mean I don't know."}, {"startTime": "539.8", "endTime": "578.56", "role": "D", "text": "But l let be careful. There's one important point. The technical aspects of the way you acquire things should be driven by the kind of processing you want to have. So in our case we need to have a good processing of slides that in our case it means to transcribe with an O_C_R_ and then make indexing. We need to have high resolution image. I guess that's what you mean by precision , right? So in a sense that's the point. For us we need to have uh this sufficient resolution images of slides to do what we want to do. So that's why I guess we don't follow that solution. Because apparently yeah."}, {"startTime": "540.5", "endTime": "541.14", "role": "C", "text": "Okay , yeah."}, {"startTime": "560.81", "endTime": "561.13", "role": "C", "text": "Yeah."}, {"startTime": "576.27", "endTime": "589.96", "role": "C", "text": "And uh okay. And we are su and we are sure that in that uh context of SMAC project with uh um Fribourg working on document analysis uh there were not enough precision un enough resolution in the slides?"}, {"startTime": "586.3", "endTime": "586.59", "role": "D", "text": "Mm-hmm."}, {"startTime": "590.08", "endTime": "620.04", "role": "D", "text": "As far as I know so far uh they did similar works on meetings , document centred meetings. They always worked on manual transcriptions of documents. So they never really took into account a possibility of actually performing processing on the document they talk about during the meeting during in this case the uh the talk , the conference , the the th the presentation. As far as I know. As far as they published I kn I know the results they published uh so far."}, {"startTime": "599.15", "endTime": "599.46", "role": "C", "text": "Mm yeah."}, {"startTime": "605.51", "endTime": "605.79", "role": "C", "text": "Okay."}, {"startTime": "611.1", "endTime": "638.93", "role": "C", "text": "Talk conference. . Mm-hmm."}, {"startTime": "620.45", "endTime": "656.27", "role": "D", "text": "So essentially they n never took into account I mean the work at the high level , which means basically we have the information coming from here and there. And we n created techniques that allow to starts from the text there and the things that are said and w if we find context , I mean they make some kind of processing. But as they don't work on the low level so low level it means basically okay , take the speech and extract the transcription. I take the image uh of the document and I take the transcription. They basically don't really care of this aspect , as far as I understand , mm. As far as I know."}, {"startTime": "652.68", "endTime": "652.98", "role": "C", "text": "Okay."}, {"startTime": "654.42", "endTime": "728.52", "role": "A", "text": "Well as far as I as far as I know , I mean they do of course they can do of course slide detection. Change slide change detections which uh of course what I understood is also they try to recover the layout somehow. I mean given the slides but they are in no case they are extracting the text from the slides. So with in uh in uh all the cases what I've seen , in all the cases I've seen I mean they s assume that at least you have like a P_D_F_ version of the document or what. And basically they try to match what is displayed to the document. So first they need to extract the information from the document , which is not does not seem to be so trivial , at least for uh because they're also working with uh maybe more complex documents with images and text and so on. Maybe with slides it's ea it's easier to extract uh the information. I assume it's ea it's easier indeed. But they uh assume basically uh that they have this document , which is something somehow we would like to relax uh because uh people uh like in it's you may not want each time to ask the person. Maybe the person has a point point , not the not a P_D_F_ version. Or maybe he's using Excel to do a demonstration or something like this and we'll want to avoid this."}, {"startTime": "661.38", "endTime": "661.72", "role": "D", "text": "Mm-hmm."}, {"startTime": "662.07", "endTime": "662.39", "role": "C", "text": "Mm-hmm."}, {"startTime": "667.98", "endTime": "668.17", "role": "D", "text": "Yeah."}, {"startTime": "669.473", "endTime": "688.87", "role": "C", "text": ". Okay."}, {"startTime": "681.91", "endTime": "682.6", "role": "D", "text": "Exactly."}, {"startTime": "689.17", "endTime": "689.79", "role": "D", "text": "Exactly."}, {"startTime": "699.72", "endTime": "700.0", "role": "D", "text": "Yeah."}, {"startTime": "706.49", "endTime": "706.69", "role": "D", "text": "Yeah."}, {"startTime": "725.67", "endTime": "726.02", "role": "C", "text": "Mm-hmm."}, {"startTime": "727.27", "endTime": "756.28", "role": "D", "text": "Let's say that it makes uh less automatic in the sense that at point you need someone giving the file and putting the file upload in somewhere , et cetera. And it is a different kind of processing. Some way is always driven by w what you're able to do. They work a lot on layout analysis. I know they match uh uh the layout in two X_M_L_ files , et cetera. So it's a different way of approaching the problem , which means a different way of capturing different exigencies in in capturing the the documents , yeah."}, {"startTime": "728.02", "endTime": "738.93", "role": "C", "text": "To c to capture Mm-hmm. Yeah , yeah."}, {"startTime": "731.26", "endTime": "731.54", "role": "A", "text": "Mm."}, {"startTime": "746.48", "endTime": "746.65", "role": "A", "text": "Mm."}, {"startTime": "747.864", "endTime": "757.32", "role": "C", "text": ". Yeah , different requirements."}, {"startTime": "756.51", "endTime": "791.12", "role": "A", "text": "But but most you would say most most of the points for us I mean would be valid. I mean slide transition we would use slide uh need to do it slide transition. To some extent we would like to extract some elements of the layout to disting to have a more high analysis. But we would like to do this more automatically and in particular for the text recognition to do to be able to do retrieval uh of slides or points. I mean of parts of presentation. We would like not to have to rely , yeah , to a first P_D_F_ version or any version of the document. So yeah."}, {"startTime": "762.18", "endTime": "762.36", "role": "D", "text": "Yep."}, {"startTime": "763.29", "endTime": "764.28", "role": "D", "text": "Yeah. Yep."}, {"startTime": "769.12", "endTime": "769.36", "role": "D", "text": "Yeah."}, {"startTime": "770.93", "endTime": "771.35", "role": "C", "text": "Mm-hmm."}, {"startTime": "790.42", "endTime": "811.63", "role": "B", "text": "Okay. So the solution to that low quality is uh solved b by you project , the PAS project. Uh uh I make a tick here and I clean up this is just to to solve that pro that problem regarding the slide and the slide resolution. So we remove uh that part."}, {"startTime": "817.28", "endTime": "819.7", "role": "B", "text": "And we call that the PAS."}, {"startTime": "823.65", "endTime": "829.58", "role": "B", "text": "And in that case we use um a frame grabber here. And we go with the slide here."}, {"startTime": "832.4", "endTime": "855.47", "role": "B", "text": "And um of course these two cards will be on the same machine. And uh we have to develop a solution here. The main critical point is here. The synchronisation between these two uh these two cards. And with that this is the card that we use in the smart meeting room and this is uh the card the um."}, {"startTime": "855.24", "endTime": "859.3", "role": "A", "text": "So the c you have bought this card , right? I mean you say this is a card. No no."}, {"startTime": "857.48", "endTime": "869.26", "role": "B", "text": "Yeah , these one no no. Th uh this one is and this one the video card. And this one , this is uh the card that we have already at IDIAP for the sli Yeah , yeah."}, {"startTime": "865.27", "endTime": "865.58", "role": "D", "text": "Mm-hmm."}, {"startTime": "866.3", "endTime": "895.67", "role": "A", "text": "Yeah. But I mean this one is the I_V_C_. Okay. So what I want to say is on this card there are four inputs , right? Okay. Not n so enough uh well , yeah , yeah. I was thinking to some extent nothing would would prevent us uh from also acquiring the slide , but really the slide stream from from this card indeed. Right? Or Yeah."}, {"startTime": "867.14", "endTime": "867.2", "role": "C", "text": "Hmm."}, {"startTime": "868.13", "endTime": "870.97", "role": "D", "text": "I it's the same as as you have in the picture , yeah."}, {"startTime": "870.59", "endTime": "870.85", "role": "B", "text": "Yep."}, {"startTime": "874.02", "endTime": "874.25", "role": "B", "text": "Yeah."}, {"startTime": "875.67", "endTime": "924.13", "role": "B", "text": "Yeah. So Okay. Yeah , yeah. Yeah. So we can have both. We can have the slide from the slide capture and we can just use uh a video signal to to capture that also. To have two t uh mm you wants to ha do you have two quality h high quality and Yeah , we can just take some snapshots. Yeah."}, {"startTime": "899.57", "endTime": "902.98", "role": "A", "text": "Okay. To capture the slide. Yeah. Okay."}, {"startTime": "908.01", "endTime": "920.63", "role": "A", "text": "Well , I mean just because we cannot rec uh we can w something we cannot do with uh it seems for with the high q quality uh capture uh device is to have a stream. I mean the stream. Right , the full stream."}, {"startTime": "922.64", "endTime": "962.05", "role": "A", "text": "So we can tape snapshots. So basically it might be interesting to have still um uh the s uh the slide stream so that for instance if we detect there is a new video that is displayed also on , to some extent we could just cut this videos to keep it and to be able to replay it uh later on and so on. And maybe indeed if for instance the slide stream on the on the right is automatically synchronized with the other parts of the video , it may be easier to s to uh synchronize directly by some some matching process. The slides , the high quality measures we have here , we've directly yeah , yeah. Yeah."}, {"startTime": "934.93", "endTime": "935.14", "role": "D", "text": "Yeah."}, {"startTime": "937.33", "endTime": "937.51", "role": "B", "text": "Yeah."}, {"startTime": "940.27", "endTime": "941.56", "role": "B", "text": "Yeah. Yeah."}, {"startTime": "949.79", "endTime": "950.0", "role": "B", "text": "Yeah."}, {"startTime": "958.01", "endTime": "961.48", "role": "B", "text": "Yeah. With um this one. So yeah you won't yeah."}, {"startTime": "961.74", "endTime": "968.62", "role": "C", "text": "So you you would you c you can uh link like this? Mm-hmm , mm-hmm."}, {"startTime": "963.06", "endTime": "967.5", "role": "B", "text": "Yeah. Yeah. Something like like say something like that."}, {"startTime": "967.3", "endTime": "968.43", "role": "A", "text": "Yeah , exactly. Yeah."}, {"startTime": "967.98", "endTime": "969.28", "role": "D", "text": "Yeah. Yep."}, {"startTime": "970.11", "endTime": "1013.11", "role": "A", "text": "So at least uh this is not at the electronic level. But you would say as a contents from the content level , doing an alignment from the slide stream and from the snap-shots we would have on the other side w is something that might be possible. Of course if we have some , you know , some constraints given by the electronic , I mean it's that's better. Uh because of course first the process is going to be easier and it may be just a few signals that we have to align on the other parts. But I think I could see I could imagine that this could be a reasonable process to do. And it especially because this would solve some of the issues regarding I mean like the possibility of d of displaying videos after from from what we record. So yeah."}, {"startTime": "982.79", "endTime": "983.05", "role": "B", "text": "Yeah."}, {"startTime": "995.63", "endTime": "995.83", "role": "B", "text": "Yep."}, {"startTime": "1002.85", "endTime": "1003.76", "role": "B", "text": "Yeah , yeah. Ch yeah."}, {"startTime": "1006.81", "endTime": "1007.16", "role": "B", "text": "Video."}, {"startTime": "1009.76", "endTime": "1012.1", "role": "D", "text": "Yeah. Yep. Definitely."}, {"startTime": "1009.78", "endTime": "1009.95", "role": "B", "text": "Yeah."}, {"startTime": "1011.12", "endTime": "1011.55", "role": "C", "text": "Mm-hmm."}, {"startTime": "1013.49", "endTime": "1024.13", "role": "B", "text": "Okay. So uh I was just talking about the PAS project. Maybe I would like just now to talk about the DIVA project. So I clean up."}, {"startTime": "1028.35", "endTime": "1028.65", "role": "B", "text": "Yeah."}, {"startTime": "1031.01", "endTime": "1031.04", "role": "B", "text": "I."}, {"startTime": "1032.03", "endTime": "1032.2", "role": "B", "text": "There."}, {"startTime": "1033.64", "endTime": "1037.23", "role": "B", "text": "Um did you read something regarding the DIVA project?"}, {"startTime": "1038.88", "endTime": "1181.4", "role": "A", "text": "Well , this is more or less what we just discussed , right , if I understand So like the Diva project is a tape free , already smart meeting room , huh?"}, {"startTime": "1041.55", "endTime": "1063.32", "role": "B", "text": "In fa yeah , uh we just remember that here we we still have only one machine to do uh the slide , video and audio acquisition. And the DIVA it was uh something different. Fact we have a master machine that's um We have a master machine here. And we have some slaves machine here."}, {"startTime": "1046.82", "endTime": "1047.29", "role": "D", "text": "Mm-hmm."}, {"startTime": "1075.15", "endTime": "1136.0", "role": "B", "text": "We have some connection and here we have some input. We have audio. Usually we have audio. And And the same for this one. And um basically on the slave machine we have two cards , one for audio and one for video. So they develop something to synchronize these two cards together and th uh this is something which is it's more , w which is call uh direct show , uh which allows you to to synchronize uh these two cards together. And but of course you want these two streams to be synchronize. But you want also these two streams to be synchronized. So they have a synchronization between two slaves which is done by the master. Here we just use uh the et ethernet network to synchronize uh these two um these two device. Um I just write."}, {"startTime": "1129.13", "endTime": "1129.45", "role": "D", "text": "Mm-hmm."}, {"startTime": "1139.77", "endTime": "1198.67", "role": "B", "text": "Internet , something like that. And uh they do only audio and video. Uh they don't do any slide. Um Slide acquisition , yeah. Okay? So Yves asked for the DIVA. I would like just to talk now regarding uh the the fire-free smart meeting room at IDIAP. Do you have any question? Or uh. What yeah , tape free , sorry. Tape free smart meeting room. So for that I Yeah. It's yeah. It's a tape free but also video. Uh and the acquisition is done in raw video. So the file is huge and they really need uh um they have a long post-processing to convert raw file to uh DivX or to our own files."}, {"startTime": "1151.65", "endTime": "1152.66", "role": "D", "text": "Acquisition. Mm-hmm."}, {"startTime": "1164.66", "endTime": "1165.18", "role": "C", "text": "Tape free."}, {"startTime": "1165.34", "endTime": "1165.97", "role": "D", "text": "Tape free."}, {"startTime": "1167.34", "endTime": "1169.22", "role": "C", "text": "Tape free. D_V_ tape free."}, {"startTime": "1180.02", "endTime": "1180.56", "role": "C", "text": "Yes."}, {"startTime": "1191.43", "endTime": "1191.88", "role": "C", "text": "Mm-hmm."}, {"startTime": "1199.7", "endTime": "1204.36", "role": "A", "text": "Okay. But this can be done automatically , right? I mean is the okay."}, {"startTime": "1202.28", "endTime": "1210.95", "role": "B", "text": "Yeah , but it takes time. It it's just just to mention that. Uh so I will write."}, {"startTime": "1217.35", "endTime": "1222.12", "role": "C", "text": "And that's what you they use more or less in T_N_O_ also. They didn't have uh tapes."}, {"startTime": "1223.66", "endTime": "1225.37", "role": "C", "text": "But with different cards."}, {"startTime": "1225.56", "endTime": "1226.6", "role": "B", "text": "Yeah. Yeah , yeah."}, {"startTime": "1226.11", "endTime": "1227.33", "role": "A", "text": "So at T_N_O_ they have something?"}, {"startTime": "1228.19", "endTime": "1229.14", "role": "C", "text": "They had something."}, {"startTime": "1228.92", "endTime": "1235.45", "role": "A", "text": "Ah , okay. Okay. Yeah , okay. No. No , that's what I was thinking."}, {"startTime": "1230.92", "endTime": "1245.45", "role": "B", "text": "Okay. So maybe first I will just describe the ma the smart meeting room that we have at IDIAP. In fact we have uh also a master slave architecture. Um I clean a little bit."}, {"startTime": "1231.35", "endTime": "1232.25", "role": "C", "text": "For the AMI project."}, {"startTime": "1237.19", "endTime": "1237.41", "role": "C", "text": "Hmm."}, {"startTime": "1249.87", "endTime": "1255.52", "role": "B", "text": "We have the master P_C_ , which take ks uh which takes care about the audio."}, {"startTime": "1259.51", "endTime": "1270.16", "role": "B", "text": "I clean that. And we have the slave P_C_ which take cares about the white board and the slides."}, {"startTime": "1273.02", "endTime": "1296.36", "role": "B", "text": "Now if we look at the video If we look at the video in fact um yeah , maybe first I should mention that. Between the master and the slave we have um the mm a synchronization signal which is call time MIDI time code. I just write MIDI."}, {"startTime": "1291.51", "endTime": "1291.68", "role": "C", "text": "Yeah."}, {"startTime": "1298.49", "endTime": "1317.14", "role": "B", "text": "And for the video , we have the video input here. We re-use the um MIDI signal uh with um to insert the time code on each frame. And we save that to D_V_ recorder."}, {"startTime": "1321.76", "endTime": "1323.01", "role": "B", "text": "Uh I I have video."}, {"startTime": "1324.55", "endTime": "1358.52", "role": "B", "text": "Okay. Uh we know the problem of that that uh this is that after each meeting somebody has to take care about the D_V_ tapes and to t convert them into DivX. So my idea is to d do something like that , is to develop a s um um uh a video slave machine. May I say something like that , yeah , a video slave machine uh which use the MIDI um which use also the MIDI time code."}, {"startTime": "1325.56", "endTime": "1325.66", "role": "C", "text": "Mm-hmm."}, {"startTime": "1350.05", "endTime": "1350.44", "role": "D", "text": "Mm-hmm."}, {"startTime": "1361.16", "endTime": "1364.5", "role": "B", "text": "No , sorry. Sorry , I'm doing something wrong."}, {"startTime": "1369.46", "endTime": "1393.15", "role": "B", "text": "We have the video here. We just have the time code inserter. So we take that signal here and we move to this uh machine here , which is in fact just uh the I_V_C_ video card. This just an acquisition card. And we com and we s and we convert file directly to DivX. And um so we will have here video."}, {"startTime": "1384.0", "endTime": "1384.16", "role": "D", "text": "Mm-hmm."}, {"startTime": "1398.1", "endTime": "1422.91", "role": "B", "text": "And also because we want to control that machine we use also the MIDI time code the MIDI time code to start and to stop the machine. This is just something uh that uh this just to remove the D_V_ recordings. But um yeah. Just uh this just an improvement of the smart meeting room. Okay. Uh do you have any question uh regarding uh that?"}, {"startTime": "1424.8", "endTime": "1436.95", "role": "A", "text": "Yeah , so currently because there is a time code , uh video time code , you don't care about the frame dropping I mean because anyway , in each in the video signal , it is encoded the time , right?"}, {"startTime": "1437.07", "endTime": "1457.08", "role": "B", "text": "Yeah. We don't have to care about the synchronization in that case because the time code is ins serted here. And we take after the time code insertion we take the video signal and we pass through the machine. So uh this is uh a simple solution , but um where we don't have to care about the synchronization."}, {"startTime": "1444.16", "endTime": "1444.44", "role": "A", "text": "Yeah."}, {"startTime": "1446.95", "endTime": "1449.32", "role": "A", "text": "Yeah. Yeah , yeah. Yeah. Mm."}, {"startTime": "1457.53", "endTime": "1457.81", "role": "A", "text": "Okay."}, {"startTime": "1459.13", "endTime": "1468.11", "role": "C", "text": "Because the synchronization problem comes from the the grabbing from the D_V_ tape in in d in D_ Vix. So it's afterwards."}, {"startTime": "1462.63", "endTime": "1467.48", "role": "B", "text": "Co yeah. The synchronization is yeah."}, {"startTime": "1469.55", "endTime": "1507.83", "role": "A", "text": "Well , but you don't I mean at this point you don't really care because I mean in the signal you can extract the time. I mean the time stamp is i in the signal. So if you drop some frame , which happens sometimes when you do compression or acquisition uh you you uh ev you will automatically find this in uh the signal , right? I mean it's encoded in the in the image. So you can you can do it. Otherwise uh if there is some frame dropping , you have to rely on the number of frames you are counting more or less I suppose to to assess it. Uh so you have you have some problems then , yeah. Okay."}, {"startTime": "1477.18", "endTime": "1477.68", "role": "C", "text": "Mm."}, {"startTime": "1483.56", "endTime": "1483.85", "role": "B", "text": "Yeah."}, {"startTime": "1493.67", "endTime": "1494.0", "role": "B", "text": "Yeah."}, {"startTime": "1501.52", "endTime": "1501.75", "role": "B", "text": "Yeah."}, {"startTime": "1503.13", "endTime": "1504.91", "role": "C", "text": "Oh no , it's impossible , yeah."}, {"startTime": "1508.0", "endTime": "1521.51", "role": "B", "text": "Okay. So the f last one is uh the fire-wire acquisition. Uh I just Okay."}, {"startTime": "1516.4", "endTime": "1525.2", "role": "A", "text": "Which i which was more or less T_N_O_ S problem with respect to frame dropping , right?"}, {"startTime": "1525.32", "endTime": "1548.0", "role": "C", "text": "Mm they didn't have too much fun grabbing. The problem is was that it was not synchronized. So the time code was wrong for for the different videos. They had the uh uh at the beginning of the video , you if you saw the time code , it was six hours ni uh fifty minutes. And h there four hours thirty two minutes. So it's it was a problem with the time code."}, {"startTime": "1543.16", "endTime": "1543.32", "role": "A", "text": "Yeah."}, {"startTime": "1547.66", "endTime": "1564.05", "role": "A", "text": "Well I think if it was not a problem of frame dropping , the alignment would have been quite easy to to do. And the Really? Well , so it was not such a difficult process then."}, {"startTime": "1553.81", "endTime": "1568.8", "role": "C", "text": "Well , that's what they did uh manually after the afterwards. But they didn't have too much frame drops in fact. No , they d yeah , yeah , yeah , I'm sure. Because Well , it's manual to to synchronize it , the frame."}, {"startTime": "1568.09", "endTime": "1579.74", "role": "A", "text": "Yeah , but if it's only to find uh one of set , you have to find some exa some examples. But I I had the feeling that they had also some frame dropping that was uh no?"}, {"startTime": "1571.6", "endTime": "1572.81", "role": "C", "text": "Yeah , that's what they did."}, {"startTime": "1578.86", "endTime": "1584.49", "role": "C", "text": "No no , because uh we did the software here and it they didn't choo no our uh software."}, {"startTime": "1581.86", "endTime": "1584.62", "role": "A", "text": "Okay. Okay. Then that's fine."}, {"startTime": "1592.56", "endTime": "1629.94", "role": "B", "text": "Okay. Um in fact the the major problem regarding acquisition system is always the synchronization. And for that fire-wire is good. I mean fire-wire was a project. Now the project is uh stand-by. Uh we don't move to that project. I am but I am just going to talk about this one. Um so with acquisition with acquisition systems uh the major problem the major problem is uh the synchronization. And fire-wire gives you some um some way to be synchronize in fact."}, {"startTime": "1630.35", "endTime": "1696.14", "role": "B", "text": "Uh this is uh I just want to to describe here the bus. This uh yeah , this is of the bus where you can send you can send some package. And any device we which wants to send a package a p a packet , sorry , should ask um there is a manager of that bus. This just of the bus. Any device which wants to send a packet has to r to r uh require some uh band-width on the bus on the bus. And so after that he will have that band-width. And he will always have that band-width. So um yeah , he will always have that band-width. And so we are sure that we will have a synchronize acquisition with fire-wire. And so so that mean that um Yeah. Yeah. Sorry , sorry. Uh yeah."}, {"startTime": "1645.63", "endTime": "1646.14", "role": "C", "text": "Packet."}, {"startTime": "1692.65", "endTime": "1720.42", "role": "C", "text": "And this is no no no. . And this is done at the um you have libraries , et et cetera to to choo well uh a all you you are saying about uh asking about band-width , et cetera. It th when y uh you use a system um hardware. Yeah , yeah. So we don't have to code all the communication process , et cetera. So just for explanation."}, {"startTime": "1698.04", "endTime": "1698.74", "role": "B", "text": "Hardware."}, {"startTime": "1707.87", "endTime": "1812.45", "role": "B", "text": "It's i it's done by it's done by hardware. It's done by hardware. No no no no no. And in fact yeah. I I as I mentioned before , we have a bus manager and the bus manager send just a flag to say now it's time to give me you data , and all devices which have uh required some band-width will send the data. So I'm just drawing something like that. This is this kind of signal that the th bus manager is sending. And just after that bus just after that uh signal all device will send uh the data. So we will have the data from A_ , from B_ and from C_ and so on. And after the next one we will have again the um the data from A_ , B_ and C_ and so on and so on. And so with fire-wire we are sure to have a um an acquisition system. Now the major problem with fire-wire is that that fire-wire is just an kind of intelligent , uh a smart pipe. A synchronized pipe. We can put what we want inside. So we can put raw data , or we can send a DivX data , or we can send also uh what I uh was presenting in my term presentation was a H_ two six four. But in that case we need something uh hardware here to uncode raw data to a given format. Of course uh the idea is to reduce um the band-width on the bus also. And all data are sent through the master."}, {"startTime": "1716.98", "endTime": "1717.55", "role": "D", "text": "Hmm."}, {"startTime": "1816.49", "endTime": "1828.82", "role": "B", "text": "Do you have any quest Yeah."}, {"startTime": "1819.17", "endTime": "1853.71", "role": "D", "text": "Mm yeah. Now basically we have all this kind of general view about all the systems maybe we can take this opportunity to come back to our system. Because you know we had there are mm we had the long discussion and finally we decided for for one approach. And maybe take the opportunity to look just a moment uh at what point we are and w when we plan basically to get something uh done and working. I can add to that list of project is something that Jean-Marc and me we have found in the literature. There is F_X_ that is doing something very similar to to what we do here basically."}, {"startTime": "1832.13", "endTime": "1832.55", "role": "C", "text": "Mm-hmm."}, {"startTime": "1849.96", "endTime": "1850.4", "role": "C", "text": "Yes."}, {"startTime": "1854.4", "endTime": "1882.53", "role": "D", "text": "A capture through the projector signal of the slides and they for the moment they just plan to use the slides as a as a way to index the presentations. But but uh roughly is is an idea that is very similar to to our idea. So well essentially now we have the material as far I'm as I'm understood. Uh and it's up to you to tell us roughly when do you think uh we're gonna have something working."}, {"startTime": "1880.35", "endTime": "1938.73", "role": "C", "text": "Okay. Yeah. So we need uh well , this is will be done together t like in to to try to divide the time uh what do we do. Um we we don't want today to to put deadlines , you know. But um what we have , what we can do and how we will be able to do , I was thinking uh for instance uh in th in what we have um uh because I don't know a lot about um using uh like uh D_L_L_ , M_F_C_ , uh uh Microsoft software. But I'm very happy to to go with that. And uh so what we have until now is the software that Darren did for the frame grabbing. And and actually I c um I can start playing and uh looking at the this uh in detail."}, {"startTime": "1894.8", "endTime": "1895.11", "role": "B", "text": "Mm-hmm."}, {"startTime": "1928.57", "endTime": "1929.05", "role": "B", "text": "Mm-hmm."}, {"startTime": "1939.14", "endTime": "1939.48", "role": "D", "text": "Mm-hmm."}, {"startTime": "1940.62", "endTime": "1946.97", "role": "C", "text": "So Darren software About um frame grabbing."}, {"startTime": "1951.22", "endTime": "1987.04", "role": "C", "text": "Sup I suppose M_F_C_C_ no uh , not M_F_C_C_ but M_ e M_F_C_. You heard of that. And uh D_L_L_ , et cetera. The all the Windows uh uh pro programming. Um so this is one uh step. Then um the audio video card um so so uh first uh we need to look at this , to look at the demos that are uh i with the what they call the S_D_K_ uh software development kit."}, {"startTime": "1956.67", "endTime": "1957.03", "role": "B", "text": "Mm-hmm."}, {"startTime": "1963.73", "endTime": "1964.42", "role": "D", "text": "Issues , yeah."}, {"startTime": "1975.278", "endTime": "1982.94", "role": "B", "text": ". Yeah."}, {"startTime": "1988.55", "endTime": "1996.17", "role": "C", "text": "Uh demos , test. Um testing the card with uh only one audio for instance and then only one video."}, {"startTime": "1996.22", "endTime": "1996.52", "role": "B", "text": "Mm-hmm."}, {"startTime": "2001.62", "endTime": "2012.0", "role": "C", "text": "And e even uh testing with only the slides uh to capture all the uh like what you were saying , the the s uh the video s uh stream. Well , slide stream."}, {"startTime": "2008.87", "endTime": "2009.16", "role": "B", "text": "Yeah."}, {"startTime": "2012.95", "endTime": "2027.77", "role": "B", "text": "Uh in fact the um slide card l sorry. The slide card and the video card are both S_D_K_. So what Yeah. Both are S_D_K_."}, {"startTime": "2018.2", "endTime": "2025.95", "role": "C", "text": "The frame You mean the frame grabbing card? Yeah."}, {"startTime": "2027.76", "endTime": "2036.89", "role": "C", "text": "They have S_D_K_ uh software development kit that is based on uh M_F_C_ libraries and C_ plus plus libraries."}, {"startTime": "2030.16", "endTime": "2030.41", "role": "B", "text": "Yeah."}, {"startTime": "2033.73", "endTime": "2034.65", "role": "B", "text": "Yeah , y yeah."}, {"startTime": "2036.56", "endTime": "2068.2", "role": "B", "text": "Yeah , this for that you uh I don't remember by how. No. But Usually audio audio and video should be synchronized. Because uh this just an on an audio video channel. So uh they are synchronize. Um so we can play with the video. We can play with the slide. Uh and after that and the major point is to m combine both."}, {"startTime": "2039.17", "endTime": "2054.24", "role": "C", "text": "Okay. Okay. So once you we've tested the individually the card , we can test to synchronize the audio and the video together? Or is it no , it's synchronized? Or okay."}, {"startTime": "2058.18", "endTime": "2058.55", "role": "C", "text": "Okay."}, {"startTime": "2068.37", "endTime": "2099.59", "role": "C", "text": "Okay. And the i th now we are , as you said uh what not now but uh the next point would be to use that card with the other card and to merge the slide signal with the , well , um the s uh yeah , the synchronization signal coming from the frame grabbing card. It's uh it's it's not a synchronization signal , it's a slide with a t Oui oui. Yeah , we will."}, {"startTime": "2080.16", "endTime": "2080.38", "role": "B", "text": "Yep."}, {"startTime": "2095.81", "endTime": "2097.67", "role": "B", "text": "We we don't have synchronization."}, {"startTime": "2099.85", "endTime": "2110.07", "role": "B", "text": "We have to find a solution , and for that might be we can use uh direct show , which is a syn which is a technique to synchronize different device."}, {"startTime": "2110.18", "endTime": "2119.6", "role": "C", "text": "And is is it external to this card? It's external? Or it's i So it's external. It's not in this uh card."}, {"startTime": "2113.19", "endTime": "2125.54", "role": "B", "text": "No no. This is just uh an application , which i No , no , no , no , no. No. This not on the card. This just an application that runs on the machine."}, {"startTime": "2125.52", "endTime": "2130.56", "role": "C", "text": "And we don't have to buy that? Or well uh to to uh at least the basic."}, {"startTime": "2127.29", "endTime": "2146.72", "role": "B", "text": "Um f I think direct show you can download for free. I'm I'm not sure. M I should check. Or Yeah , it m yeah."}, {"startTime": "2136.5", "endTime": "2146.55", "role": "C", "text": "Okay. And that will will uh will be will help us to synchronize the this frame grabbing card and this video card."}, {"startTime": "2148.74", "endTime": "2158.95", "role": "C", "text": "So uh t yeah , we need to do some tests. Reading and yeah. Okay. And then when we have okay."}, {"startTime": "2160.75", "endTime": "2166.19", "role": "C", "text": "Where do we do that? He we don't know yet with Frank if we install this card maybe here."}, {"startTime": "2166.02", "endTime": "2187.56", "role": "B", "text": "I think the best thing to do is to have a machine just which is only dedicated to to that. Because uh if you if you if you if you use a machine which has been already used for something else sometimes you have plenty of libraries. And so you you don't know exactly. Maybe it would be better to have just a dedicated machine just for that."}, {"startTime": "2174.2", "endTime": "2175.66", "role": "C", "text": "Okay , and at IDIAP it's possible there."}, {"startTime": "2182.16", "endTime": "2182.59", "role": "C", "text": "Okay."}, {"startTime": "2187.21", "endTime": "2200.52", "role": "D", "text": "Mm careful because the uh I listened to Frank , and apparently don't want to buy a new machine before we show that this works. So we have to use material that is already available."}, {"startTime": "2193.03", "endTime": "2193.36", "role": "C", "text": "Mm-hmm."}, {"startTime": "2193.55", "endTime": "2197.2", "role": "B", "text": "Just for Okay."}, {"startTime": "2200.77", "endTime": "2201.08", "role": "B", "text": "Okay."}, {"startTime": "2201.03", "endTime": "2205.56", "role": "A", "text": "Yeah , but maybe there are already some machines , you know , uh uh."}, {"startTime": "2203.7", "endTime": "2210.92", "role": "D", "text": "Maybe there is some free ma machine that is not Okay , s so it is possible to use other machines actually , yeah."}, {"startTime": "2204.91", "endTime": "2208.26", "role": "C", "text": "Well on my machine , his machine or this machine maybe."}, {"startTime": "2207.49", "endTime": "2247.47", "role": "A", "text": "Uh Yeah , I mean just that , you know , if of course you don't want to have a c other libraries that may , you know , conflict with the one you are trying to use. At the same time , yo see , if you crash a machine I mean because you are doing some test , you may not want to have what's on your machine I mean to uh to be to be uh de erased or whats whatever. So I think it's so maybe there is a machine I don't know whether for this you need , you know , a very powerful machine and so on. But maybe there is a possibility to use a current machine which is only u yeah , that's is withdrawn from the network or yeah."}, {"startTime": "2207.96", "endTime": "2208.08", "role": "B", "text": "Mm."}, {"startTime": "2217.24", "endTime": "2217.55", "role": "D", "text": "Mm-hmm."}, {"startTime": "2223.52", "endTime": "2223.83", "role": "C", "text": "Yeah."}, {"startTime": "2225.87", "endTime": "2226.25", "role": "C", "text": "Yeah."}, {"startTime": "2225.89", "endTime": "2226.16", "role": "B", "text": "Yeah."}, {"startTime": "2229.74", "endTime": "2230.13", "role": "C", "text": "Okay."}, {"startTime": "2232.11", "endTime": "2232.47", "role": "C", "text": "issue."}, {"startTime": "2234.66", "endTime": "2234.96", "role": "D", "text": "Mm."}, {"startTime": "2241.34", "endTime": "2287.64", "role": "B", "text": "Yeah , yeah. I I Oui. Because Because I think um the video is done the video compression is done on the on that card and uh I'm not hundred percent sure , but I think the J_ PEG the J_ PEG conversion for the slide capture is done also on the card. So we don't need Ah yeah. Yeah. But I mean yeah. I was just thinking about the the speed of the computer could be lower."}, {"startTime": "2241.91", "endTime": "2244.13", "role": "D", "text": "Some of uh some other machine , yeah."}, {"startTime": "2254.22", "endTime": "2254.79", "role": "A", "text": "The card."}, {"startTime": "2255.35", "endTime": "2255.74", "role": "D", "text": "Mm-hmm."}, {"startTime": "2270.83", "endTime": "2281.23", "role": "A", "text": "Yeah. But still , I mean even if it's done on the card , you need to basic thing you need to check is um is a bus , right? I mean the bus writing , I mean the speed of uh the bus."}, {"startTime": "2288.24", "endTime": "2291.71", "role": "A", "text": "Yeah , yeah. Yeah , yeah , yeah. So C_P_U_ itself may not be so."}, {"startTime": "2293.56", "endTime": "2294.56", "role": "A", "text": "The access , yeah."}, {"startTime": "2294.97", "endTime": "2299.94", "role": "D", "text": "So mm in terms of time what we can think?"}, {"startTime": "2295.79", "endTime": "2298.38", "role": "C", "text": "So yeah. Uh uh mm."}, {"startTime": "2301.68", "endTime": "2353.1", "role": "D", "text": "When we can expect to see Christmas gift or early New Year gift. Uh But the way of course I'm I I don't know exactly what uh the work involves. So is this uh no that's not that I don't care. But uh I d I don't understand some way exactly. I think the the the real point is when."}, {"startTime": "2303.47", "endTime": "2329.43", "role": "A", "text": "So can we expect a Christmas uh gift? Uh Mm."}, {"startTime": "2309.56", "endTime": "2314.71", "role": "C", "text": "Yeah , Christmas two seven. No no. Um yeah , that's good question."}, {"startTime": "2315.14", "endTime": "2339.74", "role": "B", "text": "Maybe a first so solution will be just to start w with. Because we need to start with something. We have the slide capture from Darren. We have um I will work on the video acquisition for the inpu the tape free smart meeting room. So I will start with that to develop some knowledge regarding that board , uh that video board , and after that we can combine both."}, {"startTime": "2343.46", "endTime": "2351.0", "role": "C", "text": "Yeah , Alexandre did not care too much about the way uh you i no no no , but uh you are more in research."}, {"startTime": "2353.56", "endTime": "2364.42", "role": "C", "text": "Mm-hmm. Okay , I said at the beginning of the meeting that mm uh well we're not d doing deadlines. But uh yeah. Mm yeah. No , no. Yeah , yeah , yeah."}, {"startTime": "2358.85", "endTime": "2389.64", "role": "D", "text": "roughly. I mean I I don't say well no , no , no. I don't wanna put a deadline. Uh but uh given the current uh material we have um mm given your activities because I know that you both are involve in many other things. So it's something that you yeah , as Jean-Marc said , is Christmas and uh so we're happy with the Christmas gift. Or is something that you say is Christmas two thousand six. So I I I definitely just want to know something very rough on when you expect to finish this."}, {"startTime": "2367.53", "endTime": "2367.98", "role": "C", "text": "Mm-hmm."}, {"startTime": "2369.61", "endTime": "2371.37", "role": "C", "text": "Mm-hmm. Mm-hmm."}, {"startTime": "2392.03", "endTime": "2405.69", "role": "A", "text": "For instance I mean the test of looking at their entry goes point by point. So looking at their code I mean uh so you said you would look at this , right? Or is it okay."}, {"startTime": "2396.16", "endTime": "2396.66", "role": "C", "text": "Yeah."}, {"startTime": "2403.3", "endTime": "2422.72", "role": "C", "text": "Ye well , we would look both at. Because we are also both uh quite busy with other projects of course. Uh e H_F_E_S_ database uh with J_ Ferret uh Okay , this is between both."}, {"startTime": "2412.52", "endTime": "2430.43", "role": "D", "text": "That's problem. Uh that's that's a problem. I mean do you think it's something for the very next months? Do you think it's something for the end of next year? Do you think sp Mm. So is for so half next year."}, {"startTime": "2421.56", "endTime": "2429.55", "role": "B", "text": "No. For not for no no. This not for end of next year. It's too long. And it it's uh it's too long , it's too long."}, {"startTime": "2426.01", "endTime": "2426.82", "role": "C", "text": "Yeah , of course , yeah."}, {"startTime": "2433.18", "endTime": "2437.0", "role": "D", "text": "So June June June two thousand six."}, {"startTime": "2433.35", "endTime": "2438.89", "role": "B", "text": "For myself I would like to say uh April , May. April , May we should have results."}, {"startTime": "2439.67", "endTime": "2443.74", "role": "D", "text": "Re results , what does it mean? The end of this? So it works , it doesn't work."}, {"startTime": "2442.94", "endTime": "2455.21", "role": "B", "text": "Uh no no no. Uh I mean the um Uh not al almost uh the uh the the uh the complete application. Maybe some minor will appears."}, {"startTime": "2448.03", "endTime": "2449.08", "role": "C", "text": "Ready to be used."}, {"startTime": "2454.31", "endTime": "2495.11", "role": "D", "text": "You know , for for me what is important is when it is ready to be use. So when I can say start collecting data , uh I start using. I start playing with this. Basically the process is ready and we can start having our demo. And also because there is a risk that uh we submitted a project , maybe it will be rejected we don't know , but potentially we are going to have a student supposed to work in this. It will be no not before April two thousand six anyway. But uh you know , mm some way we we we we cannot have a students and make him wait one year before he has uh the material to work. So my point is when."}, {"startTime": "2457.4", "endTime": "2460.32", "role": "C", "text": "Yeah. So uh Data."}, {"startTime": "2480.54", "endTime": "2480.99", "role": "C", "text": "Mm-hmm."}, {"startTime": "2485.03", "endTime": "2486.09", "role": "C", "text": "Yeah , we yeah."}, {"startTime": "2489.08", "endTime": "2489.71", "role": "C", "text": "Yeah."}, {"startTime": "2490.34", "endTime": "2490.52", "role": "B", "text": "Yeah."}, {"startTime": "2492.91", "endTime": "2493.28", "role": "C", "text": "Mm-hmm."}, {"startTime": "2493.53", "endTime": "2493.69", "role": "B", "text": "Yeah."}, {"startTime": "2494.18", "endTime": "2494.51", "role": "A", "text": "'Kay."}, {"startTime": "2497.13", "endTime": "2506.37", "role": "D", "text": "Reasonably. Uh roughly , I don't don't don't wanna have and it's not a deadlines , oui. But when do you expect to have the system ready to work uh working. Yep."}, {"startTime": "2498.87", "endTime": "2499.24", "role": "C", "text": "Mm-hmm."}, {"startTime": "2499.43", "endTime": "2524.09", "role": "A", "text": "Well uh Because I mean I mean the I_V_C_ system , I mean it's uh i so my feeling is that I mean people have expertise in this , like in Fribourg also. So I mean I don't think it should take a lot of time I mean just to look at this , right. I mean at least one month seems to be uh quite enough for this , right."}, {"startTime": "2503.08", "endTime": "2503.6", "role": "C", "text": "Mm-hmm."}, {"startTime": "2514.72", "endTime": "2515.64", "role": "B", "text": "Yeah , yeah. Uh they have."}, {"startTime": "2522.46", "endTime": "2538.03", "role": "B", "text": "Yeah , th it's a yeah. But we start with the I_V_C_. We start with the data path. Uh the the slide frame grabber. And after that is and the question is how to synchroni to to to make both card working together."}, {"startTime": "2529.14", "endTime": "2530.57", "role": "A", "text": "Yeah? Yeah."}, {"startTime": "2534.8", "endTime": "2535.27", "role": "D", "text": "Mm-hmm."}, {"startTime": "2537.9", "endTime": "2541.87", "role": "D", "text": "Together. So this seems to be the main problem as far as as I understand."}, {"startTime": "2538.6", "endTime": "2538.83", "role": "A", "text": "Yeah."}, {"startTime": "2540.36", "endTime": "2540.64", "role": "B", "text": "Yeah."}, {"startTime": "2541.38", "endTime": "2575.04", "role": "C", "text": "So yeah. Let's see. From fro for checking Darren's code , et cetera we can expect until uh And yeah , for o one months or so , then uh the uh the i uh I_V_C_ uh w with the people at Fribourg have uh yeah , okay , so uh at Fribourg we we have Mm-hmm."}, {"startTime": "2554.03", "endTime": "2554.21", "role": "A", "text": "Yeah."}, {"startTime": "2557.79", "endTime": "2561.41", "role": "B", "text": "Uh I_V_C_ I_V_C_ should go faster."}, {"startTime": "2561.87", "endTime": "2573.97", "role": "A", "text": "Yeah. Because anyway , this is what you are working on , right? Is the I_V_C_ , but using the signals that are coming I mean so basically it's using the I_V_C_ okay."}, {"startTime": "2571.19", "endTime": "2582.51", "role": "B", "text": "Yeah. I will uh I'm not currently working on it. I will start to work on January on that point. So uh but I think No no. I'm not working."}, {"startTime": "2577.42", "endTime": "2580.57", "role": "C", "text": "Okay. And then the direct show. Or yeah."}, {"startTime": "2578.97", "endTime": "2579.33", "role": "D", "text": "Mm-hmm."}, {"startTime": "2579.65", "endTime": "2581.5", "role": "A", "text": "Okay , so currently you are not working on this."}, {"startTime": "2583.51", "endTime": "2704.39", "role": "A", "text": "Okay , then we need Yeah , that that's that's so that's one of the issue I mean that uh maybe uh,I don't know w whether you realise , but of course if we have this in two years , maybe okay , it's good we have it. But of course it's it's on the it's too long I mean in terms of in term of research , in terms uh maybe even in terms of innovation I mean if you think about this , which is , you know , what uh they said. I mean he was speaking about innovation. This is probably one , an innovation."}, {"startTime": "2584.07", "endTime": "2643.22", "role": "B", "text": "I schedule to to work on that from m Yeah. But I have also a que Mayb But I would like to say uh there is many unknown in that project. But I would like to say we can make uh uh a schedule of that project to just to track to just to see if we track the time table. If we don't we we asks for more people , maybe H_E_V_S_ people , to to to be slightly involved in that project , to be to to respect the date."}, {"startTime": "2587.37", "endTime": "2590.17", "role": "C", "text": "So we can say we try to to make something for April."}, {"startTime": "2591.65", "endTime": "2627.03", "role": "D", "text": "Uh make something re that you are using very vague expression. Result , make something. Just just uh just tell me when it is ready. And if you think it's it's not before uh but but must be reasonable I m I mean if you think it will be not before December two thousand six , say December two thousand six. So don't try to tell me March or April i w if you already know that it is unrealistic to say that. Must be realistic. you say June two thousand six we know it is June two thousand six. Uh I know."}, {"startTime": "2591.86", "endTime": "2603.47", "role": "C", "text": "But uh well I I want this to to work in the for the time uh in the mm-hmm. Mm."}, {"startTime": "2608.2", "endTime": "2608.3", "role": "C", "text": "Mm."}, {"startTime": "2617.23", "endTime": "2617.5", "role": "C", "text": "Mm-hmm."}, {"startTime": "2623.9", "endTime": "2624.79", "role": "C", "text": "Uh i mm-hmm."}, {"startTime": "2627.27", "endTime": "2630.68", "role": "C", "text": "The Mm-hmm."}, {"startTime": "2628.89", "endTime": "2634.03", "role": "D", "text": "Sure. Sure. But Mm-hmm."}, {"startTime": "2635.93", "endTime": "2636.26", "role": "C", "text": "Mm-hmm."}, {"startTime": "2636.46", "endTime": "2636.77", "role": "D", "text": "Mm-hmm."}, {"startTime": "2640.37", "endTime": "2643.16", "role": "C", "text": "O one student or yeah."}, {"startTime": "2643.06", "endTime": "2681.76", "role": "D", "text": "Yeah. Well but there is no day to respect. It's just to know I mean and if you can have early early warnings in the sense that if you see that there is a major uh problem somewhere. But is just to know in the sense that really uh this p this mm thing has been stop now for quite a long time. Uh uh it n it took a long time to decide what kind of material. Now we have it. It's something that uh is a pretty good idea. We see that other people are working , et cetera. We are going to lose it some way if uh if we don't put some and very honestly yeah."}, {"startTime": "2645.96", "endTime": "2662.3", "role": "B", "text": "Yeah. N Yeah."}, {"startTime": "2651.99", "endTime": "2652.32", "role": "C", "text": "Mm-hmm."}, {"startTime": "2662.08", "endTime": "2662.56", "role": "C", "text": "Mm-hmm."}, {"startTime": "2676.8", "endTime": "2680.75", "role": "C", "text": "And we can ask help uh Mm-hmm."}, {"startTime": "2689.42", "endTime": "2690.03", "role": "B", "text": "It's too long."}, {"startTime": "2689.88", "endTime": "2703.82", "role": "D", "text": "I i it'll it'll not be This is innovation , yeah."}, {"startTime": "2690.43", "endTime": "2694.56", "role": "C", "text": "I it's too late in terms of research uh mm."}, {"startTime": "2696.38", "endTime": "2696.74", "role": "C", "text": "Mm-hmm."}, {"startTime": "2696.58", "endTime": "2696.72", "role": "B", "text": "No."}, {"startTime": "2700.61", "endTime": "2701.13", "role": "C", "text": "Mm-hmm."}, {"startTime": "2704.34", "endTime": "2704.56", "role": "B", "text": "Yeah."}, {"startTime": "2704.66", "endTime": "2767.67", "role": "A", "text": "And the the I know I'm we we see quite well why is working on this , right. But in two years , you know , if we want to do if we want to build a C_T_I_ or transfer technology and something like this , you know , maybe you c of course , okay , people will say yeah , but there is already something that people have started to put on the market and so on. So it maybe not the it's it's too late uh to to do it. So I think this is really so this is one of the points , respect to research of course , it's I think it's going to appear more more and more , and uh Yeah."}, {"startTime": "2705.93", "endTime": "2706.39", "role": "C", "text": "Mm."}, {"startTime": "2721.8", "endTime": "2722.19", "role": "B", "text": "Yeah , yeah."}, {"startTime": "2723.59", "endTime": "2723.77", "role": "B", "text": "Yeah."}, {"startTime": "2737.56", "endTime": "2841.03", "role": "D", "text": "Uh you know in a sense I never tried for example eventually to ask for one person dedicated to this because I always had the feeling that you are very interested , you wanted to do it , it's something you some way you uh I mean it seems to be something that is interesting to you. But uh if you have not the time and the possibility to do it because you you both are involved in many other things , we can eventually try to ask to have one person , to involve one person that will be dedicated strictly to this. We can try. I mean we can ask uh uh in the sense that if it is a priority for IDIAP so far we would get very good signals from that point of view , I I don't know. But uh please , if you think you don't have the time or the energy to do it , uh or it involves too many things that you cannot keep under control given the other things you have to do , uh don't think that okay , something nice we we can wait or sooner or later it will happen. Uh yeah. Exactly. So I think it's the moment uh for you to really realise try to to have a realistic uh date. And if you think there are too many things that you risk to lose control , uh tell it now. And we can try to say well we want to do it , but uh basically Mael and Olivier were the person mm-hmm. No , no. But but you can be involve in a different way. I mean you can eventually have uh a supervision role in the sense that you think that I I know how to do it , I like to do it , but I have no time. Because at a certain point it's a matter of time. We can try to to ask. Uh but uh please just don't keep this as a kind of thing , yeah , I like to do it , I like it , it's nice , et cetera."}, {"startTime": "2743.52", "endTime": "2743.71", "role": "C", "text": "Hmm."}, {"startTime": "2751.45", "endTime": "2751.86", "role": "C", "text": "Mm-hmm."}, {"startTime": "2752.9", "endTime": "2753.21", "role": "B", "text": "Mm-hmm."}, {"startTime": "2758.23", "endTime": "2758.65", "role": "C", "text": "Mm-hmm."}, {"startTime": "2763.79", "endTime": "2763.96", "role": "C", "text": "Hmm."}, {"startTime": "2771.69", "endTime": "2771.98", "role": "C", "text": "Mm-hmm."}, {"startTime": "2779.9", "endTime": "2780.22", "role": "C", "text": "Mm-hmm."}, {"startTime": "2790.94", "endTime": "2803.16", "role": "C", "text": "No no no no. We understand that you we cannot wait uh we were here one year ago uh , I don't know , and also when it's was uh going uh the idea was appearing and Mm-hmm."}, {"startTime": "2811.49", "endTime": "2811.72", "role": "C", "text": "Mm-hmm."}, {"startTime": "2813.75", "endTime": "2814.09", "role": "C", "text": "Mm-hmm."}, {"startTime": "2815.36", "endTime": "2815.79", "role": "B", "text": "Mm-hmm."}, {"startTime": "2816.13", "endTime": "2816.57", "role": "A", "text": "Mm."}, {"startTime": "2816.9", "endTime": "2822.87", "role": "C", "text": "Okay. Personally I want to be involve in that project. A acquisi uh some mm."}, {"startTime": "2825.26", "endTime": "2825.8", "role": "C", "text": "Mm."}, {"startTime": "2829.36", "endTime": "2829.76", "role": "C", "text": "Mm-hmm."}, {"startTime": "2832.11", "endTime": "2832.48", "role": "C", "text": "Mm-hmm."}, {"startTime": "2832.18", "endTime": "2832.49", "role": "B", "text": "Mm-hmm."}, {"startTime": "2838.43", "endTime": "2840.36", "role": "B", "text": "Yeah , yeah. Yeah."}, {"startTime": "2840.18", "endTime": "2854.55", "role": "A", "text": "Yeah. Because when when you say here now no , I'm not going to start to working on this before January , for me this surprises me to some extent , you know , I'm uh I thought I mean you would you would be working on this. So if you say okay , now it's uh yeah."}, {"startTime": "2847.87", "endTime": "2848.11", "role": "D", "text": "Yeah."}, {"startTime": "2852.15", "endTime": "2857.81", "role": "B", "text": "Yeah. But uh at the same time I have some other project I I want to finish uh those project first."}, {"startTime": "2856.99", "endTime": "2864.14", "role": "D", "text": "Yeah , bu but but here you have to take a responsibility. You can't say I like to do it and but then ah but I will do it when I can."}, {"startTime": "2860.52", "endTime": "2861.33", "role": "A", "text": "No , uh oui."}, {"startTime": "2863.34", "endTime": "2886.01", "role": "A", "text": "No , I mean the point is that Olivier will r you have I mean s since one year uh you have always been saying that you want to be involved in this and so on. So it seems that it has never been a priority. So that that's uh that's the point. So if you have no time to put priority at some points and this seems to have been the case during one year on this project , I mean you need to say it now. I mean that's the point now."}, {"startTime": "2865.27", "endTime": "2865.33", "role": "C", "text": "Mm."}, {"startTime": "2873.68", "endTime": "2874.2", "role": "D", "text": "Exactly."}, {"startTime": "2883.98", "endTime": "2972.02", "role": "B", "text": "But for example , I have uh I receive some new project. I said that I have no time yet. I say I have no time gi now currently I um I say some for some project you say that you don't have time. But people will stay will continue to say no no , you will find time just to do that project. The Yeah."}, {"startTime": "2884.13", "endTime": "2884.39", "role": "C", "text": "Mm."}, {"startTime": "2890.73", "endTime": "2892.97", "role": "D", "text": "Mm-hmm. Uh yeah yeah yeah.."}, {"startTime": "2892.66", "endTime": "2893.03", "role": "C", "text": "Mm-hmm."}, {"startTime": "2894.3", "endTime": "2896.02", "role": "D", "text": "Okay , this is yeah."}, {"startTime": "2900.93", "endTime": "2901.25", "role": "D", "text": "No , no."}, {"startTime": "2903.74", "endTime": "2916.11", "role": "D", "text": "Okay so now is your responsibility to say I cannot find time. If you can't find time , you have to say it now. And this is also for you. I mean i it's not an accusation. We we are all in the same condition."}, {"startTime": "2904.12", "endTime": "2904.53", "role": "C", "text": "Mm-hmm."}, {"startTime": "2905.26", "endTime": "2953.78", "role": "A", "text": "So this is Franck At least uh say this to us and we'll see uh with Franck. And again , I mean this is a question. So now you are saying you have no time. So now you say to us. So now we understand and we are maybe after , when we if we discuss with Franck uh Franck Crittin or uh uh Frank uh Formaz and we'll see okay and go and try to see. Okay apparently uh he has no time to to work on this. So we think it's important and we'd like to to do something. So what kind of solution , as Alexandre mentions , i do we need to take somebody , do we want to do we need to take some intern to work on this , uh and so on and so on. Do we take to have uh somebody uh for contract , even if it's not an intern but take somebody for six months to work on this."}, {"startTime": "2911.72", "endTime": "2912.38", "role": "C", "text": "Hmm."}, {"startTime": "2924.99", "endTime": "2925.32", "role": "D", "text": "Mm-hmm."}, {"startTime": "2939.52", "endTime": "2940.12", "role": "D", "text": "Exactly."}, {"startTime": "2942.37", "endTime": "2942.79", "role": "C", "text": "Mm-hmm."}, {"startTime": "2949.48", "endTime": "2949.76", "role": "D", "text": "Mm-hmm."}, {"startTime": "2949.68", "endTime": "2950.12", "role": "C", "text": "Mm-hmm."}, {"startTime": "2954.41", "endTime": "3284.22", "role": "A", "text": "I mean but so this a point. I mean uh y I don't know about the other projects you have to do. I don't know with who you are discussing about the time you are you can s uh s spend on each of the project. But if y because now you are just telling us you have no time indeed to work on this , right? Okay , so so okay. Yeah , but I mean c it's yeah , but Well I mean uh I mean you have people that are aware of uh M_F_C_ , I mean I mean people uh I suppose at H_U_V_ there are some people uh where I was in Le Mans in the U_ B_ uh I mean there uh would be obviously some some students uh that would be aware of and that could be able to handle this. I mean they are working with software and hard both our software and hardware. Uh I'm I'm sure the s se Because uh so so Olivier says it's not before January on his side. So I'm not sure about uh on your side , whe what's your yeah."}, {"startTime": "2961.57", "endTime": "2961.88", "role": "C", "text": "Mm-hmm."}, {"startTime": "2966.68", "endTime": "2967.14", "role": "C", "text": "Mm-hmm."}, {"startTime": "2972.76", "endTime": "2973.02", "role": "C", "text": "Mm-hmm."}, {"startTime": "2973.13", "endTime": "3022.13", "role": "D", "text": "S s So let me pose the question very broadly. Do you think that we have a person that has this will help you? We can ask , we can try to ask maybe if some person for six months so that your role is simply to help and advise."}, {"startTime": "2974.3", "endTime": "3074.69", "role": "B", "text": "Currently but uh up to December I don't have time to work on it. But I plan already. I I um with I_M_ two I I I did uh I mention that I will have from January two thousand six I will have time for that. Uh I have a No , I will work fully on that on this point. From January two thousand six I wi Maybe a good thing will be to make a plan to to we say we we won't set the deadline here. We are here. We split that part in different segments. Uh y Yeah."}, {"startTime": "2981.92", "endTime": "2983.96", "role": "C", "text": "With I_M_ two , I_P_ one. Mm-hmm."}, {"startTime": "2991.06", "endTime": "2993.97", "role": "C", "text": "Fifty percent on on I_M_ two , that's it."}, {"startTime": "2999.85", "endTime": "3004.68", "role": "C", "text": "It's fifty percent , no? On I_M_ two I_P_ one? Okay , maybe in fifty percent uh on that."}, {"startTime": "3008.91", "endTime": "3009.15", "role": "C", "text": "Mm-hmm."}, {"startTime": "3022.25", "endTime": "3022.68", "role": "C", "text": "Mm-hmm."}, {"startTime": "3024.97", "endTime": "3025.95", "role": "D", "text": "We can try to ask."}, {"startTime": "3024.99", "endTime": "3050.82", "role": "C", "text": "Why this was , yeah , mo yeah w I don't want to talk too much maybe. Uh but uh with Sebastien , sorry this was maybe uh his concern. And yeah , Bastien is busy with uh annotations plus all kind of things. Uh maybe we can in the process we can ask for someone more."}, {"startTime": "3043.98", "endTime": "3057.108", "role": "D", "text": "I mean."}, {"startTime": "3052.9", "endTime": "3053.68", "role": "C", "text": "To work on that."}, {"startTime": "3056.38", "endTime": "3094.36", "role": "C", "text": "Well uh uh that's what I I was Y That's what I was trying to do and I before coming here I just tried to to make uh uh a plan. But I don't answer , yeah. W well the let's say uh April O_ six and uh we do uh our best with uh trying to keep you inform with the advancements. And if we see early that clearly uh there i Mm-hmm."}, {"startTime": "3058.29", "endTime": "3075.58", "role": "D", "text": "S I'm sorry , but you still don't answer to my my question. You are not answering my question. Yeah."}, {"startTime": "3086.98", "endTime": "3104.42", "role": "D", "text": "Let me pose again the question very clearly. If I go to Herve , I can try and say we are in this situation apparently. Why don't we take one person three months , six months , four months that directly advised by Olivier and uh and we can speed up."}, {"startTime": "3102.58", "endTime": "3113.81", "role": "C", "text": "And it should be someone with experience in C_ plus plus M_F_C_. Uh Yeah. Or a student."}, {"startTime": "3108.29", "endTime": "3114.6", "role": "D", "text": "Consider that it can be difficult of course to find them et cetera and so on. Do you think it's an option?"}, {"startTime": "3116.47", "endTime": "3116.8", "role": "D", "text": "Mm-hmm."}, {"startTime": "3117.92", "endTime": "3118.28", "role": "C", "text": "Mm-hmm."}, {"startTime": "3120.41", "endTime": "3124.05", "role": "D", "text": "At each. Yeah , I think there are people yeah."}, {"startTime": "3121.13", "endTime": "3122.4", "role": "B", "text": "Yeah , the yeah."}, {"startTime": "3123.79", "endTime": "3124.26", "role": "C", "text": "Mm-hmm."}, {"startTime": "3131.29", "endTime": "3131.61", "role": "C", "text": "Mm-hmm."}, {"startTime": "3134.77", "endTime": "3135.14", "role": "C", "text": "Mm-hmm."}, {"startTime": "3135.48", "endTime": "3166.58", "role": "D", "text": "Do you think it's a reasonable option? Do you think it's something that uh can help you? Because that's just a matter of responsibility for you guys to but there is nothing bad if you say you have other things to do. Because we are all uh full of work. This is something that is added on the top. Uh if you don't have time you don't have time , guys. I mean this is uh but please just tell me. We will find the time however. So April O_ six you will have your system. Or no we are not sure. We don't really know."}, {"startTime": "3151.88", "endTime": "3152.25", "role": "C", "text": "Mm-hmm."}, {"startTime": "3167.47", "endTime": "3209.35", "role": "D", "text": "Uh it can happen that we don't. We don't know what you are going to find on the way. Maybe we think it takes one week and then it takes one month. Uh w we don't know. Uh maybe we will s we wi will not able to be continuous. Because one of the wrongest thing is to work one week , then one month , no , et cetera. That's it's something that breaks. I mean difficult , huh? Mm so that's the point. So that which doesn't mean you are excluded f from the thing in the sense that in any case someone will ask will have to advise the person eventually. And it can't be him , it can't be me. It can be you that basically follow , advise , helps. But at least the mass of the work will be done by someone else that can spend a hundred percent of time on that."}, {"startTime": "3175.69", "endTime": "3176.05", "role": "B", "text": "Mm-hmm."}, {"startTime": "3182.93", "endTime": "3183.35", "role": "B", "text": "Mm-hmm."}, {"startTime": "3182.93", "endTime": "3183.36", "role": "C", "text": "Mm-hmm."}, {"startTime": "3190.52", "endTime": "3191.02", "role": "C", "text": "No , no , no."}, {"startTime": "3192.96", "endTime": "3193.15", "role": "C", "text": "Mm-hmm."}, {"startTime": "3209.85", "endTime": "3274.47", "role": "D", "text": "Now it's not even guaranteed in the sense that I can ask this. I can say that well this is the situation and uh you are. Or eventually yeah , someone can say okay now this become your priority. Forget about everything else and go with that. I don't know. Or will tell you okay , uh January two thousand six , but from January two thousand six you do nothing else than this. You know , w we can find the time , whether it is your time , whether it is the time of someone else. But uh I really would like to stop with this because this has been for several months that you say we like , we want. And I'm sure , I believe you. But then it is always something that must be done outside uh the uh normal activity. Um I'm uh I'm sorry. Yeah. But but uh otherwise I mean , as you say , to do it in two years p So what do you think? You like that I try to to to solve this problem and try to say that there is a time problem and you don't have the time to do it?"}, {"startTime": "3213.09", "endTime": "3213.47", "role": "C", "text": "Mm-hmm."}, {"startTime": "3214.24", "endTime": "3214.34", "role": "C", "text": "Hmm."}, {"startTime": "3234.32", "endTime": "3234.43", "role": "B", "text": "No."}, {"startTime": "3251.82", "endTime": "3259.71", "role": "B", "text": "No , no , no. Yeah. Yeah. Which is really bad. Yeah. I I understand exactly. Yeah , yeah , yeah. No , I understand. Yeah."}, {"startTime": "3254.212", "endTime": "3259.13", "role": "C", "text": ". Mm-hmm."}, {"startTime": "3263.56", "endTime": "3264.08", "role": "B", "text": "Yeah , yeah."}, {"startTime": "3266.37", "endTime": "3403.85", "role": "B", "text": "What Yeah. But I think yeah , that will be good , just to have a plan and to have some deadline in that plan. And as soon as we we we as soon as we we we are not in time , we we we con Yeah."}, {"startTime": "3282.27", "endTime": "3289.88", "role": "C", "text": "Well I would like to to to work on p kind of part time uh uh w o yeah. Yeah."}, {"startTime": "3286.9", "endTime": "3289.63", "role": "A", "text": "Like what? One day a week , uh something like this?"}, {"startTime": "3291.64", "endTime": "3329.85", "role": "C", "text": "And one full day a week. And I would okay , maybe you won't like my answer but I would say that um we ch we we start but we h we really have to start on working wi uh reading all the code from Darren. Then this um card with the code , I_V_C_ card , and to to try this. Then we try a little bit direct show to see um uh to to have an idea of how how long uh that could be. And then at the moment we can say okay we need someone to help us."}, {"startTime": "3329.98", "endTime": "3378.82", "role": "D", "text": "Okay. But that can be. But uh Yeah. Yeah. Yeah."}, {"startTime": "3332.26", "endTime": "3456.45", "role": "A", "text": "But Because uh because there are there are several issues I would say. Like if there would be a machine like this , with the two cards separated as I mention. I mean if we record le the flow of the video for instance and the snap-shots from the slides to some extent there is some possibility of doing some automatic alignment without having a special , you know , synchron so this means that to some extent we could have a device which would not yet be fully synchronized and , I don't know , we've uh you know very well done uh code in terms of sending signals and so on. But that might be sufficient , because I mean it synchronize up to , don't know , five seconds. And you would say five seconds may seem a lot for audio and video. But maybe f respect to slides and the rest is not is something that may be tolerable. So still we would be able to start doing some recordings and maybe uh doing even the automatic alignment , or at least we would have an idea about , you know , what are the problems in terms of alignments. Uh do do because it's not like with microphone arrays where you would need micro-second alignments , of course. Uh or even maybe with we want video where it may be one or two frames , I don't know. So this is really some somehow I mean the uh the the issue , I mean I'm sure that there are plenty of possibilities to do things. And the goal would be that indeed we could start uh rec doing some of the recordings of the time so that indeed we would already we uh we would have uh something where uh we could uh start getting the data. Because after , I mean even if it there , we cannot put all the times in one week , right. I mean so and uh so I mean this is uh this is one of the issue as well , which is to have it so that we can play and we can make a nice demo and so on with the full uh thing and something. So f the other part is to have a system which from which we can already record data and with some approximation."}, {"startTime": "3337.03", "endTime": "3446.75", "role": "C", "text": "Well , w uh let's do that. Let's do that. Okay. Fo Mm-hmm."}, {"startTime": "3384.49", "endTime": "3386.64", "role": "D", "text": "It can be tolerable , yeah. Yeah."}, {"startTime": "3390.34", "endTime": "3391.23", "role": "D", "text": "Exactly."}, {"startTime": "3412.16", "endTime": "3413.34", "role": "D", "text": "It's a very good idea , yeah."}, {"startTime": "3424.94", "endTime": "3430.11", "role": "B", "text": "Yeah , and to improve the system like Mm-hmm."}, {"startTime": "3426.88", "endTime": "3427.18", "role": "D", "text": "Mm-hmm."}, {"startTime": "3437.0", "endTime": "3437.27", "role": "B", "text": "Yeah."}, {"startTime": "3438.26", "endTime": "3438.54", "role": "D", "text": "Mm-hmm."}, {"startTime": "3456.79", "endTime": "3497.04", "role": "A", "text": "And I have the feeling , given the descriptions that you made , that to have such a system wouldn't require a six months of work because basically their own code is there to some extent and uh the I_V_C_ is something quite standard from which we could ask I mean even we could even pay maybe pro some people from Fribourg , I don't know , I mean to come here and to and to help us with the installation on a computer and uh and uh to to to get the so I have more the feeling that this is something that could be done almost in one month. Again , I'm not speaking about the synchronization I mean as Yeah , I mean the two yeah , yeah."}, {"startTime": "3456.79", "endTime": "3457.01", "role": "B", "text": "Yeah."}, {"startTime": "3475.47", "endTime": "3475.7", "role": "B", "text": "Yeah."}, {"startTime": "3478.14", "endTime": "3480.43", "role": "C", "text": "Mm-hmm. Mm-hmm , yeah."}, {"startTime": "3480.95", "endTime": "3505.29", "role": "C", "text": "To So without direct show you mean the frame grabbing signal and time alignment? Uh wi that would be done uh in like in common software that we have uh afterwards?"}, {"startTime": "3492.0", "endTime": "3492.24", "role": "D", "text": "Yep."}, {"startTime": "3497.22", "endTime": "3537.76", "role": "B", "text": "Yeah. And we Yeah."}, {"startTime": "3503.48", "endTime": "3510.54", "role": "A", "text": "Yeah , the for instance a simple question maybe you can are we sure that it can work on a single computer? I don't know."}, {"startTime": "3514.67", "endTime": "3546.78", "role": "A", "text": "I don't know. I mean is there any uh issues with respect to this? So this is yeah. So it doesn't require it it's more testing it does not require so for this we I mean if you put the two cards on the computer , you put the two then you you basically you say play on the both sides and you look whether at the end you have uh a recorded signals which is is is uh the time that it should uh be and uh or whether I mean the fact that whenever I mean the slides is doing some uh processing uh it there is some and there is some frame drops or things like this."}, {"startTime": "3515.79", "endTime": "3520.73", "role": "C", "text": "Okay th and this point is about testing and uh yeah. Okay."}, {"startTime": "3517.62", "endTime": "3592.95", "role": "D", "text": "Uh i no. Let me That seems to me clear. Until January is uh is busy. So So yeah. Just to go to a conclusion , because apparently yeah. So it can't work uh yeah , exactly. Can't work uh until January. So it's up to you. It's up to you to evaluate , yeah."}, {"startTime": "3546.0", "endTime": "3546.18", "role": "B", "text": "Yeah."}, {"startTime": "3546.17", "endTime": "3564.62", "role": "C", "text": "So you could say okay , let's for Christmas let's try this without the all the synchronization. Uh with direct show issue. Okay oh yeah , you are you cannot or o l uh by doing one one day a week , mm you know just I think the cards."}, {"startTime": "3549.8", "endTime": "3577.72", "role": "A", "text": "So this is uh Ah."}, {"startTime": "3555.97", "endTime": "3556.2", "role": "B", "text": "Yeah."}, {"startTime": "3567.33", "endTime": "3586.35", "role": "B", "text": "Yeah. Uh if I if I say until January this is just to finish. Uh I want to have the deadline at end of December to finish all my project. I want to finish all these project when everything is finished. After that I can move to another one. But I don't want to Yeah."}, {"startTime": "3576.91", "endTime": "3577.29", "role": "C", "text": "Okay."}, {"startTime": "3582.29", "endTime": "3582.55", "role": "A", "text": "Mm-hmm."}, {"startTime": "3584.3", "endTime": "3586.22", "role": "C", "text": "Anyway , the recording is finished , I think."}, {"startTime": "3586.59", "endTime": "3586.76", "role": "C", "text": "Yeah."}, {"startTime": "3588.5", "endTime": "3589.06", "role": "B", "text": "No. No."}, {"startTime": "3589.04", "endTime": "3608.8", "role": "C", "text": "So I try my best until January. And um and I try to do what Jean-Marc uh described to give you a first feedback on the different cards. Uh and uh and from there it would m yeah."}, {"startTime": "3598.63", "endTime": "3598.98", "role": "D", "text": "Mm-hmm."}, {"startTime": "3611.24", "endTime": "3621.54", "role": "D", "text": "And then we d make a decision in the sense whether you continue working or we try to find the time in a different way or we try to eliminate your other priorities you're under. Hmm?"}, {"startTime": "3612.75", "endTime": "3613.03", "role": "C", "text": "Yeah."}, {"startTime": "3615.11", "endTime": "3615.4", "role": "C", "text": "Yeah."}, {"startTime": "3620.72", "endTime": "3621.04", "role": "C", "text": "Mm-hmm."}, {"startTime": "3621.73", "endTime": "3625.12", "role": "A", "text": "I'm I'm wondering whether still we could ask for to get an intern for this."}, {"startTime": "3625.15", "endTime": "3625.36", "role": "D", "text": "Yep."}, {"startTime": "3626.63", "endTime": "3648.94", "role": "A", "text": "I mean uh Yeah , this is uh still uh even even the non-diploma work. I mean the things we could ask uh but I would yeah. Yeah."}, {"startTime": "3626.71", "endTime": "3638.38", "role": "B", "text": "Uh I I don't know regarding H_E_V_S_. I don't know if this is uh still in time. But you can have you can ask for a student , a d a diploma work."}, {"startTime": "3644.69", "endTime": "3652.77", "role": "D", "text": "I think that's that's a different problem. The problem is really up to you guys , whether you think it's good to have one person."}, {"startTime": "3654.77", "endTime": "3677.08", "role": "D", "text": "Try to have that because uh I cannot say we have tried to have W exactly , it wi but better no person than a bad person anyway. Yeah. Okay."}, {"startTime": "3656.36", "endTime": "3674.75", "role": "C", "text": "I would say uh let's let's yeah , let's try to have one uh students uh to help us on that. I don't know. That is very well , we have to choose whether the students it's too it'd be stupid. But uh uh the the student should have knowledge about M_F_C_ with oh okay. Yeah. Mm-hmm."}, {"startTime": "3656.82", "endTime": "3657.1", "role": "A", "text": "Yeah."}, {"startTime": "3662.51", "endTime": "3662.67", "role": "A", "text": "Mm."}, {"startTime": "3665.02", "endTime": "3670.03", "role": "A", "text": "Well you Yeah , that's that's the issue. Yeah. Well , but yeah."}, {"startTime": "3674.31", "endTime": "3674.69", "role": "A", "text": "Yeah."}, {"startTime": "3678.5", "endTime": "3683.27", "role": "C", "text": "Doesn't mean that we d we have to to stop talking yet. But uh the recording has finished."}]